沈 暑必挟湿，伤在气分，古称滞下，此滞字，非停滞饮食，言暑湿内侵，腑中流行阻遏，而为滞矣，消导，升举，温补，暑邪无有出路，胸痞不饥，不食，粘腻未已，而肛门沉坠里结，三焦皆受邪蒸，上下浑如两截，延为休息痢疾，缠绵展转，岂旦晚骤愈之病。（暑湿热）

淡干姜 生姜 小川连 淡黄芩 人参 枳实

徐 夏季痢症，多是湿热食积，初起宜分消其邪，但肌柔白嫩，乃气虚之质，且性情畏药，只宜少与勿过。

槟榔汁 青皮 陈皮 厚朴 川连 黄芩 木香 炒黑山楂

厚朴 黄芩 川连 木香汁 楂肉 炒银花 麦芽

卢 痢症湿热，皆是夏令伏邪，但以攻消，大伤胃气，不能去病，今微呕，不饥不寐，大便欲解不通，是九窍六腑不和，总是胃病。

人参（一钱） 吴萸炒川连（四分） 泡淡生干姜（五分） 茯苓（三钱） 川楝子肉（一钱） 生白芍（一钱半）

某（女） 舌色灰黄，渴不多饮，不饥恶心，下利红白积滞，小溲不利此，暑湿内伏，三焦气机不主宣达，宜用分理气血，不必见积，以攻涤下药。

飞滑石 川通草 猪苓 茯苓皮 藿香梗 厚朴 白蔻仁 新会皮

陆（氏） 经来暑秽痧胀，心烦自利黑瘀。

陈（妪） 泻痢两月，肢体浮肿，高年自属虚象，但胸脘痞闷，纳谷恶心，每利必先腹痛，是夏秋暑热，郁滞于中，虚体挟邪，焉有补涩可去邪扶正之理，恐交节令变症，明是棘手重症矣。

某 脐上青筋突痛，太阴脾受伤，此前症也，近日腹痛白积，两旬不已，是新受夏秋暑湿，与病异岐，先理新病，导气分消主之。

藿香 厚朴 广皮 茯苓皮 川连 木香 木瓜 扁豆

某 痰哮宿病，正在初秋而发，又值寒热下痢血积，腹痛吐逆，脉来右弦左弱，目黄羞明，必是暑湿凝滞着里，以补虚之中，佐以清邪，乃通剂法。

王 痢疾古称滞下，乃是湿热气薄肠胃，阻闭气分，故利仍不爽，河间丹溪，佥用清热导气者为此。（湿热）

黄芩 川连 草决明 炒黑楂肉 生白芍 石莲 丹皮 广木香汁

倪（六十） 面垢舌白，心下脘中，凄凄痛窒，至圊复便不爽，此水谷之湿，内蒸为热，气道阻闭，上热下冷，若外受客邪，既过募原，必有寒热矣。

淡黄芩 川连 淡竹叶 槟榔汁 白芍 厚朴 广皮白

某 湿温下痢，脱肛，五苓散加寒水石。

江 食物不调，肠胃蕴蓄，郁蒸积聚而滞下，三月不愈清疏带补之。

人参 川连 炒白芍 炒楂肉 广皮 茯苓 炒当归 乌梅

陆 湿热内蕴，中焦痞结，阳气素虚体质，湿注自利不爽，神识昏乱，将变柔痉。

顾 得汤饮，腹中漉漉，自利稀水，平昔酒客留湿，湿胜内蕴，肠胃不爽，凝积，东垣清暑益气，亦为湿热伤气而设，但脾胃久病，仍能纳食，当苦味坚阴，芳香理脾。

生茅术（四两） 炒黑黄柏（二两） 炒黑地榆（二两） 猪苓（一两半） 泽泻（一两半）

水法丸，服三钱。

葛（四十） 酒客，大便久泻，胁上曾发痈疡，春夏胁下有形，腹形满胀，此久蕴湿热，痈脓自利，未能泄邪，肠胃气壅，利频不爽，法当分消以去湿热，若攻劫太过，必伤脾胃，议用丹溪小温中丸，早进二钱五分，夜进二钱五分，三两。

某 潮热，自利，腹痛。

黄芩 生白芍 枳实 桔梗 槟榔汁 木香汁

徐 能食，腹痛，下痢，兼和其阴。

某（十六） 湿热内蒸下利红积。

炒黑神曲 炒黑楂肉 茯苓皮 飞滑石 新会皮 厚朴 淡竹叶 扁豆叶

祝（三八） 十年久痢，须推饮食避忌，酒客湿滞肠中，非风药之辛，佐苦味入肠，何以胜湿逐热，久病饮食不减，肠中病也。

绵茵陈 香白芷 北秦皮 茯苓皮 黄柏 藿香

某 形瘦阴亏，湿热下痢，误投消食，反劫津液，邪未尽，津先耗，咽喉痛，且呛咳，所谓湿未罢，已上燥矣。

川连 银花 通草 黄芩 川贝 茯苓皮

某 湿热内阻气分，腹痛下痢，目眦黄，舌光不渴，议清里泄湿热。

黄芩 寒水石 川连 厚朴 秦皮 郁金

山（五十） 湿郁腹痛，利红如豆汁。

生茅术（三钱） 炒山楂（一钱半） 厚朴（一钱） 红曲（一钱半） 广皮（一钱） 猪苓（一钱）

某 夏秋痢疾，固是湿热伤气，脾胃气滞，后重里急不爽，古方香连丸，取其清里热，必佐理气，谓气行斯湿热积聚无容留矣，知母生地，滋阴除热，治阴分阳亢之火，与痢门湿热大异，盖滋则呆滞，气钝窒塞，宜乎欲便不出，究竟湿热留邪仍在，桂附热燥，又致肛坠，痛如刀割，补中益气东垣成法，仅仅升举下焦清阳，未能直透肠中，再用大黄重药，兼知母生地等味，更令伤及下焦，书义谓诸痢久，都属肾伤，小腹痛坠，忌冷，显然是下症，议与升阳，亦须下治。

人参 茯苓 泽泻 炙草 防风根 羌活 独活 细辛 生姜 大枣

某 舌白，渴不欲饮，心腹热，每痢必痛，肛坠，痢又不爽，微呕有痰，口味有变，头中空痛，两颊皆赤，此水谷气蒸湿热，郁于肠胃，清浊交混，忽加烦躁难鸣苦况，法当苦寒泄热，苦辛香流气渗泄利湿，盖积滞有形，湿与热本无形质耳。

川连 黄芩 郁金 厚朴 猪苓 槐米 秦皮

包 先厥，下利脓血，腹痛呕恶，乃寒热互伤。（厥阴伏热）

淡黄芩 川连 丹皮 生芍 炮姜 炒银花

陈（氏） 温邪经旬不解，发热自利，神识有时不清，此邪伏厥阴，恐致变痉。

白头翁 川连 黄芩 北秦皮 黄柏 生白芍

邱（妪） 进润剂，痛缓积稀，知厥阴下利，宜柔宜通，血虚有风显然。

某 热渐入里，胸痞便泄，议酸苦泄热。

蔡 内虚邪陷，协热自利，脉左小右大，病九日不减，是为重症，议用白头翁汤方，加黄芩白芍。（协热痢）

潘 时令暑湿，都从口鼻而受，气郁则营卫失于转运，必身热无汗，其邪自上以及中，必循募原，致肠胃亦郁，腹痛泻积，无非湿热之化，此分消利湿则可，若以表药，则伤阳气矣。

茯苓 陈皮 厚朴 木香 炒扁豆 炒山楂

北秦皮 白头翁 茯苓 泽泻 炒银花 益元散

某 春温内陷下痢，最易厥脱。

王 热毒逗留不化，潮热下利。

张（三三） 江南地薄气弱，夏季食物内蕴，时令热迫内聚，湿热赤痢，入冬不愈，皆饮食不忌之累，宜淡薄滋味。（血痢）

生茅术 厚朴 南山楂 草果仁 樗根皮 槐花 广皮 银花

某（二四） 血痢半载，少腹痛。

六味地黄加炒楂肉炒延胡。

某 血积痛痢，起于夏令，秋半不减，明是湿热滞于肠胃，久延，面色消夺，右脉搏大，乃痢症所大忌，稍通积聚，兼以和血。

酒炒大黄 川连 黄芩 丹皮 肉桂 归身 白芍 生甘草

袁（二七） 久痢，腹疼，下血。

生黄芪（三钱） 生白术（三钱） 炒归身（一钱） 炒楂肉（二钱） 炒地榆（一钱半） 广皮（一钱） 厚朴（一钱） 羌活（五分） 防风根（五分）

朱（三九） 下痢带瘀血，肛中气坠，腹不痛。

炒黑樗根皮（一两） 生茅术（一钱） 生黄柏（一钱） 炒黑楂肉（三钱） 炒黑地榆（一钱半） 炒焦银花（一钱半） 赤苓（三钱） 猪苓（一钱半）

某 痛痢不爽，已有血下，暑湿不独在气分，且积劳茹素，攻夺宜慎。

某 脉缓，脐上痛，便稀溺短，此乃湿郁脾胃之阳，致气滞里急，宗古人导湿分消意。（阳虚气滞）

生茅术 广皮 厚朴 官桂 飞滑石 茯苓 猪苓 泽泻 炒山楂

张（五七） 脉沉伏，久痢腹痛，畏寒少食，气弱肠滞，以温通方法。

当归 肉桂心 茯苓 厚朴 南山楂 生麦芽

王（六二） 平昔温补相投，是阳不足之体，闻患痢两月，不忌食物，脾胃滞壅，今加呕恶，夫六腑宜通，治痢之法，非通即涩，肛肠结闭，阳虚者，以温药通之。

熟附子 制大黄 厚朴 木香 茯苓皮

范（二七） 痢称滞下，谓有滞必先痛后下，况病起不慎口腹，阳气窒塞，积聚留着，试阅前方，宣通者有效，守补则病剧，六腑皆以宣通为用。

附子 大黄 茯苓 厚朴 生草果 广皮

附子 制大黄 茯苓 广皮 厚朴 生益智 木香 猪苓

李 痢将两月，目微黄，舌白口干，唇燥赤，腹满，按之软，竟日小便不通，病者自述肛门窒塞，努挣不已，仅得迸出粘积点滴，若有稀粪，自必倾肠而多，思夏秋间暑湿内着为痢，轩岐称曰滞下，谓滞着气血，不独食滞一因，凡六腑属阳，以通为用，五脏皆阴，藏蓄为体，先泻后痢，脾传肾则逆，即土克水意，然必究其何以传克之由，盖伏邪垢滞从中不清，因而下注矣，迁延日久，正气因虚，仲景论列三阴，至太阴篇中，始挈出腹满字样，脾为柔脏，惟刚药可以宣阳驱浊，但今二肠窒痹，气不流行，理中等法，决难通腑，考内经二虚一实者治其实，开其一面也，然必温其阳，佐以导气逐滞，欲图扭转机关，舍此更无他法。

制附子 生厚朴 木香 制大黄 炒黑大茴

早服炒焦肾气丸，午服参苓白术散加益智仁。

许（三三） 劳倦咳嗽失血，仍然不避寒暑，食物腹中泻痢，病上加病，后感，法当先治，以分病有新旧。（阳虚）

厚朴 益智 广皮 茯苓皮 白芍 炙草 木瓜 炒扁豆

白芍（桂酒拌） 益智 广皮 茯苓 焦白术 炙草 谷芽 砂仁壳

张 下痢泄泻之后，诊脉右弦大，胃虚少纳，阳弱不司运化，法当通腑之阳。

人参 益智仁 炒菟丝饼 炒砂仁末 茯苓 广皮白

陆（二六） 腹满自痢，脉来濡小，病在太阴，况小便清长，非腑病湿热之比，法当温之。

许（二四） 痢疾一年，已浮肿溺涩，古称久痢必伤肾，月前用理阴煎不应，询及食粥吞酸，色瘁脉濡，中焦之阳日惫，水谷之湿不运，仍辛温以苏脾阳，佐以分利，用胃苓汤，去甘草加益智。

陈 痢积虽然少缓，诸款不减，面色青晦，四肢厥冷，仍在险途，拟进益黄散法。

人参 煨益智仁 公丁香 茯苓 广皮 青皮 木瓜 炒冬米

某 脉微细，肢厥，下痢无度，吴茱萸汤，但能止痛，仍不进食，此阳败阴浊，腑气欲绝，用桃花汤。

某 痢后大便不实，食不健运，色脉俱是虚象，此清阳失旷于中，阴气先走泄于下，先理中焦，再当摄阴。

某 自利不渴者属太阴，呃忒之来，由乎胃少纳谷，冲气上逆，有土败之象，势已险笃，议金匮附子粳米汤。

某 长斋有年，土薄气馁，加以久痢少谷欲呕，脾胃之阳衰矣，由夏及今，半载不痊，倘忽肿胀，何法施治。

人参 白术 干姜 炮姜 丁香 茯苓

袁 中下阳微，呕呃下利，温中不应，恐延衰脱，夫阳宜通，阴宜守，此关闸不致溃散，春回寒谷，生气有以把握，候王先生主议。

某 春痢入冬，痢止，腹痛食少，童年那有淫欲之扰，此系寒热不和，脾胃受伤也。

六君子汤加肉桂。

某 脉沉微，下痢红紫黑，舌胎粉白，并不渴饮，此太阴脾营虚寒也，仿理阴煎。（脾营虚寒）

当归头 白芍 炮姜 炙草 茯苓 益智

唐（氏） 下痢四十余日，形寒腹痛。

炒当归 生白芍 肉桂 炒山楂 青皮 茯苓

沈 议堵截阳明一法。（阳明不阖）

某（六四） 高年下痢，痰多舌干，脉右空大，神困音低，乃脾肾两亏，二气交虚，有年致此，恐非宜。（脾肾兼虚）

王（五十） 久痢久泻为肾病，下泻久而阴伤气坠，四神丸治脾肾晨泄，辛温香燥皆刚，佐入五味酸柔，不过稍制其雄烈，此肛坠尻酸，乃肾液内少而气陷矣，腥油肉食须忌。

熟地 禹余粮石 五味子

蒋（五一） 久痢用辛甘温而效，是脾阳久伤，治由东垣法极是，述食血腥，滑必便溏，四肢忽有肉疹，营卫内应脾胃，气血未得充复，五旬外，下亦怯，用脾肾两补。

某 下痢腹痛舌干，肛坠，痢伤阴也。（痢伤阴液）

熟地炭 炒归身 炒白芍 炒楂肉 茯苓 炙草

某 滞浊下行痛缓，议养阴通腑。

孙 脉左数，下利，腹不甚痛，暮夜微热，所伏暑热，乘阴虚下陷，是清热理脾不效，当摄阴升阳。

熟地炭 当归炭 山楂炭 炒黑麦芽 炙黑甘草 防风根 炒黑升麻

人参 山药 炙草 炒乌梅 木瓜 炒湖莲肉

蔡 脉右数，左细数，面垢舌燥，白苔点点，肌肤甲错，左胁动气，伏暑当秋凉而发，初病如疟，当从苦辛寒法，里邪炽烈，变为下痢，胃津被劫，阴液大耗，昔贤于热病液涸，急以救阴为务，苟胃关得苏，渐以冀安，否则犯喻氏所指，客邪内陷，液枯致危之戒矣。

复脉汤去姜桂麻。

鲍 痢久，阴液消亡，无以上承，必唇燥舌干，奈胃关不和，善噫难饥，此由阴腻柔剂所致，择其不腻滞者调之。

人参 炙草 炒白芍 炒乌梅肉 炒麦冬 茯神

周（五十） 痢后气坠，都主阴伤，但嗔怒不已，木犯土，致病留连，摄阴之中，聊佐和肝。

熟地 茯苓 炒山楂 炒乌梅 木瓜

某 阴液涸，则小水不通，胃气逆，则厌食欲呕，此皆痢之款症也，治以中下二焦为主，议理阴煎。

吴（三十） 痢久阴伤腹痛，肛门坠胀，秋病入冬不愈，已属休息症，和阴剂中，仍有升降，仿东垣法。

炒熟地 炒当归 炒白芍 炙草 生山楂 生谷芽

陈（三七） 泻痢久则伤肾，多见下焦沉坠，先伤在阴，刚药不效。（久痢伤肾下焦不摄）

人参 鹿茸 菟丝子 茯苓 舶茴香 制补骨脂 砂仁

张（五一） 晨泄痢血属肾病，无痛坠等因，用黑地黄丸。

范 泻痢起于长夏，医谓时令湿热，胃苓汤，芩芍法，固非谬讹，因高年肾阳肝阴先亏，使客气内扰阻遏，中流乏砥柱坐镇，致狂澜滔天耳，病经两旬不减，重阴无阳，验诸神识尚清，其外邪为少，而内损为多八脉无权，下无收摄，漏卮不已，理必生阳泄，下焦冷，此皆阴阳二气微绝治病则夯，治本为宜，非置之不理，实究天人而已。

人参（二钱） 鹿茸（二钱） 炒黑当归（三钱） 生杜仲（三钱） 生沙苑（一钱） 茯苓（三钱）

李（五十） 自痢五六年，即周身痛痹，盖肠胃病，致经络筋骨藩篱疏撤，阳失卫，药难效灵，书此代煎。

冬于术 苁蓉 熟附子

河水煎。

吴（四九） 治痢大法，无过通塞二义，夏秋湿热固多，初痢不痛，已非湿热，色滞者，肠中陈腐也，至今痛而痢，痢后复痛，按之痛减属虚，小雪不愈，阳不来复，久痢治肾，然非滋腻，先用苓姜术桂汤。

某（氏） 治痢古法，不越通涩，经停有瘕，腹浮肿，八脉之病，医惑于见痢，认为脾胃症，议用济生肾气丸。

朱（五七） 痢久肛坠，是下焦肾虚，失于收纳，治脾胃药无功。

熟地炭 炒归身 赤石脂 五味子 炒楂肉

周（四六） 痢久必伤肾阴，八脉不固，肠腻自滑而下，但执健脾无用，病不在中，纳谷运迟，下焦坎阳亦衰，用三神丸。

某 痢久阴阳两伤，少腹肛坠，连两腰胯脊髀酸痛，由脏腑络伤，已及奇经，前议轻剂升阳颇投，仍从下治。

周 转方柔药相安，显然久痢伤及肾阴，当用理阴煎，兼用禹粮石脂丸，以摄固肠中。

熟地炭 归身炭 人参 炙甘草 五味子 炒楂肉

兼服禹粮赤石脂丸。

金（氏） 脉数劲，下痢腹鸣痛，后坠，卧则气冲，咳嗽吐粘涎，产后过月，显是下损至中，纳谷日少，形神日衰，势已延成蓐劳，难期速功。

某（氏） 休息痢，经二年，明是下焦阴阳皆虚，不能收摄，经期不来，小腹抚摩有形上行，似乎瘕，其实气结，若不急进温补，恐滋扰肿胀之累也。

某 气虚下陷，门户不藏。（气虚下陷）

某 痢经五十日来，小愈再发，独见后重下坠，此为气陷，则门户不藏，亦胃弱内风乘袭，议陷者举之。

石 疟邪热气，内陷变痢，延已三月，脾胃气衰，面浮肚膨，仍有里急欲坠之象，中虚伏邪，进以和解。（疟变痢）

黄芩 柴胡 人参 丹皮 炒当归 白芍 谷芽 炒山楂

蔡 神气索然，腹中动气，舌红嗌干，寒热日迟，平素积劳致虚，邪伏厥阴，脉促细坚，温清难用，勉议复脉汤，存阴勿涸，希图援救。

复脉汤。

救逆汤去姜。

张 气衰热伏，腹痛下痢，脘中痞闷，不欲纳食，由疟变痢，经邪入腑，斯病势已重，清理湿热以开痞，延久必须扶正。

某 邪陷疟后变痢，伤及厥阴，症见气上撞心，饥不能食，干呕腹痛，全是肝病，肝为至阴之脏，相火内寄，仲景治法，不用纯刚燥热之药，以肝为刚脏故也，今正交土旺，土木为仇，五日内未为稳当。

人参 炒当归 炒白芍 炒乌梅肉 茯苓 淡吴萸 生香附汁 真北秦皮

孙 下痢无积，肛坠，肠间汩汩有声，此属肠风，当用摄固。（肠风）

熟地炭 萸肉炭 炒归身 炒杞子 川断 北味肉

煎药送赤石脂丸三钱。

某 当年久痢，用三神丸得效，是脾肾两因，兼理气分之滞，体质阳虚，遇冷病加，今病起长夏，小水不通，必系夏热阻其宣化，久则气血凝着而为肠红，先与桂苓甘露饮，分消其湿。

包 （噤口痢。）

川连 人参 黄芩 白芍 草决明 炒山楂 炒银花

白头翁汤。

川连 干姜 黄芩 银花 炒山楂 白芍 木香汁

生地 阿胶 人参 生白芍 炒山楂 炒银花

矫 初起无寒热，即泻痢呕恶不食，乃噤口痢重病，夫暑邪之伤，由口鼻吸气而入，邪与水谷交混，蒸变湿热，酿为积滞脓血，肠胃气窒，欲解不能通爽，遂致里结后重，香连苦辛，理气导湿清热，初用颇是，皆缘劳碌之人，非膏粱温养之质，淡薄积劳，中气易伤，四十日来，积少痛缓，医称病解，而食不下咽，不知饥饱，诊得脉弦，形衰，舌白，不渴饮水，日泻数行，全属胃倒气夺，中宫损极，下关不摄，谷不能咽，焉能承受汤药，药味气劣，胃衰必恶，久痢久泻，务在能食，古人非醒脾胃，即安肾摄纳，再询粉浆下咽，或呛或噎，议以上脘宜通其清阳，下焦当固摄其滑脱，仿古方中参苓白术散末，当以米饮日服二次，间以不腻滑之物，食些少勿多，以示胃之所喜为补，必得胃气渐醒，方有转危为安。

上药研细，秤准分两，每次用香粳米饮汤调服一钱五分，上药须日进二次。

鲍 舌心黄，边白，渴饮，水浆停胃脘，干呕微微冷呃，自痢稀水，小便不利，诊脉坚劲不和，八旬又二，暑湿热邪内着，必脾胃气醒，始可磨耐，以高年不敢过清过消，用清暑益气方法。

川连 黄芩 石莲子 煨干葛 青皮 人参 茯苓 厚朴 猪苓 泽泻

<D>痢症，古名滞下，惟夏秋暑湿挟积者居多，其次则风淫火迫寒侵也，推之燥气，独不为患，考前法，悉有定例，不必再述，至于暑者，有阴暑阳暑之源，其邪必兼乎湿，夫阴暑由于人之阳气先亏，加以贪凉喜冷，郁折生阳，故主于温，阳暑由于天之热伏，阻气化浊，则重于清，而医之下手工夫，于此须细心认定，但邪之来也，似水之流，脏腑间，一有罅隙，则乘虚而着，故有在气在血之分，伤脏伤腑之异，若表之邪郁，而气机下流不息者，喻氏论人参败毒散，里之积壅，而寒热交粘者，洁古立芍药汤，在气分，有苦辛调气，与辛甘益气等法，在血分，有酸苦行血，及咸柔养血诸方，若表症急，从乎三阳，有桂枝汤，葛根芩连汤，小柴胡汤，里势实，专究脾胃，有小承气汤，温脾汤，总之，治腑以三焦见症为凭，治脏以足三阴为要领，辨得虚实之情形，酌以或通或涩之法，则临症权宜，庶乎不错矣，但是症不治之条甚多，最难愈者，莫如休息痢，攻补之法非一，予亦不赘，最危险者，莫如噤口痢，却有两端，若因暑湿邪充，格拒三焦者，气机皆逆传而闭，上下之势，浑如两截，若治不得其要，则邪无出路，正立消亡，此丹溪立法最高，后世都宗其旨，先生又借用半夏泻心汤，减去守中之品，取补以运之，辛以开之，苦以降之，与病情尤为允协，所以先生之见长，是集之奥妙，每每在此，又因脾肾之阳素虚，阴邪从中而下者，先伤太阴，继伤少阴，关闸大开，痛泄无度，戊癸少化火之，机命阳无蒸变之力，此不饥不食，为呕为胀，理宜然矣，与邪多积热之候相比，绝然不同，参之仲景理中汤，肾气丸，及景岳理阴煎，胃关煎等法可也，吾乡姚颐真先生，化出快捷方式良法，以大剂苁蓉，配入参归姜附桂制白芍之类治之，靡不应手而愈，想苁蓉之性，温能达下，咸可利胃，质之柔润，以补阳中之阴，较地黄阿胶尤胜，与之肠膏竭尽，络脉结涩而痛者，堪称神品，自此推展，用治甚多，若曰某方某药，但治某症，不知活用，反称杜撰，则禁绝后人灵活之心，无从施发矣。（邵新甫）

徐评 夏秋之痢，总由湿热积滞，与伤寒传入三阴之痢不同，案中合法者亦甚多，一遇老年及久痢，即混入阴经治法，并参附乌梅五味等，全不对症，随笔乱书，并与案中之论，亦自己相背，想是习气使然，抑此中实无定见也，后人竟用温补，以为本之此老，杀人无算，触目伤怀。</D>