茅术 --- 茅术 川连 黄芩 厚朴 地榆 槐米

生茅术 --- 理中换生茅术生厚朴附子炭炮姜。

生茅术 --- 生茅术 人参 茯苓 新会皮 厚朴 炮附子 炮姜炭 地榆炭

防风 --- 人参 茅术 广皮 炙草 生益智 防风 炒升麻

附子 --- 人参（二钱半） 干姜（二钱半煨） 附子（三钱） 茅术（五钱） 升麻（三钱） 白术（二钱半） 厚朴（二钱半） 茯神（二钱半） 广皮（二钱半） 炙草（二钱半） 归身（一钱半） 白芍（一钱半） 葛根（二钱半） 益智（一钱半） 地榆（三钱半） 神曲（一钱半）

姜 --- 上药各制，姜枣汤丸。

炒当归 --- 焦术 炒当归 炒白芍 炙草 防风根 煨葛根 干荷叶

生白芍 --- 冬桑叶 丹皮 生白芍 黑山栀 广皮 干荷叶边 生谷芽

炮姜 --- 叶 嗔怒动肝，络血乃下，按之痛减为虚，夫肝木上升，必犯胃口，遂胀欲呕，清阳下陷，门户失藏，致里急便血，参术炮姜，辛甘温暖，乃太阴脾药，焉能和及肝胃，丹溪云，上升之气，自肝而出，自觉冷者，非真冷也，驻车丸二钱。

炒半夏 --- 人参 当归 枳实汁 炒半夏 桑叶 丹皮

白芍 --- 生地（三钱） 银花（三钱） 黄芩（一钱） 白芍（一钱半） 槐花（一钱）

黑稆豆皮 --- 细生地 丹参 黄柏 黑稆豆皮 地榆炭 柿饼灰 槐花 金石斛

三七 --- 某（三七） 内热，肠红发痔，当清阴分之热。

黑山栀 --- 生地 炒丹皮 酒炒黄芩 炒黑槐花 柿饼灰 玄参 银花 黑山栀

细生地 --- 细生地 川石斛 柿饼灰 天冬

黑地榆 --- 炒黑樗根皮（一两） 炒黑地榆（三钱） 炒黑丹皮（一钱） 五加皮（三钱） 炒焦银花（一钱半） 苍术（一钱） 茯苓（二钱） 炒泽泻（一钱）

生白芍 --- 炒黑樗根皮（一两） 炒生地（三钱） 炒银花（一钱半） 炒黑地榆（二钱） 归身（一钱半） 生白芍（一钱半） 炒丹皮（一钱） 茯苓（一钱半）

炒粳米 --- 人参 炒粳米 禹粮石 赤石脂 木瓜 炒乌梅

地榆炭 --- 萸肉炭 五味炭 黄柏炭 地榆炭 禹粮石 赤石脂

姜 --- 姜枣汤法

饴糖 --- 归脾饴糖丸。

天冬 --- 生地 玄参 天冬 川斛 茯神 炒牛膝

羊肉胶丸 --- 补阴丸五钱，又虎潜丸羊肉胶丸。

木香 --- 晚归脾去木香，早六味去丹、泽，加五味、芡实、莲肉、阿胶丸。

地黄 --- 沈（五五） 酒湿污血，皆脾肾柔腻主病，当与刚药，黑地黄丸，凡脾肾为柔脏，可受刚药，心肝为刚脏，可受柔药，不可不知，谦甫治此症，立法以平胃散作主，加桂附干姜归芍，重加炒地榆以收下湿，用之神效，即此意也。

人参 --- 吴（四二） 腹痛下血，食荸荠豆浆而愈，乃泄肺导湿之药，既愈以来，复有筋骨痿软，寒热，夜卧口干，乃湿去气泄，阳明脉乏，不主用事，营卫失度，津液不升之象，天真丸主之，去人参。

炒菟丝子 --- 人参 焦术 茯苓 炒菟丝子 广皮 生益智 木瓜

羊肉 --- 生精羊肉熬膏丸，服五钱。

补骨脂 --- 补骨脂 大茴香 五味 茯苓 生菟丝

三七 --- 陈（三七） 脉左虚涩，右缓大，尾闾痛连脊骨，便后有血，自觉惶惶欲晕，兼之纳谷最少，明是中下交损，八脉全亏，早进青囊斑龙丸，峻补玉堂关元，暮服归脾膏，涵养营阴，守之经年，形体自固。

白茯苓 --- 鹿茸（生切薄另研） 鹿角霜（另研） 鹿角胶（盐汤化） 柏子仁（去油烘干） 熟地（九蒸） 韭子 （盐水浸炒） 菟丝子（另磨） 赤白茯苓（蒸） 补骨脂（胡桃肉捣烂蒸一日揩净炒香）

盐 --- 上溶膏炼蜜为丸，每服五钱，淡盐汤送。

熟地 --- 鹿茸壮督脉之阳，鹿霜通督脉之气，鹿胶补肾脉之血，骨脂独入命门，以收散越阳气，柏子凉心以益肾，熟地味厚以填肾，韭子菟丝就少阴以升气固精，重用茯苓淡渗，本草以阳明本药，能引诸药，入于至阴之界耳，不用萸味之酸，以酸能柔阴，且不能入脉耳。

黑稆豆皮 --- 熟地 白芍 茯神 黑稆豆皮 炒焦乌梅肉

炒当归 --- 熟地炭 炒当归 炒楂肉 炒地榆 炒丹皮 冬桑叶

猪脊髓 --- 猪脊髓丸。

炒黑杞子 --- 人参 茯神 熟地炭 炒黑杞子 五味 炒地榆 生杜仲

熟地炭 --- 人参 茯神 湖莲肉 芡实 熟地炭 五味

鹿角霜 --- 鹿茸 鹿角霜 枸杞子 归身 紫石英 沙苑 生杜仲 炒大茴 补骨脂 禹余粮石

柏子仁 --- 旋覆花 新绛 青葱 桃仁 当归须 柏子仁

黑大豆 --- 柏子仁 泽兰 卷柏 黑大豆皮 茯苓 大腹皮

茅术 --- <D>便血一症，古有肠风脏毒脉痔之分，其见不外乎风淫肠胃，湿热伤脾二义，不若内经谓阴络受伤，及结阴之旨为精切，仲景之先便后血，先血后便之文，尤简括也，阴络即脏腑隶下之络，结阴是阴不随阳之征，以先后分别其血之远近，就远近可决其脏腑之性情，庶不致气失统摄，血无所归，如漏卮不已耳，肺病致燥涩，宜润宜降，如桑麻丸，及天冬地黄银花柿饼之类是也，心病则火燃血沸，宜清宜化，如竹叶地黄汤及补心丹之类是也，脾病必湿滑，宜燥宜升，如茅术理中汤，及东垣益气汤之类是也，肝病有风阳痛迫，宜柔宜泄，如驻车丸，及甘酸和缓之剂是也，肾病见形消腰折，宜补宜填，如虎潜丸及理阴煎之类是也，至胆经为枢机，逆则木火煽营，有桑叶山栀柏子丹皮之清养，大肠为燥腑，每多湿热风淫，如辛凉苦燥之治，胃为水谷之海，多气多血之乡，脏病腑病，无不兼之，宜补宜和，应寒应热，难以拘执而言，若努力损伤者，通补为主，膏粱蕴积者，清疏为宜，痔疮则滋燥兼投，中毒须知寒热，余如黑地黄丸，以治脾湿肾燥，天真丸，以大补真气真精，平胃地榆之升降脾胃，归脾之守补心脾，斑龙以温煦奇督，建中之复生阳，枳术之疏补中土，禹粮赤脂以堵截阳明，用五仁汤复从前之肠液养营法善病后之元虚，此皆先生祖古方而运以匠心，为后学之津梁也。（邵新甫）

人参 --- 徐评 以上诸案，肠红痔血，俱不能分别，人参姜桂一概乱投，此老与此症竟茫然无知，误人不少，案中不但痔血一症，混入肠红，即知其为痔血矣，而痔血之方又不中病，盖另有治法，不得与肠红方等也，便血肠中必有受之处，褚氏所谓肠有窍便血杀人是也，当知填窍之法，今惟知用人参姜附及五味等燥热收敛之药，助其肠中之火，而于脱血之后，更劫其阴，苟非纯虚，是益其疾矣。</D>