郑 夏至后，湿热内蒸，肠风复来，议酸苦法。（湿热）

又驻车丸二钱。

某 脉右数，形色苍黑，体质多热，复受长夏湿热内蒸，水谷气壅，血从便下，法以苦寒，佐以辛温，薄味经月，可冀病愈。

茅术 川连 黄芩 厚朴 地榆 槐米

程 年前痰饮哮喘，不得安卧，以辛温通阳劫饮而愈，知脾阳内弱，运动失职，水谷气蒸，饮邪由湿而成，湿属阴，久郁化热，热入络，血必自下，但体质仍属阳虚，凡肠红成方，每多苦寒，若脏连之类，于体未合，毋欲速也。

俞 阳虚，肠红洞泻，议劫胃水。（阳虚寒湿）

理中换生茅术生厚朴附子炭炮姜。

程（十七） 脉沉粪后下血，少年淳朴得此，乃食物不和，肠络空隙所渗，与升降法。

生茅术 人参 茯苓 新会皮 厚朴 炮附子 炮姜炭 地榆炭

程（三一） 食入不化，饮酒厚味即泻，而肠血未已，盖阳微健运失职，酒食气蒸，湿聚阳郁，脾伤清阳日陷矣，议用东垣升阳法。（湿遏脾阳）

人参 茅术 广皮 炙草 生益智 防风 炒升麻

某 阳虚体质，食入不化，饮酒厚味即泻，而肠血未止，盖阳微健运失职，酒食气蒸湿聚，脾阳清阳日陷矣，当从谦甫先生法。（中虚湿下陷）

人参（二钱半） 干姜（二钱半煨） 附子（三钱） 茅术（五钱） 升麻（三钱） 白术（二钱半） 厚朴（二钱半） 茯神（二钱半） 广皮（二钱半） 炙草（二钱半） 归身（一钱半） 白芍（一钱半） 葛根（二钱半） 益智（一钱半） 地榆（三钱半） 神曲（一钱半）

上药各制，姜枣汤丸。

温 湿胜中虚，便红。

焦术 炒当归 炒白芍 炙草 防风根 煨葛根 干荷叶

刘（六一） 郁怒，肠红复来，木火乘腑络，腹中微痛，议与和阴。（郁怒木火犯土）

冬桑叶 丹皮 生白芍 黑山栀 广皮 干荷叶边 生谷芽

张 二年前冲气入脘，有形痛呕，粪前后有血，此属厥阳扰络，风动内烁，头巅皆眩痛，每日用龙荟丸。

叶 嗔怒动肝，络血乃下，按之痛减为虚，夫肝木上升，必犯胃口，遂胀欲呕，清阳下陷，门户失藏，致里急便血，参术炮姜，辛甘温暖，乃太阴脾药，焉能和及肝胃，丹溪云，上升之气，自肝而出，自觉冷者，非真冷也，驻车丸二钱。

程（四六） 少阳络病，必犯太阴，脾阳衰微，中焦痞结，色痿如瘁，便后有血，论脾乃柔脏，非刚不能苏阳，然郁勃致病，温燥难投，议补土泄木方法。

人参 当归 枳实汁 炒半夏 桑叶 丹皮

参归，养脾之营，枳半通阳明之滞，桑丹泄少阳之郁。

某 凡有痔疾，最多下血，今因嗔怒，先腹满，随泻血，向来粪前，近日便后，是风木郁于土中，气滞为膨，气走为泻，议理中阳，泄木佐之。（木郁土中）

某 便红脉数。（大肠血热）

生地（三钱） 银花（三钱） 黄芩（一钱） 白芍（一钱半） 槐花（一钱）

程（二三） 脉数，能食肠红，阴自下泄，肠腑热炽所致，非温补之症。

细生地 丹参 黄柏 黑稆豆皮 地榆炭 柿饼灰 槐花 金石斛

某（三七） 内热，肠红发痔，当清阴分之热。

生地 炒丹皮 酒炒黄芩 炒黑槐花 柿饼灰 玄参 银花 黑山栀

汪 嗽血已止，粪中见红，中焦之热下移，肠胃属腑，止血亦属易事，花甲以外年岁，热移入下，到底下元衰矣。

赵（三六） 劳倦，便后血。

炒黑樗根皮（一两） 炒黑地榆（三钱） 炒黑丹皮（一钱） 五加皮（三钱） 炒焦银花（一钱半） 苍术（一钱） 茯苓（二钱） 炒泽泻（一钱）

钱（十八） 阴虚内热，肠红不止。

炒黑樗根皮（一两） 炒生地（三钱） 炒银花（一钱半） 炒黑地榆（二钱） 归身（一钱半） 生白芍（一钱半） 炒丹皮（一钱） 茯苓（一钱半）

蔡（三八） 脉濡小，食少气衰，春季便血，大便时结时溏，思春夏阳升，阴弱少摄，东垣益气之属升阳，恐阴液更损，议以甘酸固涩，阖阳明为法。（阳明不阖）

人参 炒粳米 禹粮石 赤石脂 木瓜 炒乌梅

某 能食，肠血，脉细色痿，肛痔下坠，议酸苦熄风坚阴。

萸肉炭 五味炭 黄柏炭 地榆炭 禹粮石 赤石脂

吴（二八） 中满过于消克，便血，食入易滞，是脾胃病，血统于脾，脾健自能统摄，归脾汤嫌其守，疏腑养脏相宜。（脾胃气滞）

姜枣汤法

某（二三） 便血如注，面黄，脉小，已经三载，当益胃法。（脾胃阳虚）

李（三十） 上年夏季，络伤下血，是操持损营，治在心脾。（心脾营损）

归脾饴糖丸。

朱 入暮腹痛鸣响，睾丸久已偏坠，春正下血经月，颜色鲜明，此痛决非伤瘀积聚，乃营损寒乘，木来侮土，致十四载之缠绵，调营培土，以甘泄木，散郁宜辛，节口戒欲，百天可效。

某（十八） 便后下血，此远血也。（脾不统血）

方 脉小左数，便实下血，乃肝络热腾，血不自宁，医投参芪归桂甘辛温暖，昧于相火寄藏肝胆，火焰风翔，上蒙清空，鼻塞头晕，呛咳不已，一误再误，遗患中厥，夫下虚则上实，阴伤阳浮冒，乃一定至理。（血去阴伤虚阳上冒）

补阴丸五钱，又虎潜丸羊肉胶丸。

某 肠红粘滞，四年不痊，阴气致伤，肛坠刺痛，大便不爽，药难骤功，当以润剂通腑。（阴虚血涩）

姚 劳伤下血，络脉空乏为痛，营卫不主循序流行，而为偏寒偏热，诊脉右空大，左小促，通补阳明，使开合有序。（劳伤营卫）

归芪建中汤。

唐（四七） 内经以阴络伤，则血内溢，盖烧酒气雄，扰动脏络聚血之所，虽得小愈，而神采爪甲不荣，犹是血脱之色，肛坠便甚，治在脾肾，以脾为摄血之司，肾主摄纳之柄故也。（脾肾虚）

晚归脾去木香，早六味去丹、泽，加五味、芡实、莲肉、阿胶丸。

沈（五五） 酒湿污血，皆脾肾柔腻主病，当与刚药，黑地黄丸，凡脾肾为柔脏，可受刚药，心肝为刚脏，可受柔药，不可不知，谦甫治此症，立法以平胃散作主，加桂附干姜归芍，重加炒地榆以收下湿，用之神效，即此意也。

吴（四二） 腹痛下血，食荸荠豆浆而愈，乃泄肺导湿之药，既愈以来，复有筋骨痿软，寒热，夜卧口干，乃湿去气泄，阳明脉乏，不主用事，营卫失度，津液不升之象，天真丸主之，去人参。

支（五六） 痔血久下，肌肉痿黄，乃血脱气馁，渐加喘促浮肿，再延腹胀，便不可为，此症脏阴有寒，腑阳有热，详于金匮谷疸篇中，极难调治。

人参 焦术 茯苓 炒菟丝子 广皮 生益智 木瓜

杨（四八） 中年形劳气馁，阴中之阳不足，且便血已多，以温养固下，男子有年，下先虚也。（肾阳虚）

生精羊肉熬膏丸，服五钱。

田（三八） 久矣晨泄腹痛，近日有红积，此属肾虚。

补骨脂 大茴香 五味 茯苓 生菟丝

陈（三七） 脉左虚涩，右缓大，尾闾痛连脊骨，便后有血，自觉惶惶欲晕，兼之纳谷最少，明是中下交损，八脉全亏，早进青囊斑龙丸，峻补玉堂关元，暮服归脾膏，涵养营阴，守之经年，形体自固。

鹿茸（生切薄另研） 鹿角霜（另研） 鹿角胶（盐汤化） 柏子仁（去油烘干） 熟地（九蒸） 韭子 （盐水浸炒） 菟丝子（另磨） 赤白茯苓（蒸） 补骨脂（胡桃肉捣烂蒸一日揩净炒香）

上溶膏炼蜜为丸，每服五钱，淡盐汤送。

鹿茸壮督脉之阳，鹿霜通督脉之气，鹿胶补肾脉之血，骨脂独入命门，以收散越阳气，柏子凉心以益肾，熟地味厚以填肾，韭子菟丝就少阴以升气固精，重用茯苓淡渗，本草以阳明本药，能引诸药，入于至阴之界耳，不用萸味之酸，以酸能柔阴，且不能入脉耳。

胡（十八） 上下失血，先泻血，后便泻，逾月，阴伤液耗，胃纳颇安，且无操家之劳，安养闲坐百日，所谓静则阴充。（肾阴虚）

汪 肾虚，当春阳升动咳嗽，嗽止声音未震，粪有血，阴难充复，不肯上承，用阴药固摄。

熟地 白芍 茯神 黑稆豆皮 炒焦乌梅肉

陈（三十） 肾阴虚络中热，肝风动，肠红三载不已，左胁及腹不爽，少阳亦逆，多以补中调摄，故未见奏功，姑用疏补，为益脏通腑。

熟地炭 炒当归 炒楂肉 炒地榆 炒丹皮 冬桑叶

猪脊髓丸。

某 沫血鲜红凝块紫黑，阴络伤损，治在下焦，况少腹疝瘕，肝肾见症，前此精浊日久，亦令阴伤于下。

人参 茯神 熟地炭 炒黑杞子 五味 炒地榆 生杜仲

人参 茯神 湖莲肉 芡实 熟地炭 五味

陈（氏） 脉小，泻血有二十年，经云，阴络伤，血内溢，自病起十六载，不得孕育，述心中痛坠，血下不论粪前粪后，问脊椎腰尻酸楚，而经水仍至，跗膝常冷，而骨髓热灼，由阴液损伤，伤及阳不固密，阅频年服药，归芪杂入凉肝，焉是遵古治病，议从奇经升固一法。（奇脉伤）

鹿茸 鹿角霜 枸杞子 归身 紫石英 沙苑 生杜仲 炒大茴 补骨脂 禹余粮石

蒸饼浆丸。

张（三九） 劳力见血，胸背胁肋诸脉络牵掣不和，治在营络。（劳力伤络）

计（五三） 瘀血必结在络，络反肠胃而后乃下，此一定之理，平昔劳形奔弛，寒暄饥饱致伤，苟能安逸身心，瘀不复聚，不然年余再瘀，不治。（血瘀在络）

旋覆花 新绛 青葱 桃仁 当归须 柏子仁

宋（氏） 当年肠红，继衄血喉痛，已见阳气乘络，络为气乘，渐若怀孕者，然气攻则动如梭，与胎动迥异，倘加劳怒，必有污浊暴下，推理当如是观。

柏子仁 泽兰 卷柏 黑大豆皮 茯苓 大腹皮

<D>便血一症，古有肠风脏毒脉痔之分，其见不外乎风淫肠胃，湿热伤脾二义，不若内经谓阴络受伤，及结阴之旨为精切，仲景之先便后血，先血后便之文，尤简括也，阴络即脏腑隶下之络，结阴是阴不随阳之征，以先后分别其血之远近，就远近可决其脏腑之性情，庶不致气失统摄，血无所归，如漏卮不已耳，肺病致燥涩，宜润宜降，如桑麻丸，及天冬地黄银花柿饼之类是也，心病则火燃血沸，宜清宜化，如竹叶地黄汤及补心丹之类是也，脾病必湿滑，宜燥宜升，如茅术理中汤，及东垣益气汤之类是也，肝病有风阳痛迫，宜柔宜泄，如驻车丸，及甘酸和缓之剂是也，肾病见形消腰折，宜补宜填，如虎潜丸及理阴煎之类是也，至胆经为枢机，逆则木火煽营，有桑叶山栀柏子丹皮之清养，大肠为燥腑，每多湿热风淫，如辛凉苦燥之治，胃为水谷之海，多气多血之乡，脏病腑病，无不兼之，宜补宜和，应寒应热，难以拘执而言，若努力损伤者，通补为主，膏粱蕴积者，清疏为宜，痔疮则滋燥兼投，中毒须知寒热，余如黑地黄丸，以治脾湿肾燥，天真丸，以大补真气真精，平胃地榆之升降脾胃，归脾之守补心脾，斑龙以温煦奇督，建中之复生阳，枳术之疏补中土，禹粮赤脂以堵截阳明，用五仁汤复从前之肠液养营法善病后之元虚，此皆先生祖古方而运以匠心，为后学之津梁也。（邵新甫）

徐评 以上诸案，肠红痔血，俱不能分别，人参姜桂一概乱投，此老与此症竟茫然无知，误人不少，案中不但痔血一症，混入肠红，即知其为痔血矣，而痔血之方又不中病，盖另有治法，不得与肠红方等也，便血肠中必有受之处，褚氏所谓肠有窍便血杀人是也，当知填窍之法，今惟知用人参姜附及五味等燥热收敛之药，助其肠中之火，而于脱血之后，更劫其阴，苟非纯虚，是益其疾矣。</D>