吴 风湿相搏，一身尽痛，加以堕水，外寒里热，痛极发厥，此属周痹。（周痹）

桂枝木 片姜黄 羚羊角 海桐皮 花粉 白蒺藜

鲍（四四） 风湿客邪，留于经络，上下四肢流走而痛，邪行触犯，不拘一处，古称周痹，且数十年之久，岂区区汤散可效，凡新邪宜急散，宿邪宜缓攻。

蜣螂虫 全蝎 地龙 穿山甲 蜂房 川乌 麝香 乳香

上药制末，以无灰酒煮黑大豆汁泛丸。

杜（三三） 温暖开泄，骤冷外加，风寒湿三气交伤为痹，游走上下为楚，邪入经隧，虽汗不解，贵乎宣通。

黄芪（四两） 茯苓（三两） 生白术（三两） 炙草 淡苁蓉（二两） 当归（三两） 牛膝（二两） 仙灵脾（二两） 虎骨胶 金毛狗脊（十二两无灰酒浸半日蒸熬膏）

胶膏为丸。

刘（三一） 濒海飓风潮湿，着于经脉之中，此为周痹，痹则气血不通，阳明之阳不主司事，食腥腻遂不化为溏泻，病有六七年，正虚邪实，不可急攻，宜缓。

生白术 生黄芪 海桐皮 川桂枝木 羌活 防风

周 痛势流走而肿，后感外邪，参药不可与也，从行痹治。（行痹）

羌活 木防己 石膏 生甘草 海桐皮 杏仁

吴 寒入阴分，筋骨痛软，此为痹症，遗泄内虚，忌用表散劫真。

当归 沙苑 北细辛 桂枝木 生白术 茯苓

某（氏） 风湿发热，萃于经脉，肿痛游走，病名行痹，世俗呼为历节风是也。

俞 肩胛连及臂指，走痛而肿，一年，乃肢痹也，络虚留邪，和正祛邪。（肢痹）

黄芪 防风 海桐皮 生白术 归身 川羌活 片姜黄 白蒺藜

李（三四） 脉小弱，当长夏四肢痹痛，一止之后筋骨不甚舒展，此卫阳单薄，三气易袭，先用阳明流畅气血方。

黄芪 生白术 汉防己 川独活 苡仁 茯苓

朱（三二） 肢痹痛频发。

羚羊角 木防己 川桂枝尖 晚蚕砂 川萆薢 白通草 生苡仁 茯苓

汪 冬月温暖，真气未得潜藏，邪乘内虚而伏，因惊蛰节，春阳内动，伏气乃发，初受风寒，已从热化，兼以夜坐不眠，身中阳气，亦为泄越，医者但执风寒湿三邪合成为痹，不晓病随时变之理，羌防葛根，再泄其阳，必致增剧矣，焉望痛缓，议用仲景木防己汤法。

顾 湿热流着，四肢痹痛。

川桂枝 木防己 蚕砂 石膏 杏仁 威灵仙

某 左脉如刃，右脉缓涩，阴亏本质，暑热为疟，水谷湿气下坠，肢末遂成挛痹，今已便泻减食畏冷，阳明气衰极矣，当缓调，勿使成疾。（寒湿）

生白术 狗脊 独活 茯苓 木防己 仙灵脾 防风 威灵仙

徐（十九） 长夏湿胜气阻，不饥不食，四肢痹痛，痛甚于午后子前，乃阳气被阴湿之遏，色痿黄，脉小涩，以微通其阳，忌投劫汗。

茯苓 萆薢 木防己 晚蚕砂 泽泻 金毛狗脊

黎 肢腠麻痹，足膝为甚。

当归 杞子 生虎骨 油松节（各二两） 川芎 狗脊 萆薢 怀牛膝 仙灵脾 檀香泥 白茄根 沙苑（各一两）

火酒醇酒各半，浸七日。

某（三七） 寒湿滞于经络，身半以下筋骨不舒，二便不爽，若非迅疾飞走，不能效。蠲痛丹。

某 劳力感湿，腰痹酸痛，四肢乏力。

生杜仲 生苡仁 沙苑子 茯苓 粗桂枝木 金毛狗脊 晚蚕砂 木防己

某 十五年中，痹痛三发，述痛久流及肢节骨骱，屈曲之所皆肿赤，此寒湿变热为欲解，病在躯壳筋骨，无害命之理，但病深沉下甚，已属阴邪，小腹胀，小溲全无。

川独活（八分） 汉防己（八分） 川熟附（八分） 粗桂枝木（一钱） 茯苓（五钱） 川萆薢（一钱） 木猪苓（一钱）

茯苓（四两） 生白术（二两） 泡淡生干姜（一两） 肉桂（五钱）

以上四味，生研末，滚水泛丸，每早服三钱，开水下。

何（三六） 脉沉，目黄舌肿，周身四肢疹发，胃痛，肢末皆肿强，遇冷冻饮料凉即病，此久伏湿邪，阳气伤损，议温气分以通周行之脉。

川乌头 生白术 桂枝木 茯苓 半夏 姜汁

唐（妪） 右后胁痛连腰胯，发必恶寒逆冷，暖护良久乃温，此脉络中气血不行，遂至凝塞为痛，乃脉络之痹症，从阳维阴维论病。

王 努力，经气受伤，客邪乘卫阳之疏而入，风湿阻遏经隧，为肿为痛，大汗连出，痛仍不止，而大便反滑，其湿邪无有不伤阳气者，固卫阳以却邪，古人正治，以湿家忌汗耳。（风湿）

生于术（三钱） 防风根（五分） 生黄芪（三钱） 片姜黄（一钱） 桂枝木（五分） 海桐皮（一钱） 羌活（五分） 独活（五分）

人参（一钱） 生于术（二钱） 黄芪（二钱） 归身（一钱半） 肉桂（三分） 炙甘草（三分） 煨姜（一钱） 南枣（一枚）

炼蜜丸。

王 风湿痹痛。

防己 生于术 川独活 茯苓 炒黄柏 生苡仁

羚羊角 白蒺藜 海桐皮 滑石 大豆黄卷 苡仁

金 风湿热走痛，二便不通，此痹症也。

杏仁 木防己 寒水石 郁金 生石膏 木通

李 风湿肌肿而痛，畏热。

炒黄柏 茅术 制蒺藜 木防己 秦艽 钩藤

杨 四肢流走痹痛，风胜移走，湿凝为肿，下焦为甚，邪入阴分。

蠲痛丹。

蒋（氏） 便溏食少，腰腹以下骨骱肢节沉痛。

人参 生于术 制白松香 茯苓 汉防己 北细辛 川独活 苡仁

王 身半以上属阳，风湿雨露从上而受，流入经络，与气血交混，遂为痹痛，经月来，外邪已变火化，攻散诸法，不能取效，急宜宣通清解，毋使布及流注。

防己 姜黄 蚕砂 杏仁 石膏 滑石

毛（氏） 风湿相搏，一身肿痛，周行之气血为邪阻蔽，仿仲景木防己汤法。

洪（四三） 湿盛生热生痰，渐有痿痹之状，乃阳明经隧为壅，不可拘执左属血右属气也，金匮云，经热则痹，络热则痿，今有痛处，治在气分。（湿热）

生于术（三钱） 生黄芪（三钱） 片姜黄（一钱） 川羌活（一钱） 半夏（一钱） 防风（五分） 加桑枝（五钱）

黄芪 当归 炙草 防风 桂枝 肉桂

张 骨骱走注行痛，身体重着，不能转舒，此为湿痹，但阳虚之质，忌辛散苦寒药。

方 左脉弦大，面赤痰多，大便不爽，此劳怒动肝，令阳气不交于阴，阳维阳跷二脉无血营养，内风烁筋，跗A2K2痹痛，暮夜为甚者，厥阴旺时也，病在脉络。

金斛 晚蚕砂 汉防己 黄柏 半夏 萆薢 大槟榔汁

某（十九） 舌白目彩油光，腰痹痛，湿邪内蕴，尚未外达，必分利湿邪为主。

杏仁 苏梗 木防己 厚朴 茯苓皮 花粉 晚蚕砂 茵陈

吴（氏） 风湿化热，蒸于经络，周身痹痛，舌干咽燥，津液不得升降，营卫不肯宣通，怕延中痿。

石 脉数右大，温渐化热，灼及经络，气血交阻，而为痹痛，阳邪主动，自为游走，阳动化风，肉腠浮肿，俗谚称为白虎历节之谓。

麻仁 鲜生地 川斛 丹皮 寒水石 钩藤

某 久痹酿成历节，舌黄痰多，由湿邪阻着经脉。

汉防己 嫩滑石 晚蚕砂 寒水石 杏仁 苡仁 茯苓

宋 病者长夏霉天奔走，内踝重坠发斑，下焦痛起，继而筋掣，及于腰窝左臂，经云，伤于湿者，下先受之，夫下焦奇脉不流行，内踝重着，阴维受邪，久必化热烁血，风动内舍乎肝胆，所谓少阳行身之侧也，诊得右脉缓，左脉实，湿热混处血络之中，搜逐甚难，此由湿痹之症失治，延为痿废沉疴矣，三年病根，非仓猝迅攻，姑进先通营络，参之奇经为治，考古圣治痿痹，独取阳明，惟通则留邪可拔耳。（湿热入血络）

鹿角霜 生白术 桂枝 茯苓 抚芎 归须 白蒺藜 黄菊花

某 初病湿热在经，久则瘀热入络，脓疡日多未已，渐而筋骨疼痛，金匮云，经热则痹，络热则痿，数年宿病，勿事速攻，夜服蒺藜丸。

（午服）犀角 玄参 连翘心 野赤豆皮 细生地 丹参 姜黄 桑枝

张（二九） 四肢经隧之中，遇天令阴晦，疼痛拘挛，痈疽疡溃脓，其病不发，疡愈病复至，抑且时常衄鼽，经以风寒湿三气合而为痹，然经年累月，外邪留着，气血皆伤，其化为败瘀凝痰，混处经络，盖有诸矣，倘失其治，年多气衰，延至废弃沉疴。（痰血壅塞经络）

当归须（四两） 干地龙（二两） 穿山甲（二两） 白芥子（一两） 小抚芎（一两） 生白蒺（二两）

酒水各半法丸。

沈 从来痹症，每以风寒湿三气杂感主治，召恙之不同，由乎暑暍外加之湿热，水谷内蕴之湿热，外来之邪，着于经络，内受之邪，着于腑络，故辛解汗出，热痛不减，余以急清阳明而致小愈，病中复反者，口鼻复吸暑热也，是病后宜薄味，使阳明气爽，斯清阳流行不息，肢节脉络舒通，而痹痿之根尽拔，至若温补而图速效，又非壮盛所宜。（暑伤气湿热入络）

竹沥姜汁法丸。

暮服白蒺藜丸。

某 冬月温舒，阳气疏豁，风邪由风池风府，流及四末，古为痹症，忽上忽下，以风为阳，阳主动也，诊视鼻明，阳明中虚可见，却邪之剂，在乎宣通经脉。（卫阳疏风邪入络）

桂枝 羚羊角 杏仁 花粉 防己 桑枝 海桐皮 片姜黄

沈（三七） 用养肝血熄风方，右指仍麻，行走则屈伸不舒，戌亥必心热烦蒸，想前法不效，杞归辛温，阳动风亦动矣，议去辛用咸，若疑虑途次疟邪未尽，致脉络留滞，兼以通逐缓攻亦妙。（肝阴虚疟邪入血络）

熟地 龟胶 阿胶 秋石 天冬 麦冬 五味 茯神

蜜丸晨服。

桃仁 穿山甲 干地龙 抚芎 归须 丹皮 红花 沙苑

香附汁丸，夜服。

某 仲景以经热则痹，络热则痿，今痹痛多日，脉中筋急，热入阴分血中，致下焦为甚，所谓上焦属气，下焦属血耳。（热入下焦血分）

某（四八） 脉弦劲，右足踝臁肿痛，得暖得摩稍适，此风寒湿三气，混入经隧而为痹也，当用辛温，宣通经气为要。（风寒湿入下焦经隧）

活络丹一丸，陈酒下。

某 痹痛在外踝筋骨，妨于行走，邪留经络，须以搜剔动药。

川乌 全蝎 地龙 山甲 大黑豆皮

某 病后过食肥腻，气滞热郁，口腻粘涎，指节常有痹痛，当从气分宣通方法。（气滞热郁）

陈（五四） 劳动太过，阳气烦蒸，中年液衰风旋，周身痹痛，此非客邪，法宜两调阳明厥阴。（肝胃虚滞）

黄芪 生白术 制首乌 当归 白蒺藜 黑稆豆皮

张（五三） 烦劳郁勃之阳，变现热气内风，内经以热淫风消，必用甘寒，前议谓酒客不喜甘味，且痰多食少，亦忌甘腻滋滞，用清少阳胆热者，酒气先入肝胆也，酒汁湿着，肠胃受之，理明以通胃，胃肠气机流行，食加，滑泄颇减，今者气热，当午上冒，经络痹痛亦减于平日，主以和阳甘寒，宣通经脉佐之。（肝胆风热）

童桑 羚羊角 天门冬 枸杞子 白蒺藜 丹皮 茯苓 霍山石斛

共熬膏。

某（氏） 血虚风痹，骨骱肿痛。

金（三二） 痹痛在下，重着不移，论理必系寒湿，但左脉搏数，经月遗泄三四，痛处无形，岂是六淫邪聚，然隧道深远，药饵未易奏功，佐以艾灸，冀得效灵。（精血虚）

枸杞子 肉苁蓉 虎骨胶 麋角胶 杜仲 桑椹子 天冬 沙苑 茯苓

溶胶丸。

孙 脉右大，阳明空，气短闪烁欲痛。（气虚）

人参 生黄芪 熟白术 炙草 广皮 当归 白芍 半夏 防风根 羌活

人参 黄芪 熟于术 炙草 桂枝 归身 白芍 川羌

沈 痹痛在右，气弱有痰。

生于术 川桂枝 川独活 片姜黄 白茯苓 陈防己

王 辛香走窜，宣通经隧壅结气分之湿，有却病之能，无补虚之益，大凡药饵，先由中宫以布诸经，中焦为营气之本，营气失养，转旋目钝，然攻病必藉药气之偏，朝夕更改，岂是去疾务尽之道，另于暮夜进养营一贴。（营虚）

吴（三六） 筋纵痛甚，邪留正痹，当此天暖，间用针刺以宣脉络，初补气血之中，必佐宣行通络之治。（筋痹）

生黄芪 防风 桂枝 炒黑常山 归身 青菊叶汁

某 痹痛偏左，入夜尤甚，血中之气不行。（血中气滞）

归须 桑枝 苡仁 白疾黎 姜黄 木防己

刘（三八） 周礼采毒药以供医事，盖因顽钝沉痼，着于躯壳，非脏腑虚损，故必以有毒攻拔，使邪不留存，凝着气血，乃效，既效矣，经云，大毒治病，十去其五，当此只宜爱护身体，勿劳情志，便是全功道理，愚人必曰以药除根，不知天地之气，有胜有复，人身亦然，谷食养生，可御一生，药饵偏胜岂可久服，不观方士炼服金石丹药，疽发而死者比比。（血虚络涩）

桑枝桂枝汤泛丸。

某 脉沉小数，营中留热，骱骨尚有微疼，宜通经络，佐清营热。（营中热）

钩藤 细生地 当归须 白蒺藜 丹皮 片姜黄

<D>此症与风病相似，但风则阳受之，痹则阴受之，故多重着沉痛，其在内经，不越乎风寒湿三气，然四时之令，皆能为邪，五脏之气，各能受病，其实痹者，闭而不通之谓也，正气为邪所阻，脏腑经络，不能畅达，皆由气血亏损，腠理疏豁，风寒湿三气，得以乘虚外袭，留滞于内，致湿痰浊血，流注凝涩而得之，故经云，三气杂至，合而为痹，又云风胜为行痹，寒胜为痛痹，湿胜为着痹，以及骨痹筋痹脉痹肌痹皮痹之义，可知痹病之症，非偏受一气足以致之也，然而病症多端，治法亦异，余亦不能尽述，兹以先生治痹之法，为申明一二，有卫阳疏，风邪入络而成痹者，以宣通经脉，甘寒去热为主，有经脉受伤，阳气不为护持而为痹者，以温养通补，扶持生气为主，有暑伤气湿热入络而为痹者，用舒通脉络之剂，使清阳流行为主，有风湿肿痛而为痹者，用参术益气，佐以风药壮气为主，有湿热伤气，及温热入血络而成痹者，用固卫阳以却邪，及宣通营络，兼治奇经为主，有肝阴虚，疟邪入络而为痹者，以咸苦滋阴，兼以通逐缓攻为主，有寒湿入络而成痹者，以微通其阳，兼以通补为主，有气滞热郁而成痹者，从气分宣通为主，有肝胃虚滞而成痹者，以两补厥阴阳明为治，有风寒湿入下焦经隧而为痹者，用辛温以宣通经气为主，有肝胆风热而成痹者，用甘寒和阳，宣通脉络为主，有血虚络涩，及营虚而成痹者，以养营养血为主，又有周痹行痹肢痹筋痹，及风寒湿三气杂合之痹，亦不外乎流畅气血，祛邪养正，宣通脉络诸法，故张景岳云，治痹之法，只宜峻补真阴，宣通脉络，使气血得以流行，不得过用风燥等药，以再伤阴气，亦见道之言也。（邹滋九）

徐评 案多重复，可删，既知风寒湿为痹，则尽属外邪可知，而用人参及温补之药者，十居二三，恐有留邪之患，凡属形体之疾，当外治，不明外治之法，服药虽中病，仅得医术之半耳。</D>