白蒺藜 --- 桂枝木 片姜黄 羚羊角 海桐皮 花粉 白蒺藜

川乌 --- 蜣螂虫 全蝎 地龙 穿山甲 蜂房 川乌 麝香 乳香

黑大豆 --- 上药制末，以无灰酒煮黑大豆汁泛丸。

金毛狗脊 --- 黄芪（四两） 茯苓（三两） 生白术（三两） 炙草 淡苁蓉（二两） 当归（三两） 牛膝（二两） 仙灵脾（二两） 虎骨胶 金毛狗脊（十二两无灰酒浸半日蒸熬膏）

生黄芪 --- 生白术 生黄芪 海桐皮 川桂枝木 羌活 防风

生甘草 --- 羌活 木防己 石膏 生甘草 海桐皮 杏仁

内虚 --- 吴 寒入阴分，筋骨痛软，此为痹症，遗泄内虚，忌用表散劫真。

北细辛 --- 当归 沙苑 北细辛 桂枝木 生白术 茯苓

白蒺藜 --- 黄芪 防风 海桐皮 生白术 归身 川羌活 片姜黄 白蒺藜

汉防己 --- 黄芪 生白术 汉防己 川独活 苡仁 茯苓

川萆薢 --- 羚羊角 木防己 川桂枝尖 晚蚕砂 川萆薢 白通草 生苡仁 茯苓

木防己 --- 汪 冬月温暖，真气未得潜藏，邪乘内虚而伏，因惊蛰节，春阳内动，伏气乃发，初受风寒，已从热化，兼以夜坐不眠，身中阳气，亦为泄越，医者但执风寒湿三邪合成为痹，不晓病随时变之理，羌防葛根，再泄其阳，必致增剧矣，焉望痛缓，议用仲景木防己汤法。

川桂枝 --- 川桂枝 木防己 蚕砂 石膏 杏仁 威灵仙

木防己 --- 生白术 狗脊 独活 茯苓 木防己 仙灵脾 防风 威灵仙

金毛狗脊 --- 茯苓 萆薢 木防己 晚蚕砂 泽泻 金毛狗脊

生虎骨 --- 当归 杞子 生虎骨 油松节（各二两） 川芎 狗脊 萆薢 怀牛膝 仙灵脾 檀香泥 白茄根 沙苑（各一两）

三七 --- 某（三七） 寒湿滞于经络，身半以下筋骨不舒，二便不爽，若非迅疾飞走，不能效。蠲痛丹。

金毛狗脊 --- 生杜仲 生苡仁 沙苑子 茯苓 粗桂枝木 金毛狗脊 晚蚕砂 木防己

汉防己 --- 川独活（八分） 汉防己（八分） 川熟附（八分） 粗桂枝木（一钱） 茯苓（五钱） 川萆薢（一钱） 木猪苓（一钱）

白术 --- 茯苓（四两） 生白术（二两） 泡淡生干姜（一两） 肉桂（五钱）

川乌头 --- 川乌头 生白术 桂枝木 茯苓 半夏 姜汁

生于术 --- 生于术（三钱） 防风根（五分） 生黄芪（三钱） 片姜黄（一钱） 桂枝木（五分） 海桐皮（一钱） 羌活（五分） 独活（五分）

生于术 --- 防己 生于术 川独活 茯苓 炒黄柏 生苡仁

大豆黄卷 --- 羚羊角 白蒺藜 海桐皮 滑石 大豆黄卷 苡仁

生石膏 --- 杏仁 木防己 寒水石 郁金 生石膏 木通

木防己 --- 炒黄柏 茅术 制蒺藜 木防己 秦艽 钩藤

汉防己 --- 人参 生于术 制白松香 茯苓 汉防己 北细辛 川独活 苡仁

防己 --- 防己 姜黄 蚕砂 杏仁 石膏 滑石

木防己 --- 毛（氏） 风湿相搏，一身肿痛，周行之气血为邪阻蔽，仿仲景木防己汤法。

生于术 --- 生于术（三钱） 生黄芪（三钱） 片姜黄（一钱） 川羌活（一钱） 半夏（一钱） 防风（五分） 加桑枝（五钱）

汉防己 --- 金斛 晚蚕砂 汉防己 黄柏 半夏 萆薢 大槟榔汁

木防己 --- 杏仁 苏梗 木防己 厚朴 茯苓皮 花粉 晚蚕砂 茵陈

鲜生地 --- 麻仁 鲜生地 川斛 丹皮 寒水石 钩藤

汉防己 --- 汉防己 嫩滑石 晚蚕砂 寒水石 杏仁 苡仁 茯苓

白蒺藜 --- 鹿角霜 生白术 桂枝 茯苓 抚芎 归须 白蒺藜 黄菊花

蒺藜 --- 某 初病湿热在经，久则瘀热入络，脓疡日多未已，渐而筋骨疼痛，金匮云，经热则痹，络热则痿，数年宿病，勿事速攻，夜服蒺藜丸。

细生地 --- （午服）犀角 玄参 连翘心 野赤豆皮 细生地 丹参 姜黄 桑枝

当归须 --- 当归须（四两） 干地龙（二两） 穿山甲（二两） 白芥子（一两） 小抚芎（一两） 生白蒺（二两）

姜汁 --- 竹沥姜汁法丸。

白蒺藜 --- 暮服白蒺藜丸。

片姜黄 --- 桂枝 羚羊角 杏仁 花粉 防己 桑枝 海桐皮 片姜黄

三七 --- 沈（三七） 用养肝血熄风方，右指仍麻，行走则屈伸不舒，戌亥必心热烦蒸，想前法不效，杞归辛温，阳动风亦动矣，议去辛用咸，若疑虑途次疟邪未尽，致脉络留滞，兼以通逐缓攻亦妙。（肝阴虚疟邪入血络）

归须 --- 桃仁 穿山甲 干地龙 抚芎 归须 丹皮 红花 沙苑

香附汁 --- 香附汁丸，夜服。

黑豆皮 --- 川乌 全蝎 地龙 山甲 大黑豆皮

黑稆豆皮 --- 黄芪 生白术 制首乌 当归 白蒺藜 黑稆豆皮

熟白术 --- 人参 生黄芪 熟白术 炙草 广皮 当归 白芍 半夏 防风根 羌活

生于术 --- 生于术 川桂枝 川独活 片姜黄 白茯苓 陈防己

生黄芪 --- 生黄芪 防风 桂枝 炒黑常山 归身 青菊叶汁

木防己 --- 归须 桑枝 苡仁 白疾黎 姜黄 木防己

桂枝 --- 桑枝桂枝汤泛丸。

人参 --- 徐评 案多重复，可删，既知风寒湿为痹，则尽属外邪可知，而用人参及温补之药者，十居二三，恐有留邪之患，凡属形体之疾，当外治，不明外治之法，服药虽中病，仅得医术之半耳。</D>