李 先因呕吐腹痛，随即昏迷，此气火痰上蒙清神为厥，先用乌梅擦牙，令牙关得开，然后用药。（痰火上闭）

至宝丹三分。

某 阳气暴张，精绝，令人煎厥。（煎厥）

细生地（一两） 阿胶（三钱） 出山铅（打薄五钱） 调珍珠末（一钱） 细生地 玄参 龟胶 阿胶 淡菜 蚌水

人参 麦冬 川斛 新会皮 白粳米 干佩兰叶

王（四一） 经云，烦劳则张，精绝，辟积于夏，令人煎厥，夫劳动阳气弛张，则阴精不司留恋其阳，虽有若无，故曰绝，积之既久，逢夏季阳正开泄，五志火动风生，若煎熬者然，斯为晕厥耳，治法以清心益肾，使肝胆相火，内风不为暴起，然必薄味静养为稳。

某（二九） 肾厥，由背脊而升，发时手足逆冷，口吐涎沫，喉如刀刺，盖足少阴经脉，上循喉咙，挟舌本，阴浊自下上犯，必循经而至，仿许学士椒附意，通阳以泄浊阴耳。（肾厥）

炮附子 淡干姜 川椒 胡芦巴 半夏 茯苓

姜汁泛丸。

某 肾厥，气逆至头，玉贞丸二十粒。

盛（四九） 脐上心下热炽，咽喉间陈腐气，遂神昏仆厥，经时汗出而醒，病来口涌血沫，乃膻中热拥以致心窍受蒙，若非芳香清透，不能宣通络中瘀痹。（膻中热郁心窍蒙）

生乌犀角（一两） 天竺黄（一两） 丹参（一两） 郁金（一两） 云茯神（一两） 石菖蒲（五钱） 麝香（一钱） 冰片（五分）

各生研，野赤豆皮煎汤泛丸，竹叶汤送下二钱，食后服。

谢（女） 热郁于内，则机窍不灵，春令升泄，木火化风旋扰，瘛疭搐搦，有癫痫之虑，不可进通经，再劫其阴液。

冲入方诸水。

玉烛散。

罗 温邪内陷，津液被劫，厥阳挟内风上逆，遂致痉厥。（温邪劫液风阳上逆）

毛 瘦人而病温热，神呆舌赤，诊脉时，两手牵掣震动，此津液受劫，肝风内鼓，是发痉之原，议以养胃汁，熄肝风，务在存阴耳，用仲景复脉汤法，去参、姜、桂。

余 脉细促，神迷，舌缩言謇，耳聋，四肢牵引，牙关不紧，病已月余，乃温邪劫液，阳浮独行，内风大震，变幻痉厥危疴，议以育阴熄风法，必得痉止神清，方有转机。

毛 少阴不藏，温邪深入，喘促汗出，渴不多饮，舌辛似缩，症非轻小，拟用复脉汤，为邪少虚多之治，去姜。

复脉汤去姜、桂。

唐 积劳伏暑，欲寐时，心中轰然上升，自觉神魂缥缈，此皆阳气上冒，内风鼓动，所以陡然昏厥。（暑邪内陷胞络闭结）

方 热闭神狂，因乎食复，畏人与肢筋牵动，仍属暑病变痉，通三焦以清神明，冀有转机，紫雪丹二钱。

杨 暑由上受，先入肺络，日期渐多，气分热邪逆传入营，遂逼心胞络中，神昏欲躁，舌音缩，手足牵引，乃暑热深陷，谓之发痉，热闭在里，肢体反不发热，热邪内闭则外脱，岂非至急，考古人方法，清络热必兼芳香，开里窍以清神识，若重药攻邪，直走肠胃，与胞络结闭无干涉也。

犀角 玄参 鲜生地 连翘 鲜菖蒲 银花

化至宝丹四丸。

金 暑热结聚于里，三焦交阻，上则神呆不语，牙关不开，下则少腹冲气，小溲不利，邪结皆无形之热闭塞，渐有痉厥之状，昨大便既下，而现此象，岂是垢滞，议芳香宣窍，通解在里蕴热。

紫雪丹一钱五分，开水化匀三服。

鲍 舌白，渴欲冷冻饮料，气促，呛咳而呃，胸闷昏谵，此暑风湿热秽浊痹塞，宿垢尚在小肠，旬日间渐变痉厥，是为险机，议逐秽结，以冀稍清。

大杏仁 连翘心 竹叶心 川贝母 菖蒲根汁 辰砂益元散

煎药化牛黄丸一服。

蔡 暑湿热，都着气分，乃消食苦降滋血乱治，热炽津涸，舌板成痉，究竟邪闭阻窍，势属不稳。

潘（二八） 肝阳化风，上冒为厥，风阳内烁，脂液涸而作痛，此非实症，刚燥忌用。（肝风）

夏（五二） 中年以后，阳气日衰，是下焦偏冷，阳不及护卫周身，气分更虚，右肢如痿，当春地气上升，身中肝风大震，心嘈嗔怒，痰涌音哑，乃厥象也，皆本气自病，最难见效。

熟地 熟淡附子 牛膝炭 炒麦冬 远志炭 茯苓

马 面青A2J6白，入夜颧颊渐赤，耳聋，舌心干板而缩，并不渴饮，间有寒战后热，此厥阴肝脏液涸风旋，势成痉厥危症，勉从经旨之训，肝苦急，当食甘以缓之。

甘麦大枣汤加阿胶。

陆 面青，头痛动摇，手足搐搦牵掣，惊吓恼怒，病从肝起，如饥求食，昼夜无寐，都是肝风盘旋鼓舞，渐为痫厥，此乃五志之病。

某 冲气巅胀厥，龙荟丸一钱二分。

顾 此痿厥也，盖厥阴风旋，阳冒神迷则为厥，阳明络空，四末不用，而为痿厥，午后黄昏，乃厥阴阳明旺时，病机发现矣，凡此皆属络病，金匮篇中有之，仲景云，诸厥宜下，下之利不止者死，明不下降之药，皆可止厥，但不可硝黄再伤阴阳耳，但积年沉疴，非旦夕速效可知矣。

活鳖甲 真阿胶 方诸水 鲜生地 玄参 青黛

鲜鳖甲 败龟版 猪脊髓 羊骨髓 生地 天冬 阿胶 淡菜 黄柏

熬膏，早服七钱，午服四钱。

林 据说六七年前，惊骇起病，气从左胁有声，攻及胸膈，心中胀极，气降胀减，必汗出溲溺，此属肝厥，凡烦劳动怒，即刻举发，肝木风火内寄，其来必骤，且有声音，久恙非汤药可投，缓调须用丸药，更发作自必轻减。

乌梅肉丸。

顾 平昔肠红，阴络久伤，左胁下宿瘕，肝家风气易结，形瘦面青，阴虚，阳气易冒，血络不得凝静，诸阳一并遂为厥，冲气自下犯胃为呃，症似蓄血为狂，奈脉细劲，咽喉皆痛，真阴枯槁之象水液无有，风木大震，此刚剂强镇，不能熄其厥冒耳。

冲入热童便一杯。

戴 酒客中虚多湿，阳明素虚，厥阴来乘，当谷雨土旺用事，风木与阳俱升逆，郁冒而厥，此平昔积劳内因，与外邪无涉，阅医多用风药，是再伤肌表护卫之阳，乃召风以致中耳。

吴（三十） 肝风痫厥，迅发莫制，都因肾真内怯，平素多遗，诊脉芤弱，议用固本丸。

固本加五味、萸肉、龙骨、金箔蜜丸。

谢（五八） 有年下虚，春木自地而升，阳浮上蒙清窍，经云，下虚上实，为厥癫疾，肝风内震，倘加恼怒，必致厥仆痱中，大忌攻痰祛风药。

夏（十九） 少腹气攻有形，呕吐头胀，阴脉不至头，而厥阴脉上至巅顶，四肢逆冷，即厥象也，不是疟母宿冷，肝脉环绕阴器为遗泄。（厥阴寒厥）

炒黑川椒 川楝子 炒橘核 青木香 小茴香 茯苓

王 右脉已伏，左小紧，四肢冰冷，干呕烦渴，厥阴浊泛，胃阳欲绝，此属痛厥，姑以辛热泄浊通阳。

泡淡吴萸 制附子 川楝子 延胡索 淡干姜 茯苓

人参 淡附子 枳实 茯苓 生淡干姜

史 温热已入厥阴，阴伤，致风阳上巅，遂为痉厥，厥发丑寅，阳明少阳之阳震动，昨进咸苦，清其阴分之热已效，今复入镇阳以止厥。（厥阴热邪）

蒋 眩晕，心痛胀，呕吐涎沫，周身麻木，此厥阴肝脏中阳，过胃贯膈，逆冲不已，有痉厥之意。

龙荟丸。

程 厥邪热深，生姜性辛温，大泄肝阴，阳遂上冒，心热晕厥，但阴虚热炽，苦寒不可多进，以滋阴却热为稳。

张 未病先有惊恐，先寒战，后发热，心中极热，干呕烦躁，渴饮冷，仍不解渴，诊脉小弦，舌白无胎，曾肢冷如冰，此热邪已入厥阴肝经，所谓热深厥深也，病全入里，极为棘手，议用紫雪丹，开深伏之热结，取其芳香宣窍，冀得躁扰势缓，方有转机，

紫雪丹二钱。

王 心中疼热，耳聋自利，热邪已入厥阴，三日不厥，方有好音。

郁金 川连 秦皮 黄芩 连翘心 石菖蒲汁

某 先发水痘，已感冬温，小愈不忌荤腥，余邪复炽，热不可遏，入夜昏烦，辄云头痛，邪深走厥阴，所以发厥，诊脉两手俱细，是阳极似阴，鼻煤舌干，目眦黄，多属邪闭坏败，谅难挽回，用凉膈散。

伍（女） 室女经来，冲脉自动，动则阳升，内风绕旋不息，为薄厥煎厥，阳明虚，胃失降，厥阴热，肝愈横，风阳上冒，清空神迷，诸窍似阻，皆入夏大地发泄之征，本虚表实，先理其实，议用局方龙荟丸，纯苦直降，非汤饮留连肠胃之比，每服三钱，不拘二三次分服，接用复脉法，去参姜桂。（肝风烁阴）

施（氏） 诸厥属肝，肝病犯胃，为呕逆腹痛，乃定例也，诊脉虚小，望色A2J6白，据述怀妊，病竟不发，思中流砥柱，斯肝木凝然，则知培植胃土，乃治病法程矣。（肝逆胃虚）

六君子去术、皮，加芍药、木瓜。

煨姜南枣。

某（氏） 厥属肝病，几番病发，都因经水适来，夫血海贮聚既下，斯冲脉空乏，而风阳交动，厥之暴至之因由也，咸寒濡润，亦和阳泄内风之义，治之未应，下焦独冷，喉呛胸痹，思冲脉乃阳明所属，阳明虚则失阖，厥气上犯莫遏，内经治肝不应，当取阳明，制其侮也，暂用通补入腑，取乎腑以通为补。

小半夏汤加白糯米。

龚（三一） 诸厥皆隶厥阴，疝瘕，心热胁胀，中消便难，乃肝阳内风，妄动消烁，犯及阳明矣，经言治肝不应，当取阳明，肝胃一脏一腑相对，不耐温补者，是肝用太过，肝体不及也。

陈 嗔怒微厥，肝阳升举，宜益胃阴以制伏。（怒）

微温服。

叶（氏） 脉右大，热升风动，郁冒为厥，宗陈无择羚羊角散方。（奇脉虚风阳动）

陶（氏） 脉数，厥止，热在营中。（心营热）

王 口鼻触入异气，胃伤呕吐，土衰则木克，肝风内横，三虫扰动为痛，从蛔厥论治。（蛔厥呕吐）

黄（二十） 据述十一年前夏秋间，多用井水盐梅，因此昏厥，以后三五日一发，病愈虽醒，日瘦日减，间有语言不自接续，想其至理，水盐梅酸，大泄肝肾脏阴，厥者，阳气逆乱，冒神愦愦，势成沉痼，非痫厥门治痰治火清窍者，是脏阴受病，脏主乎藏蓄，医偏搜逐劫烁，凡阴涸欲绝，譬诸油尽，灯焰忽明忽昏，扑然息矣，先圣先贤从无成法，未敢凑药欺人。（阴涸欲绝）

常用人乳一杯。

某 脉左动如数，右小濡弱，病起嗔怒，即寒热汗出心悸，继而神魂自觉散越，夫肝脏藏魂，因怒则诸阳皆动，所见病源，无非阳动变化内风而为厥，故凡属厥症，多隶厥阴肝病，考内经治肝，不外辛以理用，酸以治体，甘以缓急，今精彩散失，镇固收摄，犹虑弗及，而方书泄肝平肝抑肝方法尽多，至于补法，多以子母相生为治，此病全以肝肾下焦主法为正，所服医药，并无师古之方，未识何见。

某 冷自足上贯于心，初起周身麻木，今则口鼻皆有冷气，病起惊恐，内伤肝肾为厥，冲脉隶于肝肾，二脏失藏，冲气沸乱，其脉由至阴而上，故多冷耳。（肝肾虚冲气逆）

汪 胃阳伤残，浊气上攻，将为痛厥，当治阳明之阳。（痛厥）

某 热甚而厥，其热邪必在阴分，古称热深厥深，病中遗泄，阴伤邪陷，发表攻里，断难施用，和正托邪，是为正法。（疟厥）

<D>厥者，从下逆上之病也，痉者，明其风强之状也，所以二字每每并言，原与伤寒门所载者有间，想是症总，由气血日偏，阴阳一并而成，譬如风雷之猛烈，郁极而发也，若发而渐复者，犹可转危为安，若发而转逆者，必至直拔根荄乃已，斯存亡之机，在乎命脏之盈亏耳，考方书之名目不一，致病之因由亦繁，大抵可吐者，如痰食填塞于胸中，用瓜蒂散之类，及烧盐探引方法，可清可折者，如厥阳壮火升逆而莫制，用玉女煎，及宣明龙荟丸法，可开可降者如气厥，薄厥，而形气暴绝，有五磨饮子，及蒲酒法，秽浊蒙神，而昏乱无知，有牛黄至宝，及苏合香丸之两法，飞尸卒厥，先宜酒醴以引导，并可按穴而施针法及灸法，若从虚而论者，如内夺而厥，则为喑痱，有地黄饮子之通摄下焦法，烦劳阳张，令人煎厥有人参固本，加入金箔方诸水，为壮水制火法，血厥而阳腾络沸，参乎从阴从阳法，色厥而精脱于下，急与大剂挽元法，肾厥宗许学士之椒附以通阳，蛔厥有仲景之安蛔法，阳极用救阴峻剂，阴极有扶阳方法，种种规模已为全备，及参案中，先生于是症独重在肝，盖肝者，将军之官，善干他脏者也，要知肝气一逆，则诸气皆逆，气逆则痰生，遂火沸风旋神迷魂荡，无所不至矣，若犯于上者，不免凌金烁液，有门冬汤，及琼玉膏之补金柔制法，若犯于中，而为呕为胀者，用六君去术，加木瓜姜芍之类，及附子粳米汤加人参，为补胃凝肝法，若震及心脾，而为悸为消者，用甘麦大枣汤，合龙蛎之属，为缓急重镇法，若挟少阳之威而乘巅摇络者，用羚羊钩藤玄参连翘之剂，为熄风清络法，若本脏自病，而体用失和者，以椒梅桂芍之类，为益体宣用法，若因母脏之虚，而扰及子脏之位者，用三才配合龟甲磁朱，及复脉减辛味，复入鸡黄之属，为安摄其子母法，至于痿厥之治，尤觉神奇，取血肉介类，改汤为膏，谓其力味重实，填隙止厥最速，此岂非补前人之未备，开后学之法门者乎，参是案者，幸毋忽诸。（邵新甫）

徐评 案中所载甚杂，或有痫症，或有痉症，或有怔忡症，或有火郁症，或有惊恐症，或有痰迷症，皆谓之厥，此编书者之过也，至于当用人参，则厥症十不得一者，乃居其三四，恐留邪之害，必有受之者矣。</D>