乌梅 --- 李 先因呕吐腹痛，随即昏迷，此气火痰上蒙清神为厥，先用乌梅擦牙，令牙关得开，然后用药。（痰火上闭）

细生地 --- 细生地（一两） 阿胶（三钱） 出山铅（打薄五钱） 调珍珠末（一钱） 细生地 玄参 龟胶 阿胶 淡菜 蚌水

新会皮 --- 人参 麦冬 川斛 新会皮 白粳米 干佩兰叶

淡干姜 --- 炮附子 淡干姜 川椒 胡芦巴 半夏 茯苓

姜汁 --- 姜汁泛丸。

芳香 --- 盛（四九） 脐上心下热炽，咽喉间陈腐气，遂神昏仆厥，经时汗出而醒，病来口涌血沫，乃膻中热拥以致心窍受蒙，若非芳香清透，不能宣通络中瘀痹。（膻中热郁心窍蒙）

云茯神 --- 生乌犀角（一两） 天竺黄（一两） 丹参（一两） 郁金（一两） 云茯神（一两） 石菖蒲（五钱） 麝香（一钱） 冰片（五分）

赤豆皮 --- 各生研，野赤豆皮煎汤泛丸，竹叶汤送下二钱，食后服。

姜 --- 毛 瘦人而病温热，神呆舌赤，诊脉时，两手牵掣震动，此津液受劫，肝风内鼓，是发痉之原，议以养胃汁，熄肝风，务在存阴耳，用仲景复脉汤法，去参、姜、桂。

姜 --- 毛 少阴不藏，温邪深入，喘促汗出，渴不多饮，舌辛似缩，症非轻小，拟用复脉汤，为邪少虚多之治，去姜。

姜 --- 复脉汤去姜、桂。

芳香 --- 杨 暑由上受，先入肺络，日期渐多，气分热邪逆传入营，遂逼心胞络中，神昏欲躁，舌音缩，手足牵引，乃暑热深陷，谓之发痉，热闭在里，肢体反不发热，热邪内闭则外脱，岂非至急，考古人方法，清络热必兼芳香，开里窍以清神识，若重药攻邪，直走肠胃，与胞络结闭无干涉也。

鲜生地 --- 犀角 玄参 鲜生地 连翘 鲜菖蒲 银花

芳香 --- 金 暑热结聚于里，三焦交阻，上则神呆不语，牙关不开，下则少腹冲气，小溲不利，邪结皆无形之热闭塞，渐有痉厥之状，昨大便既下，而现此象，岂是垢滞，议芳香宣窍，通解在里蕴热。

川贝母 --- 大杏仁 连翘心 竹叶心 川贝母 菖蒲根汁 辰砂益元散

淡附子 --- 熟地 熟淡附子 牛膝炭 炒麦冬 远志炭 茯苓

大枣 --- 甘麦大枣汤加阿胶。

鲜生地 --- 活鳖甲 真阿胶 方诸水 鲜生地 玄参 青黛

猪脊髓 --- 鲜鳖甲 败龟版 猪脊髓 羊骨髓 生地 天冬 阿胶 淡菜 黄柏

川楝子 --- 人参 干姜 附子 桂枝 川椒 小川连 川楝子 当归 白芍

乌梅肉 --- 乌梅肉丸。

童便 --- 冲入热童便一杯。

龙骨 --- 固本加五味、萸肉、龙骨、金箔蜜丸。

青木香 --- 炒黑川椒 川楝子 炒橘核 青木香 小茴香 茯苓

延胡索 --- 泡淡吴萸 制附子 川楝子 延胡索 淡干姜 茯苓

淡附子 --- 人参 淡附子 枳实 茯苓 生淡干姜

鸡子黄 --- 生地 天冬 阿胶 鸡子黄 生龙骨 小麦

生姜 --- 程 厥邪热深，生姜性辛温，大泄肝阴，阳遂上冒，心热晕厥，但阴虚热炽，苦寒不可多进，以滋阴却热为稳。

芳香 --- 张 未病先有惊恐，先寒战，后发热，心中极热，干呕烦躁，渴饮冷，仍不解渴，诊脉小弦，舌白无胎，曾肢冷如冰，此热邪已入厥阴肝经，所谓热深厥深也，病全入里，极为棘手，议用紫雪丹，开深伏之热结，取其芳香宣窍，冀得躁扰势缓，方有转机，

连翘心 --- 郁金 川连 秦皮 黄芩 连翘心 石菖蒲汁

姜 --- 伍（女） 室女经来，冲脉自动，动则阳升，内风绕旋不息，为薄厥煎厥，阳明虚，胃失降，厥阴热，肝愈横，风阳上冒，清空神迷，诸窍似阻，皆入夏大地发泄之征，本虚表实，先理其实，议用局方龙荟丸，纯苦直降，非汤饮留连肠胃之比，每服三钱，不拘二三次分服，接用复脉法，去参姜桂。（肝风烁阴）

芍药 --- 六君子去术、皮，加芍药、木瓜。

煨姜 --- 煨姜南枣。

半夏 --- 小半夏汤加白糯米。

羚羊角 --- 叶（氏） 脉右大，热升风动，郁冒为厥，宗陈无择羚羊角散方。（奇脉虚风阳动）

盐梅 --- 黄（二十） 据述十一年前夏秋间，多用井水盐梅，因此昏厥，以后三五日一发，病愈虽醒，日瘦日减，间有语言不自接续，想其至理，水盐梅酸，大泄肝肾脏阴，厥者，阳气逆乱，冒神愦愦，势成沉痼，非痫厥门治痰治火清窍者，是脏阴受病，脏主乎藏蓄，医偏搜逐劫烁，凡阴涸欲绝，譬诸油尽，灯焰忽明忽昏，扑然息矣，先圣先贤从无成法，未敢凑药欺人。（阴涸欲绝）

人乳 --- 常用人乳一杯。

附子 --- <D>厥者，从下逆上之病也，痉者，明其风强之状也，所以二字每每并言，原与伤寒门所载者有间，想是症总，由气血日偏，阴阳一并而成，譬如风雷之猛烈，郁极而发也，若发而渐复者，犹可转危为安，若发而转逆者，必至直拔根荄乃已，斯存亡之机，在乎命脏之盈亏耳，考方书之名目不一，致病之因由亦繁，大抵可吐者，如痰食填塞于胸中，用瓜蒂散之类，及烧盐探引方法，可清可折者，如厥阳壮火升逆而莫制，用玉女煎，及宣明龙荟丸法，可开可降者如气厥，薄厥，而形气暴绝，有五磨饮子，及蒲酒法，秽浊蒙神，而昏乱无知，有牛黄至宝，及苏合香丸之两法，飞尸卒厥，先宜酒醴以引导，并可按穴而施针法及灸法，若从虚而论者，如内夺而厥，则为喑痱，有地黄饮子之通摄下焦法，烦劳阳张，令人煎厥有人参固本，加入金箔方诸水，为壮水制火法，血厥而阳腾络沸，参乎从阴从阳法，色厥而精脱于下，急与大剂挽元法，肾厥宗许学士之椒附以通阳，蛔厥有仲景之安蛔法，阳极用救阴峻剂，阴极有扶阳方法，种种规模已为全备，及参案中，先生于是症独重在肝，盖肝者，将军之官，善干他脏者也，要知肝气一逆，则诸气皆逆，气逆则痰生，遂火沸风旋神迷魂荡，无所不至矣，若犯于上者，不免凌金烁液，有门冬汤，及琼玉膏之补金柔制法，若犯于中，而为呕为胀者，用六君去术，加木瓜姜芍之类，及附子粳米汤加人参，为补胃凝肝法，若震及心脾，而为悸为消者，用甘麦大枣汤，合龙蛎之属，为缓急重镇法，若挟少阳之威而乘巅摇络者，用羚羊钩藤玄参连翘之剂，为熄风清络法，若本脏自病，而体用失和者，以椒梅桂芍之类，为益体宣用法，若因母脏之虚，而扰及子脏之位者，用三才配合龟甲磁朱，及复脉减辛味，复入鸡黄之属，为安摄其子母法，至于痿厥之治，尤觉神奇，取血肉介类，改汤为膏，谓其力味重实，填隙止厥最速，此岂非补前人之未备，开后学之法门者乎，参是案者，幸毋忽诸。（邵新甫）

人参 --- 徐评 案中所载甚杂，或有痫症，或有痉症，或有怔忡症，或有火郁症，或有惊恐症，或有痰迷症，皆谓之厥，此编书者之过也，至于当用人参，则厥症十不得一者，乃居其三四，恐留邪之害，必有受之者矣。</D>