陈 厥后，吸短多遗，议摄下焦。（阴虚阳动）

熟地（四钱） 桑螵蛸（二钱） 覆盆子（一钱） 五味（一钱） 湖莲（三钱） 芡实（二钱） 茯神（三钱） 山药（二钱）

某（四十） 梦遗精浊，烦劳即发，三载不痊，肾脏精气已亏，相火易动无制，故精不能固，由烦动而泄，当填补下焦，俾精充阳潜，可以图愈。

熟地（八两） 麦冬（二两） 茯神（二两） 五味（二两） 线胶（四两） 川斛膏（四两） 沙苑（二两） 远志（一两） 芡实（三两） 湖莲（三两）

马（二二） 阴虚体质，常有梦泄之疾，养阴佐以涩剂，仍参入通药可效。

六味去丹泽，加湖莲、芡实、五味、远志、秋石，金樱膏丸。

张 阴精走泄，阳失根据附，上冒为热，坎水中阳不藏，古人必以厚味填之，介类潜之，乃从阴以引阳，与今人见热投凉不同。

某（二一） 脉左弦右濡，梦遗，咳逆气急。

熟地 麦冬 萸肉 五味 牡蛎 茯神 女贞子 山药 湖莲 川斛膏 芡实

金樱膏加蜜丸，每服四五钱，淡盐汤下。

杨 脉垂入尺，有梦遗精，议填阴摄固其下。

熟地 萸肉 五味 山药 茯神 覆盆子 远志 线胶 湖莲 芡实

金樱膏丸盐汤下。

刘 先患目疾，流泪，嘈杂不欲食，内郁勃，阳气过动，阴虚不主摄纳，春半连次遗泄，腰脊酸楚，皆肝肾病矣。

熟地 龙骨 萸肉 茯神 丹皮 湖莲 芡实 远志

某 劳损漏疡，大便时溏，阴火上升，下则遗滑。

熟地 龟版 芡实 山药 女贞 建莲 炙草 豆皮

某 少年频频遗精，不寐心嘈，乃属肾中有火，精得热而妄行，日后恐有肾消之累。

焦黄柏 生地 天冬 茯苓 牡蛎 炒山药

某 脉虚色白，陡然大瘦，平昔形神皆劳，冬至初阳动，精摇下泄，加以夜坐不静养，暴寒再折其阳，身不发热，时时惊惕烦躁，从仲景亡阳肉瞤例，用救逆汤法，必得神气凝静，不致昏痓瘈疭之变。

救逆汤去芍。

费 色苍脉数，烦心则遗，阳火下降，阴虚不摄，有湿热下注，此固涩无功。（阴虚湿热）

吴（二二） 病形在肾肝，但得泻头中痛微缓，少腹阴囊亦胀，想阴分固虚，而湿热留着，致腑经之气，无以承流宣化，理固有诸，先泄厥阴郁热，兼通腑气再议。

龟版 秋石 熟地 女贞 远志 芡实 湖莲 茯苓

熬膏。

钱（二十） 脉右弦左垂，阴虚湿热，遗精疮蚀。

蜜丸。

某 梦遗病，乃是阴气走泄，而湿热二气乘虚下陷，坠自腰中至囊，环跳膝盖诸处可见，久遗八脉皆伤，议用通药，兼理阴气。

宋（二三） 无梦频频遗精，乃精窍已滑，古人谓有梦治心，无梦治肾，肾阴久损，阳升无制，喉中贮痰不清，皆五液所化，胃纳少而运迟，固下必佐健中。（下损及中兼治脾胃）

人参 桑螵蛸 生龙骨 锁阳 芡实 熟地 茯神 远志

华（二九） 神伤于上，精败于下，心肾不交，久伤精气不复谓之损，内经治五脏之损，治各不同，越人有上损从阳，下损从阴之议，然必纳谷资生，脾胃后天得振，始望精气生于谷食，自上秋至今日甚，乃里真无藏，当春令泄越，生气不至，渐欲离散，从来精血有形，药饵焉能骤然充长，攻病方法，都主客邪，以偏治偏，阅古东垣丹溪辈，于损不肯复者，首宜大进参术，多至数斤，谓有形精血难生，无形元气须急固耳，况上下交损，当治其中，若得中苏加谷，继参入摄纳填精敛神之属，方今春木大泄，万花尽放，人身应之，此一月中，急挽勿懈矣。

参术膏，米饮调送，接进寇氏桑螵蛸散去当归。

此宁神固精，收摄散亡，乃涩以治脱之法。

归脾汤。

早用人乳一盏，隔汤炖热服，午后略饥，用生脉四君子汤。

（晚服方） 人参 茯苓 白术 炙草 广皮 麦冬 五味 神曲 麦芽 炒黄柏

（早上丸方） 人参 桑螵蛸 白龙骨 淡苁蓉 五味 芡实 茯神 枣仁 金箔

金樱膏丸，淡盐汤送三四钱。

（晨服） 遗症固涩下焦，乃通套治法，想精关已滑，涩剂不能取效，必用滑药引导，同气相求，古法有诸。

牛骨髓 羊骨髓 猪脊髓 麋角胶 白龙骨 生牡蛎 熟地 萸肉 茯神 五味 山药 芡实 湖莲 远志 砂仁

胶髓代蜜丸，晨服四钱，秋石二分化水下。

毛（二六） 长夏暑温热郁，都令脾胃受伤，色黄神倦，气分自馁，因有遗泄一症，在盛年阴虚为多，及询纳食未为强旺，遗发必劳烦而来，脉象非数搏，议以养脾立法。

归脾去黄芪、桂圆，加益智、龙骨。

项 脉左弱右弦，色黄食少，腹胀便溏，常有梦遗泄，此非阴柔涩腻可服，用煦阳以涵阴。

生菟丝子 覆盆子 蛇床子 五味子 韭子 益智仁（煨） 补骨脂 龙骨

建莲粉丸。

丁 阴精走泄，阳不内根据，欲寐即醒，心动震悸，所谓气因精夺，当养精以固气，从前暖药不错，但不分刚柔为偏阳，是以见血，莫见血投凉。（心肾兼治）

龟版（去墙削光一两） 桑螵蛸壳（三钱） 人参（一钱） 当归（一钱） 青花龙骨（三钱飞） 抱木茯神（三钱）

姚（二四） 始于念萌不遂其欲，阳下坠而精泄，先梦者，心阳注肾，久则精血日损，不充养筋骨为痛，下损及中，食不运化，此非萸地腻膈，以及涩精可效。

妙香散。

许（十八） 阴气走泄遗精，务宜滋填塞固，今纳谷少而不甘，胃气既弱，滋腻先妨胃口，议用桑螵蛸散，蜜丸服三四钱。

戈 遗精数年，不但肾关不固，阳明脉络亦已空乏，欲得病愈，宜戒欲宁心一年，寒暑更迁，阴阳渐交，用桑螵蛸散治之。

顾（十九） 滑精，用阴药顿然食减，药先伤胃，据述梦寐惊狂，精走无以护神，当固无形矣。

人参 生龙骨 桑螵蛸 益智仁 茯神 茯苓 远志 木香

吕（三七） 有梦乃遗，是心有所触而致，经营操持，皆扰神动心，说商贾客于外，非关酒色矣。

妙香散。

俞（三七） 壮年形质伟然，脉来芤虚，述心悸怔，多畏惧，夜寐不甚宁静，此阳不易交于阴，过用劳心使然，用妙香散。

张（二四） 形壮脉小，自述心力劳瘁，食减遗精，仿景岳精因气而夺，当养气以充精，理其无形，以固有形。

妙香散。

支（二二） 痰多鼻塞，能食，有梦遗精，医投疏泄肺气消痰，六十剂不效，问读书夜坐，阳气必升，充塞上窍，上盛下衰，寐则阳直降而精下注为遗，用补心丹。

黄（三一） 真阴损伤，而五志中阳，上燔喉痛，下坠为遗，精髓日耗，骨痿无力，必延枯槁而后已，药饵何足久恃。

早服补心丹，晚服桑螵蛸散。

胡 遗精四年，精关久滑不固，阴久伤，阳气不入阳跷穴，夜寤不寐，前以镇摄小效，独心中怔悸不已，以桑螵蛸散，从心肾治。

毕（二六） 有梦遗精，是心肾病，清心固肾，是为成法，得以水火交合，病当渐减，内伤病，从内起，岂得与外来六气混治。

程 左脉刚坚，火升，神气欲昏，片刻平复，宛若无病，此皆劳心五志之阳动，龙相无制，常有遗泄之状，先用滋肾丸三钱，淡盐汤送。

林（十八） 诊脉细涩，寐则遗精，心热口渴，不时寒热，此肾阴内损，心阳暗炽。

补心丹三钱四服。

某 冬令烦倦嗽加，是属不藏，阳少潜伏，两足心常冷，平时先梦而遗，由神驰致精散，必镇心以安神，犹喜胃强纳谷，若能保养，可望渐愈。

桑螵蛸 金樱子 覆盆子 芡实 远志 茯神 茯苓 龙骨 湖莲

煎膏，炼蜜收，饥时服七八钱。

杨（十八） 冲年遗精，知识太早，难成易亏，真阴不得充长，及壮盛未有生育，而久遗滑漏，褚氏谓难状之疾者，盖病伤可复，精损难复也，诊脉上动尺芤，心动神驰，神驰精散，草木性偏，焉得见长，务宜断欲百日，以妙香散桑螵蛸散方，理心脾以交肾，固肾气以宁心，早晚并进，百日以验之。

吕（二四） 成婚太早，精血未满久泄，必关键不摄，初则精腐变浊，久则元精滑溢，精浊之病，巢氏分晰彰着，经言肾虚气漫为胀，咸为肾味，上溢口舌，皆下失摄纳之权。（肾气不摄）

生菟丝子粉 蛇床子 覆盆子 陕沙苑子 家韭子 五味子

鳇鱼胶丸。

许（十九） 脉虚芤，应乎失血遗精，先天既薄，更易泄少藏，正褚氏所云难状之疾，冲年须潜心静处，冀水火自交，可以精固，莫但图药饵，须坚守瞬刻强制之功。

鲜河车膏 九蒸熟地 五味 萸肉 山药 湖莲 砂仁 芡实

李（二五） 脉小色白，失血遗精屡发，犹喜纳谷胃安，封藏固补，使其藏聚，若再苦寒泻火，胃伤废食，坐以待困矣。

熟地 萸肉 五味 覆盆子 河车膏 生菟丝粉 山药 湖莲 茯苓 芡实

某 脉左部数，有锋芒，初夏见红，久遗滑，入夜痰升肋痛，肝阳上冒，肾弱不摄，固摄助纳，必佐凉肝。

熟地 湖莲 芡实 生白龙骨 茯神 川石斛

章 脉数虚，气冲心热，呛咳失血，屡因嗔怒，肝阳升则血涌，坠则精遗，春末土旺，入夏正当发泄主令，暮热晨汗，阴阳枢纽失固，议进摄真，其清寒肺药须忌。（兼失血）

鱼鳔胶 生龙骨 桑螵蛸 芡实 茯苓 五味 秋石（调入）

陆（二一） 肌肉松柔，脉小如数，常有梦遗，阴精不固，上年冬令过温，温则腠理反疏，阳动不藏，诸气皆升，络血随气上溢，见症如头面热，目下肉瞤，心悸怔忡，四末汗出，两足跗肿，常冷不温，走动数武，即吸短欲喘，何一非少阴肾气失纳，阳浮不肯潜伏之征，况多梦纷扰，由精伤及神气，法当味厚填精，质重镇神，佐酸以收之，甘以缓之，勿因血以投凉，莫见下寒，辄进燥热，恪守禁忌以安之，经年冀有成功，所虑冲年志虑未纯，贻忧反复。

水制熟地 人参（秋石拌） 白龙骨 炒杞子 五味 炒山药 茯神 牛膝炭

<D>遗精一症，前贤各有明辨，其义各载本门，兹不复赘，大抵此症，变幻虽多，不越乎有梦，无梦，湿热，三者之范围而已，古人以有梦为心病，无梦为肾病，湿热为小肠膀胱病，夫精之藏制虽在肾，而精之主宰则在心，其精血下注，湿热混淆而遗滑者，责在小肠膀胱，故先生于遗精一症，亦不外乎宁心益肾，填精固摄，清热利湿诸法，如肾精亏乏，相火易动，阴虚阳冒而为遗精者，用厚味填精，介类潜阳，养阴固涩诸法，如无梦遗精，肾关不固，精窍滑脱而成者，用桑螵蛸散填阴固摄，及滑涩互施方法，如有梦而遗，烦劳过度，及脾胃受伤，心肾不交，上下交损而成者，用归脾汤，妙香散，参术膏，补心丹等方，心脾肾兼治之法，如阴虚不摄，湿热下注而遗滑者，用黄柏萆薢，黄连苓泽等，苦泄厥阴郁热，兼通腑气为主，如下虚上实，火风震动，脾肾液枯，而为遗滑者，用二至百补丸，及通摄下焦之法，如龙相交炽，阴精走泄而成者，用三才封髓丹，滋肾丸，大补阴丸，峻补真阴，承制相火，以泻阴中伏热为主，又有房劳过度，精竭阳虚，寐则阳陷而精道不禁，随触随泄，不梦而遗者，当用固精丸，升固八脉之气，又有膏粱酒肉，饮醇厚味之人，久之脾胃酿成湿热，留伏阴中，而为梦泄者，当用刘松石猪肚丸，清脾胃蕴蓄之湿热，立法虽为大备，然临症之生心化裁，存乎其人耳。（邹滋九）

徐评 遗精之法，固不外乎填精镇心，本无神妙方法，俗医往往用温热及粘腻等物，必至伤人，此老全不犯此，但此症总有伏邪为患，如火如痰，如湿如风，不能搜剔余邪，兼以调和脏气，委曲施治，方无变病，一味安神填肾，犹多未尽之理也。 </D>