瓜蒌皮 --- 半夏 姜汁 杏仁 瓜蒌皮 金铃子 延胡 香豆豉 白蔻

生香附 --- 开口吴萸 金铃子 炒延胡 生香附 高良姜 南山楂

生左牡蛎 --- 生左牡蛎（五钱） 川楝子肉（一钱） 化州橘红（一钱半） 茯苓（三钱） 泽泻（一钱）

甘草 --- 戊己汤去甘草加谷芽。

人参 --- 人参 半夏 茯苓 木瓜 生益智 煨姜

荷叶 --- 干荷叶汤泛丸。

大杏仁 --- 半夏（一钱半） 广皮白（一钱） 大杏仁（十粒） 白蔻仁（八分） 川楝子（一钱） 炒延胡（一钱） 生姜（五分） 土瓜蒌皮（一钱）

炒半夏 --- 竹茹（一钱炒黄） 炒半夏（一钱） 茯苓（一钱半） 枳实（一钱） 桔梗（八分） 橘红（一钱） 生姜（三分）

金铃子 --- 王（十三） 癖积，是重着有质，今痛升有形，痛解无迹，发于暮夜，冲逆，欲呕不吐，明是厥气攻胃，由恼怒强食，气滞紊乱而成病，发时用河间金铃子散，兼以宣通阳明凝遏可愈。

川贝母 --- 降香 郁金 山栀 橘红 枇杷叶 苏子 川贝母 姜皮

炒麦冬 --- 人参 茯苓 炒麦冬 大麦仁 木瓜 乌梅

新会皮 --- 人参 茯苓 煨姜 新会皮 炒粳米 炒荷叶蒂

知母 --- 人参 茯苓 枣仁 知母 竹茹 半夏 黄色秫米

甘草 --- 六君去甘草，加丹皮、桑叶、金斛汤法丸。

生白芍 --- 川连 川楝子 川椒 生白芍 乌梅 淡姜渣 归须 橘红

当归 --- 内经以攻病克制曰胜方，补虚益体，须气味相生曰生方，今胃被肝乘，法当补胃，但胃属腑阳，凡六腑以通为补，黄连味苦能降，戴元礼云，诸寒药皆凝涩，惟有黄连不凝涩，有姜椒归须气味之辛，得黄连川楝之苦，仿内经苦与辛合，能降能通，芍药酸寒，能泄土中木乘，又能和阴止痛，当归血中气药，辛温上升，用须力薄，其气不升，梅占先春，花发最早，得少阳生气，非酸敛之收药，得连楝苦寒，内经所谓酸苦泄热也，以气与热俱无形无质，其通逐之法迥异，故辨及之。

姜 --- 姜枣汤法丸。

白芍 --- （间用煎方） 人参 广皮 谷芽 炙草 白芍 黄芩 丹皮 柴胡

细生地 --- 生牡蛎 阿胶 细生地 丹参 淮小麦 南枣

炒麦冬 --- 生牡蛎 阿胶 细生地 小麦 炒麻仁 炒麦冬 炙草

淡豆豉 --- 黄连 郁金 香淡豆豉 竹茹 半夏 丹皮 山栀 生姜

炒白芍 --- 人参 淡吴萸 淡干姜 炒白芍 茯苓

川楝子 --- 川楝子皮 半夏 川连 姜汁 左牡蛎 淡吴萸

川楝子 --- 川连 神曲 吴萸 川楝子 楂肉 郁金

姜汁 --- 姚 寒热呕吐，胁胀脘痹，大便干涩不畅，古云九窍不和，都属胃病，法当平肝木，安胃土，更常进人乳姜汁，以益血润燥宣通，午后议用大半夏汤。

小生地 --- 炙甘草 小生地 芝麻仁 阿胶 麦冬 白芍 牡蛎

附子 --- 胃虚益气而用人参，非半夏之辛，茯苓之淡，非通剂矣，少少用附子以理胃阳，粳米以理胃阴，得通补两和阴阳之义，木瓜以酸，救胃汁以制肝，兼和半夏附子之刚愎，此大半夏与附子粳米汤合方。

金铃子 --- 金铃子散加川连、乌梅、桂枝、生姜。

人参 --- 王（氏） 寡居多郁，宿病在肝，迩日暑邪深入，肝病必来犯胃，吐蛔下利得止，不思谷食，心中疼热，仍是肝胃本症，况暑湿多伤气分，人参辅胃开痞，扶胃有益，幸无忽致疲可也。

熟附子 --- 人参 茯苓 淡熟附子 生蕲艾 桂枝木 炒黑大茴 紫石英 生杜仲

生白芍 --- 人参（一钱） 茯苓（三钱） 炒半夏（一钱半） 生白芍（一钱） 乌梅（七分肉） 小川连（二分） 淡生姜（二分） 广皮白（一钱）

白芍 --- 此厥阴阳明药也，胃腑以通为补，故主之以大半夏汤，热拥于上，故少佐姜连以泻心，肝为刚脏，参入白芍乌梅，以柔之也。

茺蔚子 --- 人参（一钱） 当归（二钱） 茺蔚子（二钱） 香附（醋炒一钱） 茯苓（三钱） 小茴（一钱） 生杜仲（二钱）

生白芍 --- 小川连 姜汁 半夏 牡蛎 川楝子 生白芍

生白芍 --- 小川连 生淡干姜 半夏 枳实 黄芩 生白芍

人参 --- 人参 吴萸 茯苓 半夏 生姜 炒黄粳米

柏子仁 --- 大半夏汤去蜜，加桃仁、柏子仁、当归、姜枣汤法丸。

人参 --- 人参 广皮 茯苓 益智 木瓜 淡姜渣

郁金 --- 逍遥散加郁金、砂仁末。

炒当归 --- 炒黑杞子 淡苁蓉 小茴香拌炒当归 沙苑 石壳建莲 茯神

紫石英 --- 紫石英煎汤，煎药。

焦白芍 --- 人参（一钱） 炒焦白芍（一钱半） 真枷南香（汁冲五小匙） 炒焦乌梅（三分酸泄肝阳） 茯苓（五钱切小块甘淡益胃） 化橘红（五分宣通缓痛）

桑叶 --- 四君子加芩芍桑叶丹皮。

新会皮 --- 于术 茯苓 新会皮 炙草 煨益智 柴胡 丹皮 白芍

金铃子 --- <D>肝为风木之脏，又为将军之官，其性急而动，故肝脏之病，较之他脏为多，而于妇女尤甚，肝病必犯土，是侮其所胜也，本脏现症，仲景云，厥阴之为病，消渴，气上撞心，心中疼热，饥而不欲食，食则吐蛔，下之利不止，又内经所载肝病，难以尽述，大凡其脉必弦，胁或胀或疼，偏寒偏热，先厥后热，若一犯胃，则恶心干呕，脘痞不食，吐酸水涎沫，克脾则腹胀，便或溏，或不爽，肢冷肌麻，案中治法，有阴阳虚实之殊，略举而叙述之，若肝阴胃阴未亏，肝阳亢逆犯胃，先生立法，用药则远柔用刚，泄肝如吴萸椒桂，通胃如半夏姜汁姜附，加益智枳朴等，则兼运脾阳，中虚必用人参，故大半夏汤，附子粳米汤，进退黄连汤，泻心法，治中法，温胆等汤是也，若肝阴胃汁已虚，木火炽盛，风阳扰胃，用药忌刚用柔，养肝则阿胶生地白芍麻仁木瓜，养胃则人参麦冬知母粳米秫米等是也，至于平治之法，则刚柔寒热兼用，乌梅丸，安胃丸，逍遥散，若四君六君异功戊己，则必加泄肝之品，用桑叶丹皮者，先生云，桑叶轻清，清泄少阳之气热，丹皮苦辛，清泄肝胆之血热，用金铃子散者，川楝苦寒，直泄肝阳，延胡专理气滞血涩之痛，此皆案中之纲领也，余另分此一门者，因呕吐不食，胁胀脘痞等恙，恐医者但认为脾胃之病，不知实由肝邪所致，故特为揭出，以醒后人之目耳，且世人但知风劳臌膈为四大重症，不知土败木贼，肝气日横，脾胃日败，延至不救者多矣，可不究心于此哉。（华岫云）

人参 --- 徐评 诸案大抵皆胸痹痞满，及痰饮内蓄之症，治痞痹之方，最忌人参，而此欲其壮土以制木，用者甚多，必有遗病，至于蓄痰症，全不齿及，尤属辨症不清，其中精思巧意，中病处颇多，亦得失参半也。</D>