人参 --- 厚朴 杏仁 人参 茯苓 蜜煨姜 南枣

杏仁 --- 厚朴杏仁，取其能降气，参、苓、姜、枣，取其创建胃中之清阳，而和营卫也。

淡附子 --- 生白术（一钱半） 广皮（一钱） 茯苓（三钱） 厚朴（一钱） 木瓜（五分） 淡附子（七分）

熟附子 --- 生白术 熟附子 茯苓 厚朴 生干姜

草果仁 --- 草果仁（一钱） 茯苓皮（三钱） 大腹皮（三钱） 广皮（一钱半） 青皮（一钱） 厚朴（一钱半） 木猪苓（一钱半） 椒目（五分）

熟附子 --- 生白术 茯苓 熟附子 草果仁 厚朴 广皮

附子 --- 生白术 草蔻 茯苓 厚朴 附子 泽泻

熟附子 --- 生白术 草果 熟附子 厚朴 广皮 茯苓

归身 --- 人参 生白术 茯苓 肉桂 归身 益智 广皮 煨姜

白术 --- 生白术（二两） 茯苓（二两） 厚朴（一两） 肉桂（五钱）

姜汁 --- 姜汁丸。

白术 --- 本草云，厚朴与白术能治虚胀，仿洁古枳术之意也，佐茯苓通胃阳，肉桂入血络，则病邪可却矣。

生谷芽 --- 生益智 茯苓 生谷芽 广皮 砂仁壳 厚朴

鸡肫皮 --- 鸡肫皮 麦芽 山楂 砂仁 陈香橼

广皮白 --- 生白术 附子 厚朴 草果 茯苓 广皮白 槟榔汁

淡附子 --- 人参（一钱半） 淡附子（一钱） 淡干姜（八分） 茯苓（三钱） 炒菟丝（三钱） 胡芦巴（一钱）

白术 --- 此治阳明之阳也，若参入白术、甘草，则兼走太阴矣。

三七 --- 某（三七） 肿胀由足入腹，诊脉细软，不能运谷，当治少阴太阴。（脾肾阳虚）

淡附子 --- 生白术 厚朴 茯苓 淡附子 淡干姜 荜茇

菟丝子 --- 人参 白术 附子 生益智 菟丝子 茯苓

黄连 --- 朱 阳明胃逆，厥阴来犯，丹溪谓上升之气，自肝而出，清金开气，亦有制木之功能，而痛胀稍缓，议以温胆加黄连方。（肝胃不和）

生白芍 --- 半夏 茯苓 橘红 枳实 竹茹 川连 生白芍

三角胡麻 --- 云茯苓（三钱） 三角胡麻（捣碎滚水洗十次三钱） 厚橘红（一钱） 嫩钩藤（一钱） 熟半夏（炒黄一钱半） 白旋覆花（一钱）

莱菔子 --- 杏仁 厚朴 海金沙 陈香橼 郁金 莱菔子 木通 鸡肫皮

三七 --- 王（三七） 食入不运，脘中A1J8胀，病由悒郁，经年不愈，视色黄形瘦，按脉小而涩，喜凉饮，恶热，大便未经通调，九窍不和，皆胃病矣。

姜汁 --- 姜汁竹沥丸。

生茅术 --- 生茅术 鸡肫皮 川连 生厚朴 淡姜渣 针砂（制）

椒目 --- 椒目汤法丸。

郁金 --- 杏仁 紫厚朴 猪苓 郁金 椒目 槟榔汁

黑山栀 --- 钩藤 丹皮 黑山栀 川连 青皮子 紫厚朴 莱菔子 广皮白 薄荷梗

黑稆豆皮 --- 猪苓 泽泻 通草 海金沙 金银花 茯苓皮 黑稆豆皮

川乌头 --- 生炮川乌头 生淡川附子 淡干姜 淡吴萸 川楝子 小茴香 猪胆汁

黑山栀 --- 唐（氏） 紫菀 杏仁 通草 郁金 黑山栀

生白芍 --- 生白芍 枳实 柴胡 黄芩 半夏 杏仁 竹茹 生姜

生香附 --- 钩藤 丹皮 桑叶 生香附 茯苓 神曲 降香木 炒黑楂肉

归尾 --- 桃仁 延胡 归尾 小茴 香附 半夏 茯苓 橘红 神曲

川楝子 --- 桃仁 郁李仁 归尾 小茴 红花 制大黄 桂枝 川楝子

生香附 --- 生香附磨汁法丸。

人参 --- 人参 生益智 煨姜 茯苓 木瓜 炒广皮

人参 --- 人参 厚朴 广皮 炒泽泻 茯苓 木瓜 炙草 炒楂肉

白术 --- 宋 食入脘胀，此属胃病，视色苍形瘦，自述饮酒呕吐而得，又述耳鸣肉瞤，是木火犯中，郁勃病甚，议用逍遥减白术，合左金方。（木火犯土）

生于术 --- 吴萸拌川连 生于术 川楝子 炒山楂 黑山栀 厚朴 青皮 椒目

生白芍 --- 川连 淡黄芩 半夏 枳实 干姜 生白芍 铁锈针

生于术 --- 生于术 茯苓 椒目 紫厚朴 泽泻 淡姜渣

木通 --- 朱（四九） 郁勃久坐，中焦不运，寒热，小溲不通，腹膨胀满，脉小而涩，全是腑阳失司，与泄木通腑分消法。

椒目 --- 四苓加椒目、厚朴、大腹皮、青皮。

薤白 --- 薤白 桂枝 瓜蒌仁 生姜 半夏 茯苓

椒目 --- 五苓散加椒目。

椒目 --- 五苓散加椒目。

泽泻 --- 猪苓 茯苓 泽泻 寒水石 椒目 炒橘核

泽泻 --- 猪苓 泽泻 海金沙 通草 椒目

菟丝子 --- 吴 平昔湿痰阻气为喘，兹因过食停滞，阴脏之阳不运，阳腑之气不通，二便不爽，跗肿腹满，诊脉沉弦，犹是水寒痰滞，阻遏气分，上下皆不通调，当从三焦分治，顷见案头一方，用菟丝子升少阴，吴茱萸泄厥阴，不知作何解释，不敢附和，仍用河间分消定议。（湿壅三焦肺气不降）

大杏仁 --- 大杏仁 莱菔子 猪苓 泽泻 葶苈子 厚朴 桑白皮 广皮 细木通

枇杷叶 --- 此手太阴肺经药也，肺气窒塞，当降不降，杏仁微苦则能降，滑石甘凉，渗湿解热，苡仁通草，淡而渗气分，枇杷叶辛凉，能开肺气，茯苓用皮，谓诸皮皆凉，栀豉宣其陈腐郁结，凡此气味俱薄，为上焦药，仿徐之才轻可去实之义。

炙麻黄 --- 前胡 蜜炙麻黄 牛蒡子 姜皮 紫菀 杏仁 茯苓皮 广皮

汉防己 --- 生于术 炮川乌 北细辛 茯苓 汉防己 川独活

北细辛 --- 炮川乌 干地龙 乳香 没药 北细辛 桂枝木

北细辛 --- 川通草（一钱半） 海金沙（五钱） 黄柏皮（一钱半） 木猪苓（三钱） 生赤豆皮（一钱半） 真北细辛（一分）

白通草 --- 川白通草 猪苓 海金沙 生赤豆皮 葶苈子 茯苓皮 晚蚕砂

大杏仁 --- 大杏仁 蜜炒麻黄 石膏

飞滑石 --- 木防己（一钱） 石膏（三钱） 杏仁（三钱） 苡仁（二钱） 飞滑石（一钱半） 寒水石（一钱半）

通草 --- 通草煎汤代水。

白通草 --- 茯苓皮 海金沙 白通草 大腹皮绒 厚朴 广皮 猪苓 泽泻

生香附 --- 老苏梗 生香附 厚朴 白蔻仁 土瓜蒌 桔梗 枳壳 黑山栀

淡附子 --- 人参 块茯苓 生干姜 淡附子 泽泻

猪胆汁 --- 生干姜 生炮附子 冲猪胆汁

生白芍 --- 川桂枝（一钱） 熟大黄（一钱） 生白芍（一钱半） 厚朴（一钱） 枳实（一钱） 淡生干姜（一钱）

生于术 --- 紫厚朴（炒一钱半） 缩砂仁（炒研一钱） 生于术（二钱） 猪苓（一钱） 茯苓（块三钱） 泽泻（一钱）

桂枝木 --- 左牡蛎（四钱泄湿） 泽泻（一钱半） 花粉（一钱半） 川桂枝木（五分通阳） 茯苓（三钱化气） 紫厚朴（一钱）

生于术 --- 生于术（三钱） 左牡蛎（生四钱） 泽泻（炒一钱） 云苓（三钱） 生益智（四分） 桂枝木（四分） 炒厚朴（一钱）

大黄 --- 杨（十六） 味过辛酸，脾胃气伤结聚，食入则胀满，曾服礞石大黄丸，滞浊既下不愈，病不在乎肠中，前贤治胀治满，必曰分消，攻有形不效，自属气聚为瘕，疏胃宜清，调脾当暖，此宗前贤立法。（脾胃气窒不和）

生茅术 --- 生茅术 广皮 丁香皮 黄柏 草豆蔻 川黄连 厚朴 茯苓 泽泻

归尾 --- <D>肿胀证，大约肿本乎水，胀由乎气，肿分阳水阴水，其有因风因湿因气因热，外来者为有余，即为阳水，因于大病后，因脾肺虚弱，不能通调水道，因心火克金，肺不能生肾水，以致小便不利，因肾经阴亏，虚火烁肺金而溺少，误用行气分利之剂，渐至喘急痰盛，小水短赤，酿成肿证，内发者为不足，即为阴水，若胀病之因更多，所胀之位各异，或因湿因郁因寒因热因气因血因痰因积因虫，皆可为胀，或在脏在腑，在脉络在皮肤，在身之上下，表里皆能作胀，更或始因于寒，久郁为热，或始为热中，末传寒中，且也胀不必兼肿，而肿则必兼胀，亦有肿胀同时并至者，其病形变幻不一，其病机之参伍错综，更难叙述，故案中诸症，有湿在下者，用分利，有湿在上中下者，用分消，有湿而着里者，用五苓散通达膀胱，有湿郁热兼者，用半夏泻心法，苦辛通降，有湿热气郁积者，用鸡金散加减，消利并行，有气血郁积，夹湿热之邪，久留而不散者，用小温中丸，清理相火，健运中州，有湿热与水寒之气交横，气喘溺少，通身肿胀者，用禹余粮丸，崇土制水，暖下泄浊，有寒湿在乎气分，则用姜附，有寒湿入于血分，则用桂附，有湿上甚为热，则用麻杏膏苡等味，清肃上焦之气，有湿下着为痹，则用加味活络等剂，宣通下焦之郁，有藉乎薤白瓜蒌者，滑润气机之痹结于腹胁也，有藉乎制黄归尾者，搜逐血沫之凝涩于经隧也，有藉乎玉壶控涎神保神芎者，视其或轻或重之痰，饮水积而驱之也，此皆未损夫脏气，而第在腑之上下，膜之表里者也，若有胃阳虚者，参苓必进，脾阳衰者，术附必投，更有伤及乎肾者，则又需加减八味济生等丸矣，其他如养阳明之大半夏汤，疏厥阴之逍遥散，盖由证之牵连而及，是又案中法外之法也已。（姚亦陶）