防风 --- 防风、荆芥、葛根、前胡、桔梗、木通、赤芍、卜子、厚朴、陈皮、山楂、麦芽、枳壳、神曲、钩藤。

羌活 --- 夏佐香薷，冬佐麻黄、羌活。

瓜蒌实 --- 两三日热不解：柴胡、前胡、黄连、黄芩、山栀、连翘、薄荷、葛根、木通、钩藤、厚朴、枳实、瓜蒌实。丸剂必用大黄。

贝母 --- 四五日不解，但言食滞未尽，表里不和，总以柴芩小陷胸，若呕逆烦渴，用竹茹、黄连、半夏，若痰多喘促，即用葶苈、杏仁、苏子、卜子、胆星、贝母，甚者加牛黄，此皆套法，所当戒也。

北沙参 --- 屡清消不愈，便无方法，苟不变惊，必曰骨蒸孩劳，所用药饵，不分气血阴阳，但知见症施治，如早凉暮热，必用地骨皮、丹皮、生地、玄参、甘草、北沙参、石斛、知母；有痰，加苏子、杏仁、贝母、橘红、胆星、桔梗；其钩藤石斛茯苓谷芽之属，每剂必用，总之取无故疲药，待其自愈，倘有变症，希冀掩饰而已。

黄芩 --- 春温一症，由冬令收藏未固，昔人以冬寒内伏，藏于少阴，入春发于少阳，以春木内应肝胆也，寒邪深伏，已经化热，昔贤以黄芩汤为主方，苦寒直清里热，热伏于阴，苦味坚阴，乃正治也，知温邪忌散，不与暴感门同法，若因外邪先受，引动在里伏热，必先辛凉以解新邪，继进苦寒以清里热，况热乃无形之气，幼医多用消滞，攻治有形，胃汁先涸，阴液劫尽者多矣。

黄芩 --- 备用方：黄芩汤、葱豉汤（新邪引动伏邪）、凉膈散、清心凉膈散。

大黄 --- 风温者，春月受风，其气已温，经谓春气病在头，治在上焦，肺位最高，邪必先伤，此手太阴气分先病，失治则入手厥阴心胞络，血分亦伤，盖足经顺传，如太阳传阳明，人皆知之，肺病失治，逆传心胞络，幼科多不知者，俗医见身热咳喘，不知肺病在上之旨，妄投荆防柴葛，加入枳朴杏苏卜子查麦广皮之属，辄云解肌消食，有见痰喘，便用大黄礞石滚痰丸，大便数行，上热愈结，幼稚谷少，胃薄，表里苦辛化燥，胃汁已伤，复用大黄大苦沉降丸药，致脾胃阳和伤极，陡变惊痫，莫救者多矣。

象贝 --- 按此症，初因发热喘嗽，首用辛凉，清肃上焦，如薄荷连翘牛蒡象贝桑叶沙参栀皮蒌皮花粉，若色苍热胜烦渴，用石膏竹叶辛寒清散，痧症亦当宗此，若日数渐多，邪不得解，芩连凉膈亦可选用，至热邪逆传入膻中，神昏目暝，鼻窍无涕泪，诸窍欲闭，其势危急，必用至宝丹，或牛黄清心丸，病减后余热，只甘寒清养胃阴足矣。

苇茎 --- 备用方：苇茎汤、清心凉膈散、凉膈散、泻白散、葶苈大枣汤、白虎汤、至宝丹、清心牛黄丸、竹叶石膏汤、喻氏清燥救肺汤。

六一散 --- 夏为热病，然夏至已前，时令未为大热，经以先夏至病温，后夏至病暑，温邪前已申明，暑热一症，幼医易眩，夏暑发自阳明，古人以白虎汤为主方，后贤刘河间创议，迥出诸家，谓温热时邪，当分三焦投药，以苦辛寒为主，若拘六经分症，仍是伤寒治法，致误多矣，盖伤寒外受之寒，必先从汗解，辛温散邪是已，口鼻吸入之寒，即为中寒阴病，治当温里，分三阴见症施治，若夫暑病，专方甚少，皆因前人略于暑详于寒耳，考古如金匮暑暍痉之因，而洁古以动静分中暑中热，各具至理，兹不概述，论幼科病暑热夹杂别病有诸，而时下不外发散消导，加入香薷一味，或六一散一服，考本草香薷辛温发汗，能泄宿水，夏热气闭无汗，渴饮停水，香薷必佐杏仁，以杏仁苦降泄气，大顺散取义若此，长夏湿令，暑必兼湿，暑伤气分，湿亦伤气，汗则耗气伤阳，胃汁大受劫烁，变病由此甚多，发泄司令，里真自虚，张凤逵云，暑病首用辛凉，继用甘寒，再用酸泄酸敛，不必用下，可称要言不烦矣，然幼科因暑热蔓延，变生他病，兹摘其概。

鲜生地 --- 夏令受热，昏迷若惊，此为暑厥，即热气闭塞孔窍所致，其邪入络，与中络同法，牛黄丸至宝丹芳香利窍可效，神苏以后，用清凉血分，如连翘心竹叶心玄参细生地鲜生地二冬之属，此症初起，大忌风药，初病暑热伤气，竹叶石膏汤，或清肺轻剂，大凡热深厥深，四肢逆冷，但看面垢齿燥，二便不通，或泻不爽为是，大忌误认伤寒也。

西瓜翠衣 --- 夏季秋热，小儿泄泻，或初愈未愈，满口皆生疳蚀，尝有阻塞咽喉致危者，此皆在里湿盛生热，热气蒸灼，津液不升，湿热偏伤气分，治在上焦，或佐淡渗，世俗常刮西瓜翠衣治疳，取其轻扬渗利也。

甘遂 --- 夏季湿热郁蒸，脾胃气弱，水谷之气不运，温者内蕴为热，渐至浮肿腹胀，小水不利，治之非法，水湿久渍，逆行犯肺，必生咳嗽喘促，甚则坐不得卧，俯不能仰，危期速矣，大凡喘必生胀，胀必生喘，方书以先喘后胀者治在肺，先胀后喘者治在脾，亦定论也，金匮有、风水、皮水、石水、正水、黄汗，以分表里之治，河间有三焦分消，子和有磨积逐水，皆有奥义，学人不可不潜心体认，难以概述，阅近代世俗论水湿喘胀之症，以内经开鬼门取汗为表治，分利小便洁净府为里治，经旨病能篇，谓诸湿肿满，皆属于脾，以健脾燥湿为稳治，治之不效，技穷束手矣，不知凡病皆本乎阴阳，通表利小便，乃宣经气利腑气，是阳病治法，暖水脏，温脾肾，补方以驱水，是阴病治法，治肺痹以轻开上，治脾必佐温通，若阴阳表里乖违，脏真日漓，阴阳不运，亦必作胀，治以通阳，乃可奏绩，如局方禹余粮丸，甚至三焦交阻，必用分消，肠胃窒塞，必用下夺，然不得与伤寒实热同例，擅投硝黄枳朴，扰动阴血，若太阴脾脏饮湿阻气，温之补之不应，欲用下法，少少甘遂为丸可也，其治实症选用方法备采。

木防己 --- 备用方：葶苈大枣汤、泻白散、大顺散、牡蛎泽泻散、五苓散、越婢汤、甘遂半夏汤、控涎丹、五子五皮汤、子和桂苓汤、禹功丸、茯苓防己汤、中满分消汤、小青龙汤、木防己汤。

归须 --- 附记一徐姓小儿，单胀数月，幼科百治无功，佥用肥儿丸、万安散、磨积丹、绿矾丸、鸡肫药、俱不效，余谓气分不效，宜治血络，所谓络瘀则胀也，用归须桃仁、延胡、山甲、蜣螂、A2J5虫、灵脂、山楂之类为丸，十日全愈。

黄连 --- 吐泻一症，幼儿脾胃受伤，陡变惊搐最多，若是不正秽气触入，或口食寒冷，应用正气散，六和汤，五积散之类，正气受伤，肢冷呃忒，呕吐自利，即用钱氏益黄散，有痰用星附六君子汤理中汤等，倘热气深伏，烦渴引饮，呕逆者，连香饮黄连竹茹橘皮半夏汤，热闭神昏用至宝丹，寒闭用来复丹。

肉桂 --- 稚年夏月，食瓜果水寒之湿，着于脾胃，令人泄泻，其寒湿积聚，未能遽化热气，必用辛温香窜之气，古方中消瓜果之积，以丁香肉桂，或用麝香，今七香饼治泻，亦祖此意，其平胃散胃苓汤亦可用。

姜半夏 --- 疟因暑发居多，方书虽有痰食寒热瘴疠之互异，幼稚之疟，都因脾胃受病，然气怯神弱，初病惊痫厥逆为多，在夏秋之时，断不可认为惊痫，大方疟症，须分十二经，与咳症相等，若幼科庸俗，但以小柴胡去参，或香薷葛根之属，不知柴胡劫肝阴，葛根竭胃汁，致变屡矣，幼科纯阳，暑为热气，症必热多烦渴，邪自肺受者，桂枝白虎汤，二进必愈，其有冷食不运，有足太阴脾病见症，初用正气，或用辛温，如草果生姜半夏之属，方书谓草果治太阴独胜之寒，知母治阳明独胜之热，疟久色夺，唇白汗多，馁弱，必用四兽饮，阴虚内热，必用鳖甲首乌知母，便渐溏者忌用，久疟营伤，寒胜加桂姜，拟初中末疟门用药于左。

瓜蒌皮 --- 初病暑风湿热疟药：脘痞闷，枳壳、桔梗、杏仁、厚朴（二味喘最宜）、瓜蒌皮、山栀、香豉；头痛宜辛凉轻剂，连翘、薄荷、赤芍、羚羊角、蔓荆子、滑石（淡渗清上），重则用石膏；口渴用花粉，烦渴用竹叶石膏汤，热甚则用黄芩、黄连、山栀。

木防己 --- 夏季身痛属湿，羌防辛温宜忌，宜用木防己、蚕砂。

鲜生地 --- 暑热邪伤，初在气分，日多不解，渐入血分，反渴不多饮，唇舌绛赤，芩连膏知不应，必用血药，谅佐清气热一味足矣，轻则用青蒿、丹皮（汗多忌）、犀角、竹叶心、玄参、鲜生地、细生地、木通（亦能发汗）、淡竹叶，若热久痞结泻心汤选用。

桃仁 --- 又夏月热久入血，最多蓄血一症，谵语昏狂，看法以小便清长者，大便必黑为是，桃仁承气汤为要药。

白术 --- 幼稚疟久，面肿腹膨，泄泻不欲食，或囊肿，或跗肿，必用东垣益气以升阳，倘脾阳消惫，前方不应，用理中汤，或钱氏益黄散，得效二三日，须投五苓散一二日，再与异功参苓白术散之类，必全好，徐忠可注金匮有云，幼儿未进谷食者，患疟久不止，用冰糖厚汤，余试果验。

常山 --- 疟多用乌梅，以酸泄木安土之意，用常山草果，乃劫其太阴之寒，以常山极走，使二邪不相并之谓，用人参生姜曰露姜饮，一以固元，一以散邪，取通神明去秽恶之气，总之久疟气馁，凡壮胆气，皆可止疟，未必真有疟鬼，又疟邪既久，深入血分，或结疟母，鳖甲煎丸，设用煎方，活血通络可矣。

归尾 --- 夫疟、痢皆起夏秋，都因湿热郁蒸，以致脾胃水谷不运，湿热灼气血为粘腻，先痛后痢，痢后不爽，若偶食瓜果冰寒即病，未必即变为热，先宜辛温疏利之剂，若脓血几十行，A2K0痛后重，初用宣通驱热，如芩连大黄，必加甘草以缓之，非如伤寒粪坚，须用芒硝咸以软坚，直走破泄至阴，此不过苦能胜湿，寒以逐热，足可却病，古云行血则便脓愈，导气则后重除，行血凉血，如丹皮桃仁延胡黑楂归尾红花之属，导气如木香槟榔青皮枳朴广皮之属，世俗通套不过如此，盖疟伤于经，犹可延挨，痢关乎脏，误治必危，诊之大法，先明体质强弱，肌色苍嫩，更询起居致病因由，初病体坚症实，前法可遵，久病气馁神衰，虽有腹痛后重，亦宜详审，不可概以攻积清夺施治，聊附记一治验备考。

白术 --- 施姓子年七岁，七月二十三日，天久雨阴晦，遂发泄泻，数次，越日腹痛下痢红白，延幼科二人，调治五六日，至初二日，余诊之，呕逆不食，下痢无度，都是血水，其腹痛昼夜无宁刻，两脉俱细，右涩欲歇，坐次鼻闻药气，乃大黄气，令其勿进，施云，有二医在，枉先生一商何如，余唯之，入书室索方，一医曰，下痢已来，全无糟粕，若非攻荡去积，无别法可投，余曰肢冷下血液，七八日，痛不饮水，望面色，枯白中极气黯，脉形细软，按之不鼓，明是冷湿中于太阴，仲景太阴九法，示不用下，乃急煎人参炙草炮姜归芍陈皮，少佐肉桂，二剂，垢滞得下，痛痢大减，继以归芍异功散，参苓白术散，半月全安。

人参 --- 噤口不纳水谷下痢，都因热升浊攻，必用大苦，如芩连石莲清热，人参辅胃益气，热气一开，即能进食，药宜频频进二三口。

前胡 --- 秋深初凉，稚年发热咳嗽，证似春月风温症，但温乃渐热之称，凉即渐冷之意，春月为病，犹冬藏固密之余，秋令感伤，恰值夏热发泄之后，其体质之虚实不同，但温自上受，燥自上伤，理亦相等，均是肺气受病，世人误认暴感风寒，混投三阳发散，津劫燥甚，喘急告危，若果暴凉外束，身热痰嗽，只宜葱豉汤，或苏梗前胡杏仁枳桔之属，仅一二剂亦可，更有粗工，亦知热病，与泻白散加芩连之属，不知愈苦助燥，必增他变，当以辛凉甘润之方，气燥自平而愈，慎勿用苦燥，劫烁胃汁。

竹叶心 --- 翁姓子方数月，秋燥潮热，咳嗽如疟，幼科用发散药二日不效，忙令禁乳，更医用泻白散，再加芩连二日，昼夜烦热，喘而不咳，下痢粘腻，药后竟痢药水，延余诊之，余曰稚年以乳食为命，饿则胃虚气馁，肺气更不爽矣，与玉竹甘草炒广皮竹叶心，一剂热缓，继与香粳米南枣广皮甘草沙参二剂，与乳少进，令夜抱勿倒，三日全愈。

防风 --- 深秋入冬，暴冷折阳，外感发热，头痛身痛，呕恶，必从太阳，若渴能饮水者，里热见症，即非纯以表散，伤寒每以风伤卫，用桂枝法，寒伤营，用麻黄法，小儿肌疏易汗，难任麻桂辛温，表邪太阳治用，轻则紫苏防风一二味，身痛用羌活，然不过一剂，伤风症亦肺病为多，前杏枳桔之属，辛胜即是汗药，其葱豉汤，乃通用要方，若肢冷寒战，呕吐自痢，或身无热，即从中寒里症，三阴须分，但小儿科，太阴中寒最多，厥阴间有，若冬令应寒，气候温暖，当藏反泄，即能致病，名曰冬温，温为欲热之渐，非寒症得汗而解，若涉表邪一二，里热必兼七八，是瘾疹丹痧，非徒风寒，或外受之邪，与里邪相薄，亦令郁于经络，或饮醇厚味，里热炽烈，而卫气不与营分相和，或不正直入内侵，即有腹痛下痢诸症，其治法按症，必以里症为主，稍兼清散有诸，设用辛温，祸不旋踵矣，至于痧痘时疠，须分四气也。