地黄 --- 论痘首推钱仲阳陈文中二家，钱用寒凉，陈用温热，确乎相左，丹溪祖钱非陈，分解毒和中安表为要，以犀角地黄汤为主方，举世宗之，莫敢异议，后之万氏，以脾胃为主，魏氏以保元为主，皆从二家脱化，费建中救偏，悉以石膏大黄，胡氏辄投汗下，松江东地，多宗秦镜明，京口江宁，咸推管柽保赤，吾苏悉遵翁仲仁金镜录，可谓家喻户晓者，其取长在看不在乎治，看法精确，有可以前知之巧妙，后之翟氏聂氏，深以气血盈亏，解毒化毒，分晰阐扬钱陈底蕴，超出诸家，因分别太多，读者目眩心愦，不若翁仲仁刍荛悦口也，然眼目之功，须宗翁氏，而汇治讲究，参之诸家可矣，姑举看法。

楂肉 --- 若二三日间，痘苗已长，色亦颇好，竟夜终日，烦躁不止，最防隐处发疔，及发斑夹疹等症，一发热烦躁，标点虽见，热躁愈加，细询无忽，再参兼症，为六气郁遏者，从时气治，为内伤停滞者，从里症治，亦有表里两解治，亦有下夺者，但下法，寒凉之中，必须活血理气，防其凝涩冰伏，初起必三次而出，热止即齐，其赠点亦有陆续发出者，须看颜色灵活，生气顷刻转机变化为要，察形辨症，治法用药，表药活血疏肌，次则凉血解毒，实热便闭者，微下之，虚弱气怯者，忌进疏解寒凉，间有虚寒弱稚，初发身不大热，四肢皆冷，吐乳泻乳，痘点不长，闻声悠悠欲绝，望色惨淡无形，恰在一二朝间，余见程氏女，年甫半龄，布痘极多，痘形软，色淡白，前症迭见，近地幼科，佥用荆防蒡蝉红花楂肉木通胡荽笋尖之属，方虽写而示以凶危，延余诊视，余曰毒重气虚，法在不治，但身无热，见症虚寒，不因疠气表邪，焉用表药，考万氏始终以脾胃为主，以理中汤加丁桂与服一剂，肢暖呕止，再服利缓痘起，再用参归鹿茸二服，以钱氏异功散而愈。

防风 --- 今世用方，初见宜解肌疏表通套法（十六味）：荆芥（四日不用）、防风（三日不用）、前胡（三日不用）、牛蒡（四日不用）、紫草（二三日便滑忌）、木通、红花、甘草、赤芍、天虫、楂肉、川芎、连翘、桔梗、广皮、蝉蜕（三四日不用）。

葛根 --- 方书中，未见点，用升麻葛根汤，今人不用，伍氏方法，见点忌升麻，后人谓葛根，表疏亦忌，此轻扬升表通套药，若里症急须两解。

赤芍 --- 伍氏方，一二日用羌防透肌汤，今人不用，恶其辛温气雄也，一二日壮热气促，烦渴便秘，痘粒不发，翁仲仁云，若非风寒壅遏定是气虚不振，愚谓近世布痘，每盛发于君相风木燥金司令，盖非火不发也，火郁发之，升阳散火是已，但前症若里热甚重，煎灼脂液，苟非苦寒下夺，佐以升表，不能用也，费建中方颇为中的。石膏、大黄、连翘、赤芍、青皮（腹痛用）、楂肉、花粉、紫草、木通、丹皮（辛凉入血）、犀角（辛凉通血）。发齐后用黄连，凡寒凉清火解毒，必佐活血疏畅，恐凝滞气血也，实热便秘，通用凉膈、通圣、前胡枳壳汤、四顺清凉饮。

牛蒡 --- 痘四日发足，伍氏遵古方，用牛蒡熟末三分，用荸荠汁酒酿炖热调匀，临服刺入生鸡冠血十余滴与服，毒轻者即起光润之色，世皆宗之。

山豆根 --- 发齐已四五日，用凉血解毒汤药，伍氏名四圣饮，非扁鹊原方。生地、连翘、银花、红花、甘草、天虫、桔梗、紫草（便滑用紫铫）。血热，加丹皮、犀角；火盛加黄连、石膏、羚羊角；有斑加金汁、玄参；头面不起加川芎、鸡冠血；咽喉痛加射干、玄参、山豆根；狂乱躁扰加地龙汁；毒重血凝加猪尾血、冰片（量儿大小用）。近世凉血解毒多用地丁银花汤煎药。

白术 --- 痘顶属气，根盘属血，气领血载，毒得煅炼化浆，凡体强质实者多火，以清凉之剂，火解浆成误补则痈，痈者，壅也，其气虚血弱，色必淡白，形不雄伟，或顶陷，或皮皱，内症则恶心，少食便溏，年少未进谷食者，肠胃薄劣，最多虚症，七日以来，元气用事，不能胜毒，使之外出，多有内陷致变者，余最究心是症，调之应手取效，魏氏保元汤，聂氏参归鹿茸汤，陈氏木香异功散，肠滑不禁，用七味豆蔻丸，白术散，理中汤，多获奇效，甚者必用三服。

生黄芪 --- 生黄芪 甘草 陈皮 川芎 当归 白糯米 防风 天虫 角刺 银花

地黄 --- 血热者不用芪、防、芎、归，表疏者去天虫、角刺，血热仍用丹皮、地黄、紫草、连翘、羚羊、猪尾、鸡冠、鸡鸣散达表之药，猪尾膏通里之药。

当归 --- 加川芎、当归，名芎归保元。虚寒加肉桂，升顶加鹿茸，气滞正气加广皮、厚朴，泻加木香、肉果，质弱加坎气、河车，呕逆加丁香、厚朴。

鹿茸 --- 参归鹿茸汤

木香 --- 木香散

人参 --- 人参 木香 丁香 大腹皮 桂心 青皮 诃子 半夏 甘草 前胡 赤苓

附子 --- 人参 木香 官桂 广皮 当归 茯苓 丁香 白术 附子 肉果 厚朴 半夏

赤石脂 --- 肉果 木香 砂仁 枯矾 诃子 龙骨 赤石脂

白术 --- 白术散

木香 --- 四君加藿香、木香。

苇茎 --- 火毒归肺，幼科每用珠子牛黄膏连之属，多不效，余遵孙思邈苇茎汤，或仲景葶苈大枣汤，间有效者，肺气壅遏，苦寒直下，已过病所，故无效。

木香 --- 八九日痒塌切牙，痘不起浆，或灰白，或涸或瘪，危险极矣，速速温补，亦可望生，翁仲仁云，塌陷切牙，便实声清犹可治，声清则上无热壅痰聚，便实则腑阳未至尽泄，所以温补得效耳，木香散、异功散。

芍药 --- 伍氏方用芍药汤

芍药 --- 十一二日，渐次成痂之际，极好之症，必有咳嗽，或夜暮身热，世俗幼科，佥云毒瓦斯未尽，概投苦寒，多有胃减废食，酿成痘劳童怯者，吾尝论痘自肾脏骨髓之中，由肝主筋，心主血脉，脾主肌肉，肺主皮毛，从内之外，毒乃涣释，收疤之时，真气归里，肺合皮毛，是为末传，处位高，体清肃，从前灌胀成痂，蒸迫之气，受亏已极，气泄为咳矣，况投利湿下注药而结痂，其上焦已经转燥，若毒仍留伏，焉能收靥，此断断然也，再论幼稚，阳常有余，阴未充长，布痘至于结痂，一身脂液大损，其阴气告匮可知，故暮夜属阴时，为烦为热者，正内经云，阴虚生内热也，昔西郊吴氏女，年甫四岁，痘系顺症，幼科调治，至浆满成痂之日，忽发烦躁，夜热不寐，晨起安然，医用保元，及钱氏五味异功加芍药与服，热躁益加，又更一医曰，毒瓦斯未尽，乃误补之故，用桑虫浆，暨凉解药，服后躁热甚，而添泄泻，邀余视之，睹浆痂形色，询平素起居，时日当午，即用六味地黄汤一服而安，此二条，人多忽而不究，故辨及之，旬朝后嗽，大法以甘寒生津胃药。

金银花 --- 解余毒药，全以不伤胃气为主，若用芩连必须酒制，翟聂二氏辨之详矣，平和无奇断不败事，如三豆饮之属，若金银花一味，本草称解毒不寒，余见脾胃虚弱者，多服即泻，伍氏用连翘饮子，亦取平和。

玄参 --- 年长出痘，男女欲火已动，其初即现膝痛腰酸，咽喉窒痛欲闭，苦辛寒药，必不效验，宜甘咸寒，滋水制火，佐以解毒，六七日来，痛势日缓，聂氏有参麦清补方，余每用钱氏六味，加龟胶玄参秋石获效者甚多。

前胡 --- 幼科以痰热风惊四治，犹可说也，吾乡有专科，立方钩藤连翘木通薄荷前胡枳壳桔梗，加入表散消食，多不效验。

地黄 --- 钩藤丹皮之属，仅泄少阳胆热，与急惊暴热内闭之症无益，若火热劫烁血液，苦寒咸寒不中与也，宜用犀角地黄汤之属。

白附子 --- 慢惊古称阴痫，其治法急培脾胃，理中汤为主方，有痰呕吐，用南星白附子六君子汤，声音不出，开窍如竹沥姜汁菖蒲根郁金之属。

姜 --- 是病皆他病致变，其因非一，有过饥禁食气伤，有峻药强灌伤胃，有暴吐暴泻，脾胃两败，其症面青A2J6白，身无热，虽热不甚，短气骨软，昏倦如寐，皆温补治之，惟呕逆不受乳食，温补反佐姜连，连理汤、钱氏益黄散、钱氏异功散。