稚年五疳，犹大方之五劳，虽方书有五脏之分，是症夏令为多，固从脾胃，盖小儿乳食杂进，运化不及，初断乳后，果腥杂进，气伤滞聚，致热蒸于里，肌肉消瘦，腹大肢细，名曰丁奚，或善食，或不嗜食，或渴饮无度，或便泻白色，久延不已，多致凶危，宜忌食生冷腥肥凝滞，治法初用清热和中分利，次则疏补佐运，常有继病，治之无效，待妊妇产过自愈者。

夏季霍乱吐泻，通用藿香正气散。

水泻，宜分利，四苓散，寒加姜桂，热用芩连。

腹痛宜疏气，调气用木香青皮，有滞加炒楂肉厚朴，重则加莱菔子槟榔。

腹痛有热，用芩芍枳实，有寒则用草果砂仁吴萸。

吐泻后，能食，便反秘结者愈，不能食，神怯色痿者，防慢惊，治法调中温中，若有余热烦渴，甘寒或甘酸救津，故木瓜之酸，制暑通用要药。

<3>春温 风温</3>

春月暴暖忽冷，先受温邪，继为冷束，咳嗽痰喘最多，辛解忌温，只用一剂，大忌绝谷，若甚者宜昼夜竖抱勿倒三四日，夫轻为咳，重为喘，喘急则鼻掀胸挺。

春温皆冬季伏邪，详于大方诸书，幼科亦有伏邪，治从大方，然暴感为多，如头痛恶寒发热，喘促鼻塞身重，脉浮无汗，原可表散，春令温舒，辛温宜少用，阳经表药，最忌混乱，至若身热咳喘有痰之症，只宜肺药辛解，泻白散，加前胡牛蒡薄荷之属，消食药，只宜一二味，若二便俱通者，消食少用，须辨表里上中下，何者为急施治。

春季温暖，风温极多，温变热最速，若发散风寒消食，劫伤津液，变症尤速，初起咳嗽喘促，通行用：薄荷（汗多不用）、连翘、象贝、牛蒡、花粉、桔梗、沙参、木通、枳壳、橘红、桑皮、甘草、山栀（泄泻不用）、苏子（泻不用，降气）。

表解，热不清，用：黄芩、连翘、桑皮、花粉、地骨皮、川贝、知母、山栀。

里热不清，早上凉，晚暮热，即当清解血分，久则滋清养阴，若热陷神昏，痰升喘促，急用牛黄丸至宝丹之属。

按风温乃肺先受邪，遂逆传心胞，治在上焦，不与清胃攻下同法，吾乡幼科当此，初投发散消食，不应，改用柴芩瓜蒌枳实川连，再下夺不应，多致危殆，皆因不明手经之病耳，若寒痰阻闭，亦有喘急胸高，不可与前法，用三白吐之，或妙香丸。

<3>暑热</3>

暑邪必挟湿，状如外感风寒，忌用柴葛羌防，如肌表热无汗，辛凉轻剂无误，香薷，辛温气升，热伏易吐，佐苦降，如杏仁川连黄芩，则不吐，宣通上焦，如杏仁连翘薄荷竹叶，暑热深入，伏热烦渴，白虎汤，六一散。

暑邪首用辛凉，继用甘寒，后用酸泄敛津，不必用下。

暑病头胀如蒙，皆湿盛生热，白虎竹叶，酒湿食滞，加辛温通里。

小儿发热，最多变蒸之热，头绪烦，不能载，详于巢氏病源矣，然春温，夏热，秋凉，冬寒，四季中伤为病，当按时论治，其内伤饮食治法，不宜混入表药，消滞宜用丸药，洁古东垣已详悉。

<D>徐评 此卷论幼科及看痘之法，和平精切，字字金玉，可法可传，得古人之真诠而融化之，不愧名家，闻此老太翁为幼科专门，名闻远近，此老既得家学渊源，又于大方诸书探取经络药性之义，而附益之，所以其理益精，其方益正，不若前所列之诸案，尚多可议处也。</D>

<3>痧疹</3>

袁 温邪痰嗽，气喘肚膨，四日不解，防发痧。（温邪。）

汪 痧将退，热未去，肺气不清，咳逆无痰。（热邪留肺。）

前胡 桑皮 杏仁 橘红 桔梗 木通 苏子 象贝

王 痧隐太早，咳喘发热，宜开肺气。

薄荷 杏仁 象贝 连翘 桑皮 木通 紫菀 郁金

某 温邪发痧不透，热毒内陷深藏，上熏肺为喘，下攻肠则利，皆冬温火化之症，经云，火淫于内，治以苦寒，幼科不究病本，不明药中气味，愈治愈剧，至此凶危。（热邪内陷。）

川连 黄芩 飞滑石 炒银花 连翘 甘草 丹皮 地骨皮

蒋 喘为肺病，胀乃肝病，因时痧寒热未解，热邪内陷所致，王先生用苦辛酸法极通，然浮肿腹痛未减，得非经腑之湿热留着欤。

艾 痧退后，呻吟不肯出声，涕泪皆无，唇紫掀肿，乃毒火未经清解，上窍渐闭，气促痰鸣，犹是温邪客气致此，自当清解务尽，其神识自和，奈何以畏虚滋肺，邪火愈炽矣。（毒火未清。）

王 痧后，及暮加喉痛咳。

邹 咽痛鼻燥唇肿，自利，风温热化发疹，上焦热炽，宜辛凉微苦以泄降。（风温发疹。）

谭（六岁） 温邪时疠，触自口鼻，秽逆游行三焦，而为麻疹，目赤鼻煤，吐蛔泻蛔，津津汗出，而喘渴欲饮，当与辛苦寒，刘河间法，世俗不知，佥曰发痧，但以荆防蝉壳升提，火得风飏，焰烈莫遏，津劫至变矣。（疠邪。）

凉膈去硝、黄，加石膏、牛蒡、赤芍。

张（三岁） 手足烦热，时发赤块。

绿豆壳 卷心竹叶

<3>痘</3>

程 见点若隐若现，神倦不宁，势如闷伏，表里俱不宣畅，双解固宜，再佐以芳香搜逐，使蕴伏之毒透发为主。（见点闷症。）

紫雪丹。

周 热闭心胞络中，目绽，口开，舌缩，两手撮空，发痉，溺通便涩，血分大伤，九日险期，按法图幸，勉与紫雪丹二钱，开水调缓缓下，用茶铫，倘得神苏痉舒，方有生机。

鲜生地 竹叶心 玄参 知母 银花露 金汁 先用紫雪（一钱）

龚 初起腰足俱软，肝肾蕴毒不得外越，目泛匝舌，继增喘促，是紧闷不治之症，诸医佥用石膏大黄，然此药仅通阳明胃腑之壅，未能搜逐肝肾至阴之脏，读宋医钱仲阳直诀，毒伏于阴，亦有下夺之法，其制方曰，枣变百祥丸，乃百中望一二生全者。（肝肾蕴毒闷症。）

水煮，至枣熟去核及大戟汤，但用枣肉研化开水送。

某 毒伏不肯宣透，气滞血凝，焉能起绽成浆，七八险关，诊视肉肿疮枯，神躁不安，议疏利内壅，佐活血透肌法。

犀角 紫草 炒楂 鲜生地 酒浸大黄 红花 青皮 丹皮 连翘 牛蒡

俞 发热五六日来，神烦不宁，腹膨咳逆，询知二三日前，眉间见点数粒，状如麸A2J8，随即隐伏不见，乃毒重壅遏，闷伏景象，设或发出，亦属重险，且甫生六月，胃乏谷气，难进汤药，拟进紫雪须少，搜其蕴蓄之邪，使其神安再商。

紫雪丹（一分）。

高 点虽繁密，根脚绽立，寒凉药不宜太重，可以维持收功。

犀角 连翘 牛蒡 炒楂 紫草 丹皮 天虫 桔梗

庞（二朝） 神倦腹痛，点粒繁琐，地界不清，是时邪毒火兼重，急进双解法，使大便稍通，六腑气宣，则痘毒外透再商。

犀角 连翘 牛蒡 酒大黄 紫草 青皮 桃仁 炒楂 木通 生石膏 荆芥 笋尖

程 成片不立，顶焦黑滞，肝肺毒重，不能起胀，焉得化毒，今喘咳交加，九朝难过。

羚羊角 玄参 连翘 天虫 土贝 紫草 炒楂 丹皮

钱（三朝） 虽未发齐，其点形繁密，色泽不润，重险何疑，今痧未全退，尚宜清解。

犀角 生石膏 炒楂 紫草 连翘 牛蒡 赤芍 桔梗 木通

程（三朝） 身小气弱，布痘繁稠，用药不宜寒凉，五日后受得补托，可冀有成。

连翘 牛蒡 炒楂 红花 天虫 川芎 归身 桔梗 炒干荷叶

毛 身小气弱，浆发惊窜属虚。

人参 炒归身 炙草 广皮 炒白芍 炒黄米

童（四朝） 痘形粘着肌肉，不肯起绽高立，兼之繁红壳薄，乃时火毒火交炽，而元气素亏体质，目今六日前，时疠未彻，宜先清解活血提顶，希冀磊磊分成地界再究。

犀角 羚羊 玄参 丹皮 炒楂 秦皮 紫草茸 银花

郑 痘发犹热身热咳嗽，乃风温入肺未解，诊其点粒粘着不爽，温邪郁滞气血，更体质素虚，议开肺气以宣之，活血以疏动之，冀其形色充长，若一进沉降，恐无好音。

连翘 桔梗 红花 牛蒡 甘草 炒楂 郁金 丹皮 鸡冠血

川芎 当归 天虫 桔梗 甘草 角刺 紫草茸 丹皮 炒楂

又（六朝） 进和气血法，形色略润，究不肥绽，焉得起胀成浆，议进十宣散法。

人参 川芎 归身 广皮 紫草茸 天虫 红花 白芷 甘草 桔梗

张（四朝） 船小重载，难许全功，勉议进鸡鸣散二分。

陆（五朝） 点虽不密，色滞形痿，痰多呛逆如嘶，是痘虽发出，毒犹在内，上冲心肺，故有喘咳不宁之象，进凉血透毒法。

羚羊 桔梗 甘草 紫草 丹皮 川贝 连翘 玄参 射干 天虫 西牛黄（一分）

朱（四朝） 炒黄米 炒山楂 红花 笋尖

又（五朝） 身小痘多，元气最薄，胃腑未纳谷味，汤药大过，须虑呕泄，宜少少与药，扶过八九风波，方得平安。

又（六朝） 薄嫩无浆，仍宜内托。

黄芪 防风 归身 川芎 紫草茸 丹皮 天虫 桔梗 甘草 鸡冠血

宋（五朝） 颧颊形似红沙，余痘干枯不润，昨进清毒活血，续发点子盈千，仲仁谓毒重壅闭气血，必干焦退缩，今五朝形象，仅似初齐，痘以十二日为常数，已经壅遏未发三日矣，当此质薄神弱，恐难延多日，即或望其堆沙发臭，然必在旬日以外，目下总以解毒清凉，八九波涛汹涌，恐难人力稳全。

吴（五朝半） 痘子分颗，原属纯正，所嫌色滞干枯，防八九痒塌，凉药兼以活血，是为平准方法，看守勿懈为上。

羚羊角 丹皮 连翘 炒楂 紫草茸 黄连 玄参 天虫 生地 鸡冠血

孙 肌柔白嫩，体质是虚，但布痘必由时疠感触，地中六气，咸从火化，疠固客气，相混气血，若非清解，何以透达，今视色油红，按形松软怯，再视面部肌肉先肿，痘形未具起胀之象，体症未为合局，虑进锐退速，清凉解毒，佐以提顶，在五六日之法，然险症变迁不一，未可以经常定论。

羚羊角 连翘 丹皮 天虫 生甘草 紫草茸 川连 炒楂 桔梗

汪（五朝） 痘形繁琐成片，色紫滞，乃火毒重险症，藉身大气旺，扶持十四险关，冀其发臭堆沙，庶几可以图幸。

犀角 羚羊角 桔梗 炒楂 连翘 天虫 紫草茸 丹皮 石膏 银花 地丁 牛蒡 猪尾血 冰片

又（六朝） 虽血热毒重，犹幸八龄体坚，急清解活血，莫令痰阻废食，扶持堆沙，可望向安，照前方去石膏、地丁、天虫、牛蒡，加川连、玄参、土贝。

查 痘子成浆，湿气蕴于皮毛，与热气相蒸，内应乎肺，发出罩痘疹，宜忌荤腥，轻清理肺，淡渗消其湿热，验其体质最薄，慎勿过剂。

顾 痘发由络，其毒不化而转陷，亦归于络，当世略晓攻补而已，读古人书，辛香温煦，乃治毒陷大法。

人参 肉桂 炙草 丁香 厚朴 诃子皮 广皮 木香 前胡 茯苓

徐 未纳谷食，但以汤药，所以滑泄不止，头仰胸突，拥痰身热，肺热未清，不可骤补，翁仲仁有泄泻安宁，大虚少毒之议，姑以和中清咽再商。

桔梗 甘草 炒归 川芎 广皮 炒楂

炒黄米汤煎，冲鸡冠血。

又（七朝） 身小痘密，气弱难任，虽清浆三四，防护宜慎，八九日不致损破，可以有成。

人参 黄芪 炙草 紫茸 天虫 广皮 川芎 归身 厚朴 炒楂 加炒冬米

孙（七朝） 色娇皮薄，浆汁未灌，缘身小痘多，气血交亏，不能运毒化浆，八九日期，最有痒塌之虑，扶过十二朝无变，庶几可望有成，进参归鹿茸汤法。

人参 归身 鹿茸 生黄芪 炙草 广皮 厚朴 煨木香

又（八朝） 照前方加肉果炒冬米。

人参 黄芪 广皮 炙草 木香 鹿茸 归身 肉果 坎气 官桂

又（十三朝） 靥痂甚薄，中凝血迹，兼之呛逆带呕，食入便有不化之形，此虚中有毒，非纯补纯清之症。

炒川贝 炒银花 茯苓 苡仁 甘草 地骨皮

杨（八朝） 阔塌瘪陷，浆色白滞不荣，谓之气衰毒陷，所冀堆沙加食，一线机耳。

又（十一朝） 浆满堆沙，四肢圆绽，但气弱恐其不肯收痂，必实脾利水为法。

又（十三朝） 已经堆沙加食，都是向安之象，便溏滑腻，皆寒凉伤里肠，中脂垢自下，当脾胃药中，少佐固肠，以久延不已，尚贻变症。

人参 熟术 诃子 广皮 肉果 白芍 木香 炙草 茯苓

又（十六朝） 纳食不化腹膨便粪白色，要之胃滞当消，脾弱宜补，古称痞满属气，气行滞通，但痘后虚体，纯消犹恐变症。

鲍（九朝） 浆不外达，毒欲内陷，已经切牙，滑泻呕恶，内症诸款，皆属深畏，十二十四，总属险关，痘子毒瓦斯，必气元旺，冀其托出，议以陈氏木香散，救里托毒。

人参 木香 丁香 官桂 炒归身 厚朴 广皮 肉果 诃子皮

孙 面肿目泛，头摇微呕，肝风离体，乘上逆攻，此乃变惊欲厥之象，夫相火寄于肝胆，气敛痘痂，宜进凉解清毒，倘得微热缓，仍进谷，方有佳音。

羚羊角 连翘 胆星 丹皮 炒银花 金石斛 茯苓

诸（十三朝） 痘已收靥，然痂落太早，恐有余毒，今泻止溺短，宜进清凉，佐以分利。

某 已经回痂，不宜再进补剂，恐气血壅滞，致有余毒变幻，宗翁仲仁清凉以助结痂之法。

胡（十五朝） 虽然堆沙靥痂，切牙发呛，毒瓦斯未尽，上冲心肺，补清皆在难进，扶过十八日后，痈毒尚可疗治，若发疳蚀，恐难全愈。

炒麦冬 白沙参 苡仁 川贝 炒银花 地骨皮

沈（十三朝） 浆未充满，忽然干涸，即是倒靥，切牙寒战，元气大亏，非峻补难挽。

人参 鹿茸 炒当归 桂心 桂圆 煨木香

程 回痂太早，余毒流走四肢，臂腿肿痛，议活血解毒。

连翘 小生地 当归 赤芍 刺蒺藜 丹皮 夏枯草 银花 酒半小杯

吴（十四朝） 呛咳呕逆腹膨，都是余毒内闭，小便少，大便溏，不得爽，倘再加喘急，便是棘手，必得疡毒外发，可望挽回。

桑白皮 大腹皮 绿豆皮 茯苓皮 飞滑石 生甘草梢

查 痂后发痧，系肺热未清，宜辛凉佐以解余毒。

连翘 杏仁 桑皮 地骨皮 黄芩 木通 银花 牛蒡 夏枯草

吴（十四朝） 薄浆回痂，毒瓦斯未化，已有疳蚀之患，理进清解余毒，但勉进稀粥，溏泻未罢，胃未旺相，脾气积弱，议以渗利分消，仿古痘毒当利小便意。

桑皮 地骨皮 连翘 茯苓 川贝 苡仁 银花

某 痘未退痂痧火内逼为喘。

沈 薄浆回痂，毒瓦斯未尽，只宜清肺解毒。

炒川贝 茯苓 苡仁 车前 炒泽泻 炒银花

徐（十六朝） 疳毒已发咳呛未止，痂落如麸，肌色A2J6白，虽属气血交虚，但痘后余毒，未可骤补，议进和脾胃利湿方法，疳毒宜速调治，恐日久愈虚，致有慢惊之虑。

苡仁 川斛 茯苓 百合 广皮 炒泽泻

沈（二十一朝） 痰呛失音，不嗜食物，昼则稍安，暮夜烦躁，此肺热未肃，磨耐多日，体气阳亢阴亏，肝风内炽，突起惊厥可虑。

地骨皮 甘草 生地炭 绿豆皮 炒丹皮 炒川贝 川斛

李（二十朝） 纳食呕吐，脾胃不和，肝风内动，肢浮肉肿，治宜培土制木，以缓肝风，冀免惊疳之患。

人参 茯苓 炒芍 生谷芽 藿香 广皮 半夏曲

冯（二十八朝） 痂靥粘连，神气昏昧，元为浆泄而乏，变幻慢惊欲脱，此皆稚年阳亢阴亏，羞明目窜，肝阴乏绝，恐难再振。

又（三十七朝） 阳极则烦，阴涸为躁，夜甚剧，自从阴分设法，益虚和阳为治。

人参 熟地 芡实 茯苓 建莲 远志 炒山药 五味

杨 点来不爽，顶有水痕微焦，此时气传染，胎毒未发，乃水赤之类痘耳。

连翘 牛蒡 丹皮 赤芍 飞滑石 木通 山栀 甘草

邵 痘中复感温邪，口鼻触入，由中道以布及络脉，目泛失明，左肢不举，少腹突起肿满，两足皆痿，询知痘见六日，陡然头摇烦躁而得，小便淋滴，大便渐塞，乃厥阴肝热，疝瘕失其疏泄，内风旋转，腑阳不通，经言暴肿暴胀，皆风火变动，至于迅速病来，其能食消运，热化自可杀谷，考古辛散酸泄甘缓三法，难图腑络壅结，仲景于厥阴条例，有下之利不止者死之大戒，议进咸苦以通在下结热，愚见若此，再与高明商酌良治。

川楝子 小茴 芦荟 山栀 橘红 龙胆草

方诸水七匙。

<D>自古治痘名家，不啻廿数，各有精确卓识，以补前人之未备，虽各有所偏，实所以相济也，医者贵统汇群书，随宜施治，安可执偏隅管见，以应无穷之变哉，先生治痘，夙称神奇，观其案中，寒热攻补，不胶于一见，如毒火深伏，气血壅遏者，藉芳香以搜逐，用紫雪丹，气滞血凝，毒重火伏者，以酒大黄石膏青皮桃仁荆芥犀角猪尾血之类主治，肝肺毒火不宣，气血有焦燔之势者，用犀角羚羊紫草丹皮石膏鲜生地之类，元气不支，阳虚毒陷，而见灰白湿烂，泄泻呕恶等症者，用辛香温煦，如陈文仲之法为要，气血极虚，而浆清塌痒，全无实症相兼者，当峻补气血，用参归鹿茸汤，及坎气汤之类，气虚莫外乎保元及四君子，血虚不离于四物及补血汤，又有气虚血热者，补气之中兼凉血，血虚气滞者，补血之中佐辛香，用攻法须分部位经络，用补法当辨寒热燥湿，过清则有冰伏之虑，偏热则有液涸之虞，此皆先生采择先贤之法，因人见症而施治，可谓善法古者矣，夫痘虽以形色辨其吉凶，然内症尤为紧要，如痘点既起，或不慎风寒，而营卫凝涩，或纵恣饮食，而气机呆钝，以致身热不食，腹膨呕恶泄泻，浆水不行，不究治其病因，但执清寒腻补，常有凶危之变，亦有痘形虽重，若神宁安静，饮食二便如常，声音清响，调理得宜，亦可转危为安，大凡形老而色鲜明者，虽甚密，变幻恒少，形嫩而色晦滞者，虽稀疏，变幻恒多，表里相参，审症的确，然后设法处治，方无贻误，至于逆症条款已现，虽自昔名医，亦莫能挽救，小儿夭枉者，不可胜数，深可怜悯，迩年以来，幸有种痘一法，盛行于世，实可挽回造化，凡有小儿者，俟周岁后，即可选用种痘之苗，引而发之，百不失一，此诚补痘科之未备，而为最上一乘之法也，正痘有先贤诸成法，避险有种痘之良方，痘症于是乎大全矣。（陆履安）

痘之发也，一由乎胎毒内伏，一由于外感时邪之气引导而出，其症之顺逆，若内毒轻而外感之气亦轻者，痘必稀疏，此为顺症，苦内毒轻，而外感之气重者，虑其遏闷不齐，不易灌浆，若能至灌浆，则时邪渐退，后易收功，此为先重后轻症，若内毒重，而外感之气轻者，虑其灌浆已后，毒难尽泄，不易收靥结痂，恐发痘毒疳蚀之患，此为先轻后重症，若内毒重而外感之气亦重者，痘必稠密，色不鲜泽，发热见点之后，一路蹭蹬，难以收功，此为逆症，然胎毒之轻重，人皆易明，若外感之气，人莫能晓，夫天地间，只有六气，气平则为和气，不平则有胜复，胜复至极，则为厉气，为瘟疫气，瘴气，更有道涂中秽浊气，人若感之，不拘老幼俱病，今出痘所感之气，则异乎是，此气独与未泄胎毒之小儿，两相感触，未闻痘症盛行之时，已出过痘之儿，亦染病患也，考是气，自古迄今，从未有人申帮助白，确定为何气，故前贤于痘症一科，未尝不殚心瘁虑，立论著方，因不明其气之源，不无偏执之弊，有喜于寒泻者，有喜于温托者，有先用寒泻，而后用温补者，有先用温托，而后用清火解毒者更有不审儿体之虚实寒热，俱宗费建中救偏琐言，每于发热见点时，概用大黄石膏黄连犀角羚羊茅根芦根等，不知费氏之书，名为救偏，乃救惯用热药之偏耳，若本不偏，而宗其法，则不偏者，反至偏矣，婴儿之命，其何以堪，幸古有种痘良法，相传至今，其法简易灵验，至稳至当，盖正痘因外感时邪而发，种痘则种于无病之时，故所出稀疏，轻者不过几十粒，此岂非避危就安之妙法乎，倘愚人不信，何不将自出与种出，彼此相较，其理自明，假使一村之中，有百儿出天花，未尝不延医服药，若能八九十收功，人咸称为太平痘矣，甚有竭力调治，而损伤几及一半者，不闻其归咎于医生，惟有委命于天而已，今若种百儿之痘，设或损伤四五个，则必责罚种师，并不容其托足于此一村矣，人何笃信医生，而不相信种师耶，与其委命于天，孰若以人功挽之，以此相较，则当种与不当种自决矣，至于种法，全在乎好苗夫，苗者，即取他儿之痘痂也，必要用种出之痘，落下之痂，谓之种苗，此苗之中，毫无天行时毒之气在内，故放心可用，若自出天花之痂，谓之时苗，此苗之中，有时行之气，若不辨而用之，名虽为种，实与传染他儿天行时痘之气无异，此时苗之不可用也，然种苗之内，尚要拣择，必取痘粒稀少，其色红润，灌浆厚厚，所结之痂，厚实光泽尖圆者，此气血充足，阴阳合德，上好之苗也，俟痂落下，用纸包好，记明何日收得，收贮新瓷瓶内，紧护其口，置清凉之处，勿触秽热之气，其苗在北方，天气凉，春月之苗，一月之内，尚可种，冬月之苗，四五十日尚可种，南方气温，夏月之苗四五日，春月之苗二十日，冬月之苗三十日，若延日久，则气薄无力，恐种不出矣，欲觅此等种苗，先访有人家正在种痘之际，向彼明言其故，恳求四五粒，即可源源而种，或平日于同道种师内，相与一二位志诚老实者，议明彼此互借，则苗亦可不断，亦有胆大种师，于五六月中，觅贫家壮实之儿种之，不惟不索酬谢，反肯津贴银钱，次递传种三四个儿，延至七月，则苗亦可以不断矣，近有种师，因种苗已断，权取时苗种之，往往有种出稠密棘手重痘者，皆时苗之过也，不知时苗之性，即选上好者，亦必要传种过四五儿俱各顺当者，其苗性始和平，方能与种苗相等，至于下手种法，尤须详慎，凡种一儿，用痘痂三四粒，两儿则用六七粒，放于干净茶杯中，倾入清水四五茶匙，用小指尖在内三四搅，则痂已湿，急将水倾去，用柳木杵研，其杵约长四寸，粗如笔管，两头要光圆，研十数转足矣，如痂太干，加入清水一二滴，切不可太潮，只要研如干浆糊状，用弹熟新棉花，捏一小团，如枣核大，两头要圆，其长短粗细，量儿鼻孔之大小为之，其棉团不可太松软，松则苗气易往外泄，且见涕则缩小，易于脱出，将棉团只用一头，蘸痂末糊于上，塞儿鼻中男左女右，塞不可太进太进则儿不适意，亦不可太出，太出则易于脱落，总要宽紧浅深适中为妙，塞后勿放小儿用手拈出，若被喷嚏打出，急将苗仍塞入鼻，下苗后，以六个时辰为度，天气热，早取出数刻，天气寒，多留数刻，痘苗取出之后，其苗气渐次传遍五脏，至七日，或八九日始发热，发热三日而见点矣，此诚至稳至当之种法也，种痘之苗，不过痘痂一味，今各处种师，诡称痘痂之外，尚要加他药为引导者，此系惑人谎语，切勿信之，既种后，将发热时，小儿颈项内，男左女右，必发一小块，状如痰核，此乃毒瓦斯结聚于此，故痘发必稀疏，此块不必医治，待落痂后，则块亦渐消矣，若用时苗种者，项中无块，当以此辨之，又间有惊痘，于发热时，小儿忽然惊搐，手足蜷，不语，目上视，有片时即平复者，有发一二个时辰者，有发一次者，有发两次者，总属不妨，斯时切不可扰动叫唤之，待其自平即已，不必服药，须预对痘家帮助，免其忧虑以上诸论，皆时下种师之秘诀也，若夫辨儿之可种与不可种，须察儿体之虚实，及有无宿病，若调治之法，当节饮食，适寒温，防惊吓，此皆种师俱各明悉，兹不重赘。（郑望颐）

徐评 诸案切近，和平之中，又能沉着变化，备前人之所未备，去其疵而取其纯，我郡有如此名家，而不师法，偏拾庸妄人唾余，不论何人，不问虚实，总以石膏大黄种种恶毒之药，大剂灌死，每当出痘之年，枉死载道，全不知惨，此等恶医，皆有豺野狼之心也。</D>

<3>疳</3>

沈 稚年歇乳进谷，脾胃气馁少运，腹膨目医，是为五疳，夏日中土司令，久病投以补气，恰合调其脾胃，近日呕吐泄泻身热，乃寒暄失和，致食不易化，小溲既少，腑气不和，余幼科久疏，忆钱氏每以调中为主而驱邪都主轻法，深虑脾土伤，则延惊痫耳。（脾胃虚腑气不和）

益智仁 焦术 茯苓 广皮 藿香梗 厚朴 楂肉 泽泻

张（四岁） 五疳，腹胀数月，法当疏补。

人参 茯苓 麦芽 炒楂肉 广皮 半夏 湖莲

陈（五岁） 官人自汗，短气咳嗽，风温见症，肌腠有痤痱之形，与疹喑腑病不同，但幼稚生阳充沛，春深入夏，形质日减，色脉是虚，而补脾辛甘不应，腹满，按之自软，二便原得通利，腹痛时发时止，痛已即能饮食，考幼科五疳，与大方五劳相类，疳必因郁热为积为虫，此饮食不充肌肤也，病来非暴，攻之由渐，再论疳热虫积，古人治肝治胃恒多，而洁古东垣，于内伤夹滞，每制丸剂以缓治，取义乎渣质有形，与汤饮异歧，刻下温邪扰攘之余，聊以甘凉之属，清养胃阴，以化肺热，其辛气泄表不宜进。（内伤夹滞虫积）

甜杏仁 麦冬 地骨皮 生甘草 冬桑叶 玉竹

和入青甘蔗汁一酒杯。

（丸方）仿治疳热羸瘦，从阳明厥阴疏通消补兼施。

人参 黄连 芦荟 川楝子 使君子 茯苓 白芍 广皮 胡黄连 南山楂

某（七岁） 食物不节，脾胃受戕，腹膨，大便不调，此属脾疳。（食伤脾胃）

焦术 茯苓 广皮 益智仁 大腹皮 木瓜 炮姜 炒神曲

吴（九岁） 能食，色枯形瘦，暮热泄泻，此皆口腹不慎，值长夏温热，脾胃受伤，将成五疳。

青蒿梗 枳实炭 胡黄连 炒谷芽 炒白芍 炒山楂 广皮 茯苓 泽泻

王 五疳已久，脾胃受伤，食物不运，腹膨溏泻，此积聚未清，中焦先馁，完谷不化，肿胀皆至，难治之症。

七香饼。

<D>疳者，干也，小儿肠胃柔嫩，若乳食失调，甘肥不节，运化不及，停积发热，热久津干，此因积成疳者也，或五脏偏热，或因病后，或医药误下，致亡失津液，脾不输化，积滞不行，此因干致积者也，故五疳不离乎脾胃，其治法，胃滞当消，脾弱宜补，热者用苦寒清火，冷者宜辛温健运，有虫者，兼用杀虫之品，其虚者，各随本脏补其母，总宜丸剂缓调，不能旦夕速功，或用鸡肝纳入治疳药炖食，最为有效。（陆履安）

徐评 此老幼科痘症，不仅名家，可称大家矣，敬服敬服。</D>