藿香 --- 夏季霍乱吐泻，通用藿香正气散。

水泻 --- 水泻，宜分利，四苓散，寒加姜桂，热用芩连。

莱菔子 --- 腹痛宜疏气，调气用木香青皮，有滞加炒楂肉厚朴，重则加莱菔子槟榔。

砂仁 --- 腹痛有热，用芩芍枳实，有寒则用草果砂仁吴萸。

木瓜 --- 吐泻后，能食，便反秘结者愈，不能食，神怯色痿者，防慢惊，治法调中温中，若有余热烦渴，甘寒或甘酸救津，故木瓜之酸，制暑通用要药。

前胡 --- 春温皆冬季伏邪，详于大方诸书，幼科亦有伏邪，治从大方，然暴感为多，如头痛恶寒发热，喘促鼻塞身重，脉浮无汗，原可表散，春令温舒，辛温宜少用，阳经表药，最忌混乱，至若身热咳喘有痰之症，只宜肺药辛解，泻白散，加前胡牛蒡薄荷之属，消食药，只宜一二味，若二便俱通者，消食少用，须辨表里上中下，何者为急施治。

象贝 --- 春季温暖，风温极多，温变热最速，若发散风寒消食，劫伤津液，变症尤速，初起咳嗽喘促，通行用：薄荷（汗多不用）、连翘、象贝、牛蒡、花粉、桔梗、沙参、木通、枳壳、橘红、桑皮、甘草、山栀（泄泻不用）、苏子（泻不用，降气）。

地骨皮 --- 表解，热不清，用：黄芩、连翘、桑皮、花粉、地骨皮、川贝、知母、山栀。

川连 --- 按风温乃肺先受邪，遂逆传心胞，治在上焦，不与清胃攻下同法，吾乡幼科当此，初投发散消食，不应，改用柴芩瓜蒌枳实川连，再下夺不应，多致危殆，皆因不明手经之病耳，若寒痰阻闭，亦有喘急胸高，不可与前法，用三白吐之，或妙香丸。

六一散 --- 暑邪必挟湿，状如外感风寒，忌用柴葛羌防，如肌表热无汗，辛凉轻剂无误，香薷，辛温气升，热伏易吐，佐苦降，如杏仁川连黄芩，则不吐，宣通上焦，如杏仁连翘薄荷竹叶，暑热深入，伏热烦渴，白虎汤，六一散。

竹叶 --- 暑病头胀如蒙，皆湿盛生热，白虎竹叶，酒湿食滞，加辛温通里。

飞滑石 --- 川连 黄芩 飞滑石 炒银花 连翘 甘草 丹皮 地骨皮

赤芍 --- 凉膈去硝、黄，加石膏、牛蒡、赤芍。

卷心竹叶 --- 绿豆壳 卷心竹叶

芳香 --- 程 见点若隐若现，神倦不宁，势如闷伏，表里俱不宣畅，双解固宜，再佐以芳香搜逐，使蕴伏之毒透发为主。（见点闷症。）

大黄 --- 龚 初起腰足俱软，肝肾蕴毒不得外越，目泛匝舌，继增喘促，是紧闷不治之症，诸医佥用石膏大黄，然此药仅通阳明胃腑之壅，未能搜逐肝肾至阴之脏，读宋医钱仲阳直诀，毒伏于阴，亦有下夺之法，其制方曰，枣变百祥丸，乃百中望一二生全者。（肝肾蕴毒闷症。）

大戟 --- 水煮，至枣熟去核及大戟汤，但用枣肉研化开水送。

鲜生地 --- 犀角 紫草 炒楂 鲜生地 酒浸大黄 红花 青皮 丹皮 连翘 牛蒡

茅根 --- 茅根笋尖汤代水。

紫草 --- 犀角 连翘 牛蒡 炒楂 紫草 丹皮 天虫 桔梗

酒大黄 --- 犀角 连翘 牛蒡 酒大黄 紫草 青皮 桃仁 炒楂 木通 生石膏 荆芥 笋尖

羚羊角 --- 羚羊角 玄参 连翘 天虫 土贝 紫草 炒楂 丹皮

银花 --- 银花地丁汤代水。

归身 --- 连翘 牛蒡 炒楂 红花 天虫 川芎 归身 桔梗 炒干荷叶

炒白芍 --- 人参 炒归身 炙草 广皮 炒白芍 炒黄米

紫草茸 --- 犀角 羚羊 玄参 丹皮 炒楂 秦皮 紫草茸 银花

郁金 --- 连翘 桔梗 红花 牛蒡 甘草 炒楂 郁金 丹皮 鸡冠血

紫草茸 --- 川芎 当归 天虫 桔梗 甘草 角刺 紫草茸 丹皮 炒楂

紫草茸 --- 人参 川芎 归身 广皮 紫草茸 天虫 红花 白芷 甘草 桔梗

射干 --- 羚羊 桔梗 甘草 紫草 丹皮 川贝 连翘 玄参 射干 天虫 西牛黄（一分）

山楂 --- 朱（四朝） 炒黄米 炒山楂 红花 笋尖

炒当归 --- 川芎 炒当归 桔梗 甘草 黄米 鸡冠血

紫草茸 --- 黄芪 防风 归身 川芎 紫草茸 丹皮 天虫 桔梗 甘草 鸡冠血

鲜生地 --- 犀角 羚羊角 川连 炒楂 土贝母 紫草茸 玄参 鲜生地 连翘 丹皮 牛蒡子 猪尾血

紫草茸 --- 羚羊角 丹皮 连翘 炒楂 紫草茸 黄连 玄参 天虫 生地 鸡冠血

生甘草 --- 羚羊角 连翘 丹皮 天虫 生甘草 紫草茸 川连 炒楂 桔梗

银花 --- 银花汤煎，和入鸡冠血数滴。

紫草茸 --- 犀角 羚羊角 桔梗 炒楂 连翘 天虫 紫草茸 丹皮 石膏 银花 地丁 牛蒡 猪尾血 冰片

川连 --- 又（六朝） 虽血热毒重，犹幸八龄体坚，急清解活血，莫令痰阻废食，扶持堆沙，可望向安，照前方去石膏、地丁、天虫、牛蒡，加川连、玄参、土贝。

诃子皮 --- 人参 肉桂 炙草 丁香 厚朴 诃子皮 广皮 木香 前胡 茯苓

川芎 --- 桔梗 甘草 炒归 川芎 广皮 炒楂

归身 --- 人参 黄芪 炙草 紫茸 天虫 广皮 川芎 归身 厚朴 炒楂 加炒冬米

鹿茸 --- 孙（七朝） 色娇皮薄，浆汁未灌，缘身小痘多，气血交亏，不能运毒化浆，八九日期，最有痒塌之虑，扶过十二朝无变，庶几可望有成，进参归鹿茸汤法。

肉果 --- 又（八朝） 照前方加肉果炒冬米。

归身 --- 人参 黄芪 广皮 炙草 木香 鹿茸 归身 肉果 坎气 官桂

炒川贝 --- 炒川贝 炒银花 茯苓 苡仁 甘草 地骨皮

归身 --- 人参 黄芪 川芎 归身 木香 炙草 广皮 桂心

木香 --- 鲍（九朝） 浆不外达，毒欲内陷，已经切牙，滑泻呕恶，内症诸款，皆属深畏，十二十四，总属险关，痘子毒瓦斯，必气元旺，冀其托出，议以陈氏木香散，救里托毒。

诃子皮 --- 人参 木香 丁香 官桂 炒归身 厚朴 广皮 肉果 诃子皮

金石斛 --- 羚羊角 连翘 胆星 丹皮 炒银花 金石斛 茯苓

炒麦冬 --- 炒麦冬 白沙参 苡仁 川贝 炒银花 地骨皮

炒当归 --- 人参 鹿茸 炒当归 桂心 桂圆 煨木香

小生地 --- 连翘 小生地 当归 赤芍 刺蒺藜 丹皮 夏枯草 银花 酒半小杯

甘草梢 --- 桑白皮 大腹皮 绿豆皮 茯苓皮 飞滑石 生甘草梢

炒川贝 --- 炒川贝 茯苓 苡仁 车前 炒泽泻 炒银花

百合 --- 苡仁 川斛 茯苓 百合 广皮 炒泽泻

炒川贝 --- 地骨皮 甘草 生地炭 绿豆皮 炒丹皮 炒川贝 川斛

半夏曲 --- 人参 茯苓 炒芍 生谷芽 藿香 广皮 半夏曲

龙胆草 --- 川楝子 小茴 芦荟 山栀 橘红 龙胆草

鲜生地 --- <D>自古治痘名家，不啻廿数，各有精确卓识，以补前人之未备，虽各有所偏，实所以相济也，医者贵统汇群书，随宜施治，安可执偏隅管见，以应无穷之变哉，先生治痘，夙称神奇，观其案中，寒热攻补，不胶于一见，如毒火深伏，气血壅遏者，藉芳香以搜逐，用紫雪丹，气滞血凝，毒重火伏者，以酒大黄石膏青皮桃仁荆芥犀角猪尾血之类主治，肝肺毒火不宣，气血有焦燔之势者，用犀角羚羊紫草丹皮石膏鲜生地之类，元气不支，阳虚毒陷，而见灰白湿烂，泄泻呕恶等症者，用辛香温煦，如陈文仲之法为要，气血极虚，而浆清塌痒，全无实症相兼者，当峻补气血，用参归鹿茸汤，及坎气汤之类，气虚莫外乎保元及四君子，血虚不离于四物及补血汤，又有气虚血热者，补气之中兼凉血，血虚气滞者，补血之中佐辛香，用攻法须分部位经络，用补法当辨寒热燥湿，过清则有冰伏之虑，偏热则有液涸之虞，此皆先生采择先贤之法，因人见症而施治，可谓善法古者矣，夫痘虽以形色辨其吉凶，然内症尤为紧要，如痘点既起，或不慎风寒，而营卫凝涩，或纵恣饮食，而气机呆钝，以致身热不食，腹膨呕恶泄泻，浆水不行，不究治其病因，但执清寒腻补，常有凶危之变，亦有痘形虽重，若神宁安静，饮食二便如常，声音清响，调理得宜，亦可转危为安，大凡形老而色鲜明者，虽甚密，变幻恒少，形嫩而色晦滞者，虽稀疏，变幻恒多，表里相参，审症的确，然后设法处治，方无贻误，至于逆症条款已现，虽自昔名医，亦莫能挽救，小儿夭枉者，不可胜数，深可怜悯，迩年以来，幸有种痘一法，盛行于世，实可挽回造化，凡有小儿者，俟周岁后，即可选用种痘之苗，引而发之，百不失一，此诚补痘科之未备，而为最上一乘之法也，正痘有先贤诸成法，避险有种痘之良方，痘症于是乎大全矣。（陆履安）

黄连 --- 痘之发也，一由乎胎毒内伏，一由于外感时邪之气引导而出，其症之顺逆，若内毒轻而外感之气亦轻者，痘必稀疏，此为顺症，苦内毒轻，而外感之气重者，虑其遏闷不齐，不易灌浆，若能至灌浆，则时邪渐退，后易收功，此为先重后轻症，若内毒重，而外感之气轻者，虑其灌浆已后，毒难尽泄，不易收靥结痂，恐发痘毒疳蚀之患，此为先轻后重症，若内毒重而外感之气亦重者，痘必稠密，色不鲜泽，发热见点之后，一路蹭蹬，难以收功，此为逆症，然胎毒之轻重，人皆易明，若外感之气，人莫能晓，夫天地间，只有六气，气平则为和气，不平则有胜复，胜复至极，则为厉气，为瘟疫气，瘴气，更有道涂中秽浊气，人若感之，不拘老幼俱病，今出痘所感之气，则异乎是，此气独与未泄胎毒之小儿，两相感触，未闻痘症盛行之时，已出过痘之儿，亦染病患也，考是气，自古迄今，从未有人申帮助白，确定为何气，故前贤于痘症一科，未尝不殚心瘁虑，立论著方，因不明其气之源，不无偏执之弊，有喜于寒泻者，有喜于温托者，有先用寒泻，而后用温补者，有先用温托，而后用清火解毒者更有不审儿体之虚实寒热，俱宗费建中救偏琐言，每于发热见点时，概用大黄石膏黄连犀角羚羊茅根芦根等，不知费氏之书，名为救偏，乃救惯用热药之偏耳，若本不偏，而宗其法，则不偏者，反至偏矣，婴儿之命，其何以堪，幸古有种痘良法，相传至今，其法简易灵验，至稳至当，盖正痘因外感时邪而发，种痘则种于无病之时，故所出稀疏，轻者不过几十粒，此岂非避危就安之妙法乎，倘愚人不信，何不将自出与种出，彼此相较，其理自明，假使一村之中，有百儿出天花，未尝不延医服药，若能八九十收功，人咸称为太平痘矣，甚有竭力调治，而损伤几及一半者，不闻其归咎于医生，惟有委命于天而已，今若种百儿之痘，设或损伤四五个，则必责罚种师，并不容其托足于此一村矣，人何笃信医生，而不相信种师耶，与其委命于天，孰若以人功挽之，以此相较，则当种与不当种自决矣，至于种法，全在乎好苗夫，苗者，即取他儿之痘痂也，必要用种出之痘，落下之痂，谓之种苗，此苗之中，毫无天行时毒之气在内，故放心可用，若自出天花之痂，谓之时苗，此苗之中，有时行之气，若不辨而用之，名虽为种，实与传染他儿天行时痘之气无异，此时苗之不可用也，然种苗之内，尚要拣择，必取痘粒稀少，其色红润，灌浆厚厚，所结之痂，厚实光泽尖圆者，此气血充足，阴阳合德，上好之苗也，俟痂落下，用纸包好，记明何日收得，收贮新瓷瓶内，紧护其口，置清凉之处，勿触秽热之气，其苗在北方，天气凉，春月之苗，一月之内，尚可种，冬月之苗，四五十日尚可种，南方气温，夏月之苗四五日，春月之苗二十日，冬月之苗三十日，若延日久，则气薄无力，恐种不出矣，欲觅此等种苗，先访有人家正在种痘之际，向彼明言其故，恳求四五粒，即可源源而种，或平日于同道种师内，相与一二位志诚老实者，议明彼此互借，则苗亦可不断，亦有胆大种师，于五六月中，觅贫家壮实之儿种之，不惟不索酬谢，反肯津贴银钱，次递传种三四个儿，延至七月，则苗亦可以不断矣，近有种师，因种苗已断，权取时苗种之，往往有种出稠密棘手重痘者，皆时苗之过也，不知时苗之性，即选上好者，亦必要传种过四五儿俱各顺当者，其苗性始和平，方能与种苗相等，至于下手种法，尤须详慎，凡种一儿，用痘痂三四粒，两儿则用六七粒，放于干净茶杯中，倾入清水四五茶匙，用小指尖在内三四搅，则痂已湿，急将水倾去，用柳木杵研，其杵约长四寸，粗如笔管，两头要光圆，研十数转足矣，如痂太干，加入清水一二滴，切不可太潮，只要研如干浆糊状，用弹熟新棉花，捏一小团，如枣核大，两头要圆，其长短粗细，量儿鼻孔之大小为之，其棉团不可太松软，松则苗气易往外泄，且见涕则缩小，易于脱出，将棉团只用一头，蘸痂末糊于上，塞儿鼻中男左女右，塞不可太进太进则儿不适意，亦不可太出，太出则易于脱落，总要宽紧浅深适中为妙，塞后勿放小儿用手拈出，若被喷嚏打出，急将苗仍塞入鼻，下苗后，以六个时辰为度，天气热，早取出数刻，天气寒，多留数刻，痘苗取出之后，其苗气渐次传遍五脏，至七日，或八九日始发热，发热三日而见点矣，此诚至稳至当之种法也，种痘之苗，不过痘痂一味，今各处种师，诡称痘痂之外，尚要加他药为引导者，此系惑人谎语，切勿信之，既种后，将发热时，小儿颈项内，男左女右，必发一小块，状如痰核，此乃毒瓦斯结聚于此，故痘发必稀疏，此块不必医治，待落痂后，则块亦渐消矣，若用时苗种者，项中无块，当以此辨之，又间有惊痘，于发热时，小儿忽然惊搐，手足蜷，不语，目上视，有片时即平复者，有发一二个时辰者，有发一次者，有发两次者，总属不妨，斯时切不可扰动叫唤之，待其自平即已，不必服药，须预对痘家帮助，免其忧虑以上诸论，皆时下种师之秘诀也，若夫辨儿之可种与不可种，须察儿体之虚实，及有无宿病，若调治之法，当节饮食，适寒温，防惊吓，此皆种师俱各明悉，兹不重赘。（郑望颐）

大黄 --- 徐评 诸案切近，和平之中，又能沉着变化，备前人之所未备，去其疵而取其纯，我郡有如此名家，而不师法，偏拾庸妄人唾余，不论何人，不问虚实，总以石膏大黄种种恶毒之药，大剂灌死，每当出痘之年，枉死载道，全不知惨，此等恶医，皆有豺野狼之心也。</D>

益智仁 --- 益智仁 焦术 茯苓 广皮 藿香梗 厚朴 楂肉 泽泻

人参 --- 人参 茯苓 麦芽 炒楂肉 广皮 半夏 湖莲

甘蔗 --- 和入青甘蔗汁一酒杯。

胡黄连 --- 人参 黄连 芦荟 川楝子 使君子 茯苓 白芍 广皮 胡黄连 南山楂

益智仁 --- 焦术 茯苓 广皮 益智仁 大腹皮 木瓜 炮姜 炒神曲

炒白芍 --- 青蒿梗 枳实炭 胡黄连 炒谷芽 炒白芍 炒山楂 广皮 茯苓 泽泻