桂枝 --- 桂枝汤

附子 --- 桂枝加附子汤 即桂枝汤加附子。

蜀漆 --- 桂枝去芍药加蜀漆龙骨牡蛎救逆汤

生姜 --- 生姜泻心汤

甘草 --- 甘草泻心汤

半夏 --- 半夏泻心汤

附子 --- 附子泻心汤

黄芩 --- 黄芩汤

黄连 --- 黄连阿胶汤

旋覆花 --- 旋覆花代赭石汤

乌梅 --- 乌梅丸

人参 --- 白虎加人参汤 即白虎汤加人参。

竹叶 --- 竹叶石膏汤

白头翁 --- 白头翁汤

黄连 --- 大黄黄连泻心汤

猪肤 --- 猪肤汤

白蜜 --- 猪肤 白蜜 白粉

人参 --- 人参四逆汤即四逆汤加人参。

葱白 --- 通脉四逆汤 即四逆汤加葱白，更有随症加法。

猪胆汁 --- 通脉四逆加猪胆汁汤 即通脉四逆汤加猪胆汁。

猪胆汁 --- 白通加猪胆汁汤 即白通汤加猪胆汁人尿。

附子 --- 桂枝附子汤

吴茱萸 --- 吴茱萸汤

甘草 --- 麻黄杏仁甘草石膏汤

栀子 --- 栀子豉汤

桃仁 --- 桃仁承气汤

猪苓 --- 猪苓汤

泽泻 --- 牡蛎泽泻散

鳖甲 --- 鳖甲煎丸

芍药 --- 鳖甲 乌扇 黄芩 柴胡 鼠妇 干姜 大黄 芍药 桂枝 葶苈 石苇 厚朴 丹皮 瞿麦 紫威 半夏 人参 A2J5虫 阿胶 蜂窠 赤硝 蜣螂 桃仁 灶下灰 清酒

海藻 --- 千金方有海藻、大戟，无鼠妇、赤硝。

桂枝 --- 白虎加桂枝汤 即白虎汤加桂枝

牡蛎 --- 桂枝加龙骨牡蛎汤 即桂枝汤加龙骨、牡蛎。

酸枣仁 --- 酸枣仁汤

黄芪 --- 黄芪建中汤 即小建中汤加黄芪。

皂荚 --- 皂荚丸

皂荚 --- 皂荚 蜜丸

枣 --- 枣膏汤送。

麦门冬 --- 麦门冬汤

大枣 --- 葶苈大枣泻肺汤

苇茎 --- 千金苇茎汤

苇茎 --- 苇茎 苡仁 桃仁 瓜瓣

薤白 --- 瓜蒌薤白白酒汤

赤石脂 --- 赤石脂丸

赤石脂 --- 蜀椒 乌头 附子 炮姜 赤石脂

附子 --- 附子粳米汤

当归 --- 当归生姜羊肉汤

半夏 --- 甘遂半夏汤

木防己 --- 木防己汤

半夏 --- 小半夏汤

茯苓 --- 外台茯苓饮

白术 --- 茯苓 人参 白术 枳实 橘皮 生姜

甘草 --- 桂苓五味甘草汤

防己 --- 防己茯苓汤

半夏 --- 大半夏汤

大黄 --- 大黄牡丹汤

大黄 --- 大黄 丹皮 桃仁 瓜子 芒硝

当归 --- 当归建中汤即小建中汤加当归。

甘草 --- 甘草小麦大枣汤

旋覆花 --- 旋覆花汤

旋覆花 --- 旋覆花 葱 新绛

地黄 --- 六味地黄丸 即八味去桂附，煎服名六味地黄汤。

附子 --- 都气丸 即六味丸加北味，再加附子，名附都气丸。

石菖蒲 --- 熟地 山药 牛膝 枸杞 山萸 茯苓 杜仲 远志 五味子 楮实 小茴 巴戟 苁蓉 石菖蒲

楮实 --- 丹溪滋阴大补丸 即还少丹去楮实。

地黄 --- 黑地黄丸

当归 --- 熟地 虎胫骨 龟板 黄柏 知母 琐阳 当归 牛膝 白芍 陈皮 羯羊肉

麦冬 --- 紫河车 龟板 人参 熟地 天冬 麦冬 黄柏 牛膝 杜仲

人参 --- 人参固本丸

石菖蒲 --- 生地 人参 玄参 丹参 枣仁 远志 茯神 柏子仁 天冬 麦冬 当归 五味 桔梗 石菖蒲 辰砂

姜汁 --- 硫黄 硝石 石膏 半夏 姜汁糊丸

陈皮 --- 玄精石 硫黄 硝石 五灵脂 青皮 陈皮

半夏 --- 半夏 硫黄

白术 --- 参苓白术散

屏风 --- 玉屏风散

半夏 --- 六君子汤 即四君子加陈皮半夏。

陈皮 --- 异功散 即四君子汤加陈皮。

生姜 --- 四兽饮 即六君子汤加乌梅草果生姜大枣。

山药 --- 六神散 即四君子汤加山药扁豆姜枣煎。

豉 --- 葱豉汤

川芎 --- 川芎茶调散

防风 --- 防风通圣散

防风 --- 防风 荆芥 麻黄 连翘 薄荷 川芎 当归 白芍 白术 山栀 大黄 芒硝 黄芩 石膏 桔梗 甘草 滑石 姜 葱

熟地 --- 十味温胆汤 即温胆汤加人参远志枣仁熟地。

山栀 --- 本方加丹皮山栀，名加味逍遥散。

藿香 --- 藿香正气散

半夏曲 --- 藿香 紫苏 白芷 大腹皮 茯苓 白术 陈皮 半夏曲 厚朴 桔梗 甘草 姜 枣

苍术 --- 香附 苍术 川芎 神曲 山栀

人参 --- 人参养荣汤

当归 --- 人参 茯苓 白术 甘草 当归 白芍 熟地 黄芪 肉桂 五味 远志 陈皮 加姜、枣。

地黄 --- 犀角地黄汤

地黄 --- 地黄饮子

附子 --- 熟地 巴戟 山萸 苁蓉 附子 官桂 石斛 茯苓 菖蒲 远志 麦冬 五味

川乌 --- 川乌 草乌 胆星 地龙 乳香 没药

附子 --- 附子理中汤 即理中汤加附子。

甘草 --- 理中安蛔丸 即理中汤去甘草，加茯苓、川椒、乌梅。

黄连 --- 连理汤 即理中汤加黄连茯苓。

陈皮 --- 治中汤 即理中汤加青皮陈皮。

当归 --- 人参 黄芪 白术 苍术 青皮 陈皮 神曲 甘草 麦冬 五味 当归 黄柏 泽泻 升麻 葛根 加姜枣

甘草 --- 滑石 甘草 辰砂

附子 --- 加味肾气丸 即六味丸加附子、肉桂、车前、牛膝。

郁李仁 --- 黑牵牛 大黄 甘遂 芒硝 郁李仁 木香

萆薢 --- 萆薢厘清饮

甘草梢 --- 川萆薢 石菖蒲 乌药 益智仁 甘草梢 食盐 茯苓

牵牛 --- 黑牵牛 茴香

木香 --- 姜汁调或加木香。

琥珀 --- 仙加琥珀沉香。

当归 --- 当归 升麻 桃仁 红花 甘草 生地 熟地

苍术 --- 白虎加苍术汤 即白虎汤加苍术。

当归 --- 当归龙荟丸

龙胆草 --- 当归 龙胆草 山栀 黄连 黄柏 黄芩 大黄 青黛 芦荟 木香 麝香

姜 --- 蜜丸，姜汤下。

白术 --- 滑石 石膏 寒水石 甘草 白术 茯苓 泽泻猪苓 肉桂

人参 --- 每服五钱，张子和去猪苓，减三石一半，加人参干葛藿香木香，亦名桂苓甘露饮。

甘草梢 --- 生地 木通 甘草梢 淡竹叶

羚羊角 --- 黄金 寒水石 石膏 滑石 磁石 升麻 玄参 甘草 犀角 羚羊角 沉香 木香 丁香 朴硝 硝石 辰砂 麝香

黄芩 --- 青礞石 沉香 大黄 黄芩 焰硝

郁金 --- 白矾 郁金

白术 --- 白术 枳实 橘皮 半夏

半夏 --- 山楂 神曲 茯苓 半夏 陈皮 卜子 连翘

石菖蒲 --- 人参 茯神 远志 石菖蒲 桑螵蛸 龙骨 龟板 当归

阿胶 --- 胶艾四物汤 即四物汤加阿胶艾叶。

柏子仁 --- 柏子仁丸

白蜜 --- 熬膏，白蜜收。

玉女 --- 玉女煎

肉桂 --- 或加肉桂。

附子 --- 人参 制附子

附子 --- 黄芪 制附子

生姜 --- 加生姜。

鹿角 --- 以上药同鹿角熬成膏，加入炼蜜，调入后药末，杵合为丸。

半夏 --- 秫米半夏汤

半夏 --- 秫米 半夏

诃子肉 --- 陈皮 青皮 诃子肉 炙草 丁香

木香 --- 木香 胡椒 干蝎 巴豆

甘草 --- 麻黄 苏子 桑皮 杏仁 赤苓 橘红 甘草

胡芦巴 --- 附子 肉桂 川乌 川椒 巴戟 菟丝子 破故 赤石脂 远志 茯神 茯苓 苍术 山茱萸 杜仲 胡芦巴 石斛 韭子 小茴 苁蓉 柏子仁 川楝子 鹿茸 青盐 山药

白术 --- 白术 苦参 牡蛎 猪肚一具

茯苓 --- 茯苓 猪苓 黄蜡

茜草根 --- 乌鲗鱼骨 A2J9茹（即茜草根） 雀卵

赤小豆 --- 大黑豆 赤小豆 绿豆

甘草 --- 甘草水煮。

黄连 --- 黄连 黄芩 山栀 郁金 辰砂 西牛黄

黄连 --- 进退黄连汤

黄连 --- 上进法，用本方六味，不制，水三茶钟，煎减半，温服，退法，桂枝不用，黄连减半，或加肉桂五分，如上制，煎服。

当归 --- 当归桂枝汤 即桂枝汤加当归。

茯苓 --- 茯苓桂枝汤即桂枝汤加茯苓。

当归 --- 参归桂枝汤即桂枝汤加人参、当归。

人参 --- 人参建中汤即建中汤加人参。

黄芪 --- 参芪建中汤即建中汤加人参、黄芪。

当归 --- 归芪建中汤即建中汤加当归、黄芪。

吴萸 --- 吴萸理中汤即理中汤加吴萸。

人参 --- 人参温胆汤即温胆汤加人参。

黄连 --- 黄连温胆汤即温胆汤加黄连。

白附子 --- 星附六君子汤 即六君子汤加制南星白附子。

人参 --- 养营汤即人参养营汤。

山药 --- 六神汤即陈无择六神散。即四君子加山药扁豆。

白芍 --- 戊己汤即四君子汤加陈皮白芍。

姜 --- 苓姜术桂汤只此四味。

白芥子 --- 五子五皮汤即五皮饮加杏仁苏子葶苈白芥子卜子。

川黄连 --- 人参 白术（土炒） 苡仁（各三两） 山楂肉 神曲 橘红（各二两） 扁豆 莲肉 厚朴（各一两） 山药 茯苓 麦芽 芡实（各一两半） 桔梗 甘草（炙） 藿香（各五钱） 泽泻 川黄连 白豆蔻（各三钱半）

淡姜 --- 上制为末，炼蜜丸每丸重二钱，每服一丸，醉饱后二丸，细嚼淡姜汤下。

沙苑蒺藜 --- 黄鱼螵胶（一斤切碎蛤粉炒） 沙苑蒺藜（八两马乳浸隔汤煮一炷香）

附子 --- 羌活 川芎 三棱 蓬术 白蔻 白蒺 陈皮 青皮 木香 大茴（炒） 牛膝 当归 炮姜 附子（炮） 肉桂（各五钱）

桐子 --- 上制为末，入前药拌匀，神曲糊为丸，如桐子大，食前或温酒或白汤送下三十丸至五十丸，最要忌盐，一毫不可入口，否则病发愈甚，日三服，兼用温和调补药助之，此方又名大针砂丸。

附子 --- 此方去附子蓬术青皮加茯苓，叶氏名针砂丸。

生香附 --- 白术（二两） 茯苓（一两） 陈皮（一两） 熟半夏（一两） 甘草（三钱） 神曲（炒一两） 生香附（一两半） 苦参（炒五钱） 黄连（炒五钱） 针砂（醋炒红研如飞面一两半）

白术 --- 为末，醋水各半，打神曲糊为丸桐子大，每服七八十丸，白术六钱陈皮一钱生姜一片煎汤下，虚甚者加人参一钱，本方去黄连加厚朴半两，忌口，病轻服至六七两，小便长甚者服一斤，小便始长。

巴戟肉 --- 人参 莲肉（炒） 山萸（烘） 山药（炒各一斤） 五味子（蜜蒸） 菟丝子（各一斤半） 橘红 砂仁（炒各六两） 车前子（米泔洗） 巴戟肉（甘草汁煮各十二两） 肉豆蔻（十两） 补骨脂（盐水浸二日炒一斤）

补骨脂 --- 上为末，炼蜜丸，如虚而有火者，或火盛肺热者，去人参肉豆蔻巴戟补骨脂，忌羊肉羊血。

白蔻仁 --- 阿魏（七钱） 鳖甲（二两） 黄芪 广皮 枳实 柴胡 白术（各一两） 青皮 草果 黄芩 当归 茯苓（各八钱） 白蔻仁（七钱） 山楂（一两） 神曲（一两） 延胡

胡黄连 --- 阿魏 连翘 胡黄连 山楂 青皮 山棱 蓬术 陈皮 半夏 麦芽 厚朴 莱菔子 甘草

朱砂 --- 朱砂（五钱研） 芦荟（七钱研）

熟地 --- 济生肾气丸 即八味丸加车前牛膝，叶氏用茯苓八两为君，熟地只用四两，又薛氏济生丸分量不同。

瓜蒌实 --- 蛤粉 瓜蒌实 杏仁（各一两） 广皮 紫苏（各二两） 白术 土贝母（各四两） 紫菀 （三两） 木香（五钱）

葱白 --- 葱白丸

川楝子 --- 熟地（四两） 白芍 当归 川楝子 茯苓（各二两） 川芎 枳壳 厚朴 青皮 神曲 麦芽（各一两半） 三棱 蓬术（各一两） 干姜 大茴 木香（各七钱） 肉桂（五钱）

葱白 --- 用葱白汁丸。

葱白 --- 用葱白汁丸。

川楝子 --- 乌梅 川椒 附子 桂枝 干姜（各一两） 黄柏（二两） 黄连（五钱） 川楝子肉 广皮 青皮（各二两） 白芍（三两） 人参（量加如有邪者可勿用）

当归 --- 再用川椒乌梅汤法丸，一方无广皮，有当归细辛。

巴豆 --- 巴豆（三百十五粒去皮心膜炒熟研如面） 牛黄（研） 龙脑（研） 麝香（研） 轻粉（研各三两） 朱砂（研飞九两） 真金箔（九十片）

白蜜 --- 上各研匀，炼黄蜡六两，入白蜜三分同炼，匀为丸，每两作三十丸。

天冬 --- 天冬 瓜蒌霜 海浮石 蛤粉 风化硝 桔梗 橘红 香附 竹沥 姜汁

菟丝 --- 又景岳新方苓术菟丝丸。

当归 --- 局方龙荟丸即当归龙荟丸。

大豆黄卷 --- 白蒺藜丸 即一味。用山栀汤制为丸。用大豆黄卷汤送下。

禹粮石 --- 禹粮石脂丸 即二味为丸。

益母草 --- 益母丸 此方不一，总用益母草膏为君，有加四物香附山楂者，有去山楂加阿胶者，有加八珍香附砂仁楂肉者。

金铃子 --- 金铃子散

虎杖 --- 虎杖散

虎杖 --- 杜牛膝根汁（二三两，古方本用虎杖草汁，今人不识此草，故以土牛膝根汁，代之） 当门子麝香（一分，研）

葛 --- 葛可久花蕊石散

童便 --- 煅存性，研如粉，以童便一盏，男人入酒少许，女人入醋少许，煎温食后调服三钱，甚者五钱，能使瘀血化为黄水，后用独参汤补之。

当归 --- 归芍异功散即异功散加当归、白芍。

牛蒡子 --- 鸡鸣散牛蒡子（炒香，研细，临服加入雄鸡冠血五匙、状元红酒少许，调匀，以炒荆芥三分煎汤送。）

防风 --- 通圣散即防风通圣散。

当归 --- 归芪异功散即异功散加当归、黄芪。

木香 --- 香砂异功散即异功散加木香砂仁。

藿香 --- 正气散 即藿香正气散。

皂荚 --- 好硫黄八两，配真麻油八两，以硫打碎，入冷油内炖炉上，炭火宜微勿烈，以桑条徐调，候硫溶尽，即倾入大水内，急搀去上面油水，其色如金，取缸底净硫，称见若干两，仍配香麻油若干两，照前火候再溶再倾，连前共三转，第四转用真棉花核油配硫若干两，照前火候再溶，再倾入大水内，搀去上面油水，其色如绛，第五转用肥皂四两，水中同煮六时，第六转用皂荚四两，水中同煮六时，拔净制硫之油，搀去其水，其色如硫火之紫，第七转用炉中炭灰淋碱水制六时，第八转用水豆腐制六时，拔净皂碱之性，第九转用田字草（出水荒稻田中，其叶如田字，八九月采）捣汁，和水煮六时，临用研如飞面，凡净硫一两，配炒糯米粉二两，或水法或湿捣为丸，每服以硫三分为准，渐加至一钱止，开水温下。

大黄 --- 大黑豆（三升用水浸取壳用绢袋盛壳用豆煮熟去豆不用将壳晒干其汁留用） 红花（三两炒黄色入好酒四碗煎十余滚去渣存汁听用） 苏木（三两河水五碗煎汁三碗听用） 大黄（一斤为末） 陈米醋（九斤）

大黄 --- 上将大黄末一斤，入净锅，下醋三斤，文火熬，用长木筋不住手搅之，将成膏，再加醋三斤熬之，又加醋三斤，次第加毕，然后下黑豆汁三碗，次下苏木汁，次下红花汁，熬成大黄膏，取入瓦盆盛之，大黄锅焦亦铲下，入后药同磨。

益母草 --- 人参（二两） 川芎 当归 熟地 茯苓 香附 延胡 苍术（米泔浸炒） 桃仁 蒲黄（各一两） 乌药（二两半） 牛膝 地榆 橘红 白芍 羌活 炙草 五灵脂 山萸 三棱（各五钱） 良姜 木香（各四钱） 木瓜 青皮 白术（各三钱） 益母草（二两） 乳香 没药（各二钱） 马鞭草（五钱） 秋葵子（三钱）

益母草 --- 上三十味，并前黑豆壳共晒干为细末，入石臼内，下大黄膏，再下炼熟蜜一斤，共捣千捶为丸，每丸重二钱七分，静室阴干二十余日，不可烘晒，干后止重二钱，外以蜡作壳护之，用时去蜡调服，一方无益母草马鞭草秋葵子三味，并不用蜜，醋止用八碗。

犀角 --- 犀角（镑） 朱砂（研水飞） 雄黄（研水飞） 琥珀（研） 玳瑁（各一两镑） 水安息香 （一两无灰酒熬成膏如无以旱安息香代之） 西牛黄（五钱） 麝香（一钱） 龙脑（一钱） 金银箔（各五十片）

广木香 --- 牛黄 冰片 狗宝 鸦片（各六分） 广木香（二两）

人乳 --- 上为末，人乳丸，重五厘，金箔为衣。

盐 --- 上四味作小块，入净锅中，盐泥封固，候干，用炭十斤煅，炭尽为度，入地出火气，必得二昼夜，研细末。

朱砂 --- 乳香（二两） 没药（二两） 朱砂（水飞一两） 五灵脂（二两）

姜 --- 露姜饮

益智仁 --- 香附（一两二钱） 丁香皮（一两二钱） 甘松（八钱） 益智仁（六钱） 砂仁（二钱） 蓬术（二钱） 广皮（二钱）

清阿胶 --- 阿胶鸡子黄汤（非黄连阿胶汤） 河间中满分消汤 清阿胶丸 蠲痛丹 香连饮 以上五方俟考。

泽泻 --- <D>按先生虽善用古方，然但取其法，而并不胶柱，观其加减之妙，如复脉建中泻心等类，至用牡蛎泽泻散，只取此二味，故案中有但书用某方，而不开明药味者，决非尽用板方，必有加减之处，观者以意会之可也，论中所述诸方开列于后以便查阅。</D>

芍药 --- 麻黄人参芍药汤

甘草 --- 甘草汤

甘草 --- 生姜甘草汤

当归 --- 调中益气汤 即补中益气汤去当归、白术，加木香、苍术。

姜 --- 每服三钱，加姜枣煎。

黄连 --- 桂枝黄连汤 即仲景黄连汤。

熟附子 --- 干姜 肉桂心 熟附子 炙草 枳实 厚朴（各二两） 大黄（四钱）

生姜 --- 橘皮 生姜

竹茹 --- 橘皮竹茹汤

人参 --- 橘皮 竹茹 大枣 生姜 甘草 人参

姜半夏 --- 生姜半夏汤

生姜 --- 半夏 生姜汁

苍术 --- 苍术石膏汤

兰草 --- 兰草汤

兰草 --- 兰草（即省头草），水煎服。

芍药 --- 洁古芍药汤

葛根 --- 葛根芩连汤

白术 --- 茅术理中汤 即理中汤白术换茅术。

厚朴 --- 厚朴三物汤

厚朴 --- 厚朴温中汤

大黄 --- 大黄 桃仁 A2J5虫

片姜黄 --- 赤芍 海桐皮 当归 白术（各钱半） 片姜黄（二钱） 羌活 炙草（各一钱）

姜 --- 水姜煎，去渣，磨入沉香汁少许，食前服。

防风 --- 通气防风汤

防风 --- 柴胡 升麻 黄芪（各一钱） 防风 陈皮 羌活 人参 甘草（各五分） 藁本 青皮（各三分） 蔻仁（二分） 黄柏（一分）

玄参 --- 玄参升麻汤

防风 --- 玄参 升麻 僵蚕 牛蒡 连翘 防风 黄芩 黄连 桔梗 甘草

茵陈 --- 茵陈四逆汤

白蜜 --- 酒酿白蜜同炼捣丸，米饮送。

黄连 --- 黄连竹茹橘皮半夏汤

黄连 --- 黄连 竹茹 橘皮 半夏

鹿角胶 --- 熟地 山药 枸杞 山萸 牛膝 菟丝子 鹿角胶 龟胶

鹿角胶 --- 熟地 山药 枸杞 山萸 菟丝子 鹿角胶 杜仲 当归 肉桂 附子

柏子仁 --- 柏子仁丸

麻黄根 --- 柏子仁 人参 白术 半夏 北味 牡蛎 麻黄根 麦麸

枣 --- 枣肉丸。

郁李仁 --- 火麻仁 郁李仁 柏子仁 松子仁 桃仁

茯苓 --- 指迷丸 茯苓丸 即指迷茯苓丸。

甘草 --- 滑石 甘草 红曲

白术 --- 苏合香 安息香 犀角 冰片 射香 香附 木香 薰陆香 沉香 丁香 白术

朱砂 --- 炼蜜丸，朱砂为衣，外作蜡丸。

朱砂 --- 朱砂 真珠 雄黄 水银 黑铅

朱砂 --- 朱砂安神丸

人参 --- 人参丸

枣 --- 枣肉丸。

五味子 --- 酒糊丸，或加五味子。

菟丝 --- 苓术菟丝丸

北五味 --- 牡蛎 菟丝子 韭子 龙骨 北五味 桑螵蛸 白石脂 茯苓

韭子 --- 家韭子丸

肉苁蓉 --- 家韭子 鹿茸 肉苁蓉 牛膝 菟丝子 熟地 当归 巴戟 杜仲 石斛 肉桂 炮姜

蛇床子 --- 乌骨雄鸡（一只） 乌药 蛇床子 丹皮 白术 人参 黄芪（各一两） 茅术（米泔浸一两半） 海桐皮 红花 白芍 肉桂 附子（炮） 川乌（炮） 莪术 陈皮（各二两） 熟地（洗焙） 延胡 木香 肉果 草果 琥珀（各五钱）

桐子 --- 上细锉，以乌鸡汤挦去毛及肠杂，将上药纳鸡肚内，用新瓷瓶以好酒一斗同煮令干，去鸡骨，以油单盛焙干为末，炼蜜和丸如桐子大，每服三十丸，随症用汤引下。

防风 --- 菊花 白术 防风 桔梗 黄芩 细辛 茯苓 牡蛎 人参 矾石 当归 干姜 川芎 桂枝

砂仁 --- 鸡内金 沉香 砂仁 陈香橼皮

六一散 --- 天水散即六一散。

人参 --- 人参败毒散

瓜蒂 --- 瓜蒂散

苍耳 --- 苍耳散

白芷 --- 白芷 薄荷 辛夷 苍耳

猪牙皂 --- 雄黄 猪牙皂荚 藜芦

童便 --- 研细，泥封煅赤，服一钱，童便下。

当归 --- 白芷 陈皮 厚朴 当归 川芎 芍药 茯苓 桔梗 苍术 枳壳 半夏 麻黄 干姜 肉桂 甘草 姜 葱

郁金 --- 牛黄（二钱半） 朱砂 郁金 丹皮（各三钱） 冰片（一钱） 甘草（一钱）

当归 --- 当归 五灵脂 川芎 良姜 熟地（各二两、锉碎入砂锅内，纸筋盐泥固济，火煅过） 百草霜（一两） 硫黄 乳香（各二钱） 琥珀 花蕊石（各一钱）

生姜 --- 上为细末，醋糊丸如弹子大，每用一二丸，炭火煅红，投入生姜自然汁浸碎，以童便合酒，调灌下。

熟地 --- 熟地 山药 枸杞 炙草 茯苓 山萸

附子 --- 右归饮 即左归饮去茯苓，加杜仲肉桂附子。

熟地 --- 熟地 茯苓 扁豆 炮姜 丁香 藿香 炙草 陈皮

肉豆蔻 --- 六柱饮 即四柱饮加肉豆蔻诃子。

乌药 --- 乌药 沉香 槟榔 枳实 木香

白酒 --- 白酒磨服。

板蓝根 --- 黄芩 黄连 陈皮 甘草 玄参 连翘 板蓝根 牛蒡 薄荷 僵蚕 升麻 柴胡 桔梗 马勃

人参 --- 或加人参。便闭加大黄。

莲子 --- 清心莲子饮

菟丝子 --- 人参 熟地 山药 山萸 远志 炙草 五味 菟丝子