徐（三三） 肝脾郁损，血崩。（郁损肝脾）

人参逍遥散去柴、术、炙草，加桑螵蛸、杜仲。

某 经漏不止，久风飧泄。（肝风胃虚）

人参 茯苓 木瓜 炒乌梅 赤石脂 余粮石

龚 脉数，寒热汗出，腹胁痛，病起经漏崩淋之后，是阴伤阳乘，消渴喜凉饮，不可纯以外邪论，和营卫调中，甘缓主治。（营阴伤脏燥热）

当归 白芍 淮小麦 炙草 南枣 茯神

文（五五） 产育频多，冲任脉虚，天癸当止之年，有紫黑血如豚肝，暴下之后，黄水绵绵不断，三年来所服归脾益气，但调脾胃补虚，未尝齿及奇经为病，论女科冲脉即是血海，今紫黑成块，几月一下，必积贮之血，久而瘀浊，有不得不下之理，此属奇经络病，与脏腑无异，考古云，久崩久带，宜清宜通，仿此为法。（奇脉虚血滞）

柏子仁 细生地 青蒿根 淡黄芩 泽兰 樗根皮

接服斑龙丸。

张（五十） 五旬天癸当止，而经淋周身牵掣，右肢渐不能举，不但冲任督带损伤，阳明胃脉衰微少气，乃最难向安之病。（冲任胃皆虚）

人参 生黄芪 炙草 炒沙苑 炒杞子 炒归身

朱 崩漏两年，先有带下，始而半月发病，今夏季，每交申酉，其漏必至，思下午为阳中之阴，阴虚阳动，冲脉任脉皆动，下无提防约束，夫奇经，肝肾主司为多，而冲脉隶于阳明，阳明久虚，脉不固摄，有开无阖矣，医但以涩剂图旦夕苟安，未及按经论病，宜毫无一效。

海螵蛸 鲍鱼 茜草 生菟丝子 石壳广莲肉

接服乌贼鱼骨丸。

顾 髓虚，崩淋不止，筋掣痛，不能行。（髓虚筋痛）

成 冲任二脉损伤，经漏经年不痊，形瘦肤干畏冷，由阴气走乎阳位，益气以培生阳，温摄以固下真。（冲任阳虚）

人参 鹿角霜 归身 蕲艾炭 茯神 炮姜 紫石英 桂心

张（四三） 经漏十二年，五液皆涸，冲任不用，冬令稍安，夏季病加，心摇动，腹中热，腰膝跗骨皆热，此皆枯槁日着，方书谓暴崩宜温，久崩宜清，以血去阴耗耳。（冲任阴虚）

蜜丸。

张 固补冲任，凉肝宁血。

（丸方） 人参（二两） 生地（二两） 阿胶（二两） 白芍（二两） 茯苓（二两） 鲜河车胶（一两） 石壳建莲肉（四两）

二胶如少，可加蒸熟山药捣浆为丸，早服四钱，参汤送，晚服二钱。

沈 天癸当止之年，经来淋漓不断，乃阴衰阳动，入秋深，夜寐甚少，汗泄四肢胸臆，夫冲脉隶于阳明，其气行乎身前，阳明脉空，阳越卫疏，阴火升举，当宗丹溪补阴丸，或虎潜丸之属，久病投汤太过，恐妨胃耳，每早服丹溪补阴丸四钱，十服。

黄 长斋有年，脾胃久虚，疟由四末，必犯中宫，血海隶于阳明，苦味辛散，皆伤胃系，虽天癸久绝，病邪药味，扰动血络，是为暴崩欲脱，阅医童便阿胶味咸润滑，大便溏泻，岂宜润下，即熟地五味补敛阴液，咽汤停脘，顷欲吐净，滋腻酸浊之药，下焦未得其益，脘中先已受戕，议以仲景理中汤，血脱有益气之法，坤土阳和旋转，喜其中流砥柱，倘得知味纳谷，是为转机，重症之尤，勿得忽视。（苦寒辛散伤中阳）

理中汤。

某 停经三月，下漏成块，少腹膨痛，议通和奇脉。（奇脉不和）

鹿角霜 生杜仲 桂枝木 生沙苑 当归 茯苓 红枣

罗（二四） 病属下焦，肝肾内损，延及冲任奇脉，遂至经漏淋漓，腰脊痿弱，脉络交空，有终身不得孕育之事。（肝肾冲任虚寒）

制熟地（砂仁制） 河车胶 当归 白芍 人参 茯苓 于术 炙草 蕲艾炭 香附 小茴 紫石英

陈（五十） 五旬年岁，经漏如崩，继以白带绵绵，昔形充，今瘦损，当年饮酒湿胜，大便久溏，自病经年，便干不爽，夜热多汗，四肢皆冷，气短腹鸣，上噫气，下泄气，腰足跗酸软无力，食物日减，不知其味，此阳明脉衰，厥阴风木由乎血去液伤，冲任交损，内风旋转而为风消之象，病在乎络，故令久延，金匮谓络热则痿矣。（液伤络热风消）

滤清人参汤收。

张 外冷内热，食过如饥，唇燥裂，渴饮下漏，漏多则阴虚阳亢，便溏不实，不可寒润。（阴虚阳亢）

生地炭 阿胶 炒白芍 湖莲 樗根皮 茯神 蕲艾炭

胡 心痛如饥，口吐腻涎浊沫，值经来甚多，因惊动肝，阳化内风，欲厥之象，治以咸苦，佐以微辛，使入阴和阳。

阿胶（二钱） 牡蛎（三钱） 川楝子（一钱） 小川连（三分） 川芎（二分） 当归（一钱）

邱（四四） 经漏成带，年余医疗无功，乃冲任督带交病，古称久带久崩宜清，视其体丰松软，阳气久亏，与内经血脱方法。

乌鲗鱼丸，鲍鱼汁丸。

某 经漏三年，诊色脉俱夺，面浮跗肿，肌乏华色，纳谷日减，便坚不爽，自脊膂腰髀酸楚如堕，入夏以来，形神日羸，思经水必诸路之血，贮于血海而下，其不致崩决淋漓者，任脉为之担任，带脉为之约束，刚维跷脉之拥护，督脉以总督其统摄，今者但以冲脉之动而血下，诸脉皆失其司，症固是虚，日饵补阳不应，未达奇经之理耳，考内经于胸胁支满妨食，时时前后血，特制乌鲗丸，咸味就下，通以济涩，更以秽浊气味为之导引，同气相需，后贤谓暴崩暴漏，宜温宜补，久漏久崩，宜清宜通，正与圣经相符，况乎芪术皆守，不能入奇脉，无病用之，诚是好药，借以调病，焉克有济，夏之月，大气正在泄越，脾胃主令，岁气天和，保之最要，议以早进通阴以理奇经，午余天热气泄，必加烦倦，随用清暑益气之剂，顺天之气，以扶生生，安稳百日，秋半收肃令行，可望其藏聚气交，而奇络渐固，此久损难复，非幸试速功矣。（奇脉阴虚风阳动）

早上汤药议以通阴潜阳方法，早服。

龟甲心（秋石水浸） 鹿角霜 真阿胶 柏子霜 生牡蛎 锁阳

另煎清人参汤入清药，煎取五十沸。

鹿性阳，入督脉，龟体阴，走任脉，阿胶得济水沉伏，味咸色黑，熄肝风，养肾水，柏子芳香滑润，养血理燥，牡蛎去湿消肿，咸固下，仲景云，病患腰以下肿者，牡蛎泽泻汤，锁阳固下焦之阳气，乃治八脉之大意，乌鲗丸方。

乌鲗骨四分（米醋炙去甲另研水飞） 芦茹（一分）

上为细末，用雀卵量捣为丸，每服三钱，用药前先饮淡鲍鱼汤一小杯为导引。

龟甲心（照前制） 真阿胶 柏子霜 天冬 女真实 旱莲草

另煎人参汤二钱，加入滤清药内，再煎五十余沸。

龟甲心 真阿胶 人参 桑螵蛸 生白龙骨 旱莲草 茯神 知母

早上服。

人参 熟地 阿胶 川芎 当归 白芍 南山楂 蕲艾

早上服。

人参 生地 天冬 阿胶 生白芍 女贞子 旱莲膏 地榆

早上服。

人参 阿胶 白芍 生地 旱莲膏 女贞子 桑寄生 咸秋石 细子芩 三角胡麻

药末，胶膏，再加熟蜜三两，捣千余杵，丸宜细光，早上服四钱，小暑至处暑，生脉散送。

人参 生地 阿胶 白芍 茯神 女贞子 旱莲膏 小黑稆豆皮

早上服。（初十日）

人参 生地 阿胶 龟甲心 生牡蛎 天冬 黑壳建莲

卢 停经半载，雨水节后，忽然暴崩，交春分节血止，黄白淋漓自下，寒则周身拘束，热时烦燥口干，晡至天明，汗出乃止，寐必身麻如虫行，四肢骨节皆痛，盖血既大去，冲任之脉伤损，而为寒为热，阴损及乎阳位矣，书云，崩中日久为白滞，漏下多时骨髓枯，由脂液荡尽，致形骸枯槁，延为瘵疾矣，天热气暖，所当谨慎。

乌贼骨 阿胶 生地 生白芍 茜草 小麦

程 暴冷阳微后崩。（阳虚）

附子理中汤。

<D>崩如山冢崒崩，言其血之横决莫制也，漏如漏卮难塞，言其血之漫无关防也，经云，阴在内，阳之守也，气得之以和，神得之以安，毛发得之以润，经脉得之以行，身形之中，不可斯须离也，去血过多，则诸病丛生矣，原其致病之由，有因冲任不能摄血者，有因肝不藏血者，有因脾不统血者，有因热在下焦，迫血妄行者，有因元气大虚，不能收敛其血者，又有瘀血内阻，新血不能归经而下者，医者根据此类推，仿叶氏用笔灵活，于崩漏治法，无余蕴矣。（秦天一）

徐评 崩漏必用补血大剂，而兼黑色之药，大概轻剂不能中病。</D>