秦（十七） 经停三月，无寒热，诊脉大，系恶阻减食。（恶阻）

细子芩 知母 苏梗 砂仁 橘红 当归 生白芍

（丸方） 细子芩（三两） 苏梗（一两生研） 砂仁（五钱） 白芍（一两半） 熟白术（二两） 当归（一两半）

青苎汤法丸。

某 怀妊将三月，肝气攻冲，胁痞，呕吐红痰。（肝气）

细条芩 生白芍 川楝子 瓜蒌皮 半夏曲 橘红 竹茹 生姜

程（二六） 殒胎每三月，是肝虚。（肝虚滑胎）

钱（三九） 上年夏产，过月经转，今经停四个月，左脉弦滑流动，乃为妊象，此气急脘痞咳嗽，热气上乘，迫肺之征，形肉日瘦，热能烁阴耗气，议清金平气，勿碍于下。（热伤肺阴）

杨 血液仅仅养胎，春阳升举，上焦易燥，喉呛心嘈，皆液亏阳亢。

谢 始而热入阴伤，少腹痛，溺不爽，秋暑再伤，霍乱继起，今不饥不食，全是胃病，况怀妊五月，胎气正吸脾胃真气，津液重伤，致令咳逆。（胃虚咳逆）

人参 知母 炒麦冬 木瓜 莲子肉 茯神

金 怀妊五月得热病，久伤阴液，身中阳气，有升无降，耳窍失聪，便难艰涩，议用仲景复脉法，以生津液。（热邪伤阴）

炙甘草 人参 生地炭 阿胶 天冬 麦冬 生白芍 麻仁

某 怀妊百日，丙丁养胎，胎热，从戌亥时升，耳前赤痱刺痛，当养阴制火。

某 脉右虚左弦，身麻肢冷，胎冲胀闷，五六月当脾胃司胎，厥阴内风暗动，不饥吞酸，全属中虚。（肝风犯脾胃）

胡 怀妊六月，阳明司胎，闪动络脉，环跳痛连腰膂，最防胎气。（闪动络脉）

归身 桂枝木 炒杞子 炙草 羊胫骨 白茯苓

某 气逆壅热于上，龈肿喉痹，胸闷腹肿，七月太阴司胎，法宜宣化清上。（热壅上焦）

汪 娠八月，胎动不安，脘闷不饥，宜凉血调气，可以安适。（气滞血热）

程 娠八月，形寒气逆，神烦倦无寐，乃肝阳乘中之征，拟进熄风和阳法。（肝风）

熟首乌 炒黑杞子 白芍 女贞子 茯神 黑稆豆皮

王 先寒后热，咳呛，是春月风温肺病，风为阳邪，温渐变热，客气着人，即曰时气，怀妊九月，足少阴肾脉养胎，上受热气，肺痹喘急，消渴胸满，便溺不爽，皆肺与大肠为表里之现症，状若绘矣，芎归辛温，参术守补，肉桂沉香辛热，皆胎前忌用，致大热烦闷，势属危殆，议以清肺之急，润肺之燥，俾胎得凉则安，去病身安，自为不补之补，古人先治其实，实者邪也。（热伤肺阴）

泡淡黄芩 知母 鲜生地 花粉 阿胶 天冬

复脉去桂、麻、姜、枣，加天冬、知母、子芩。

朱 脉右涩小数，左弦促，纳食脘胀，常有甘酸浊味，微呕吐清涎，旬朝始一更衣，仍不通爽，询知病起情怀抑郁，由气郁化热，如内经五志过极，皆从火化，就怀妊恶阻，按徐之才逐月安养，亦在足少阳经，正取清热养胎，况肝胆相火内寄，非凉剂无以和平，古人治病，以偏救偏，幸勿畏虚以贻患。（郁热）

金石斛 黑山栀 茯苓 半夏曲 橘红 竹茹 枳实

某 恶阻，本欲恶心厌食，今夹时邪，头痛身热，当先清热。（时邪发热）

某 交节上吐下泻，况胎动不安，脉虚唇白，急用理中法。（吐泻伤热阳）

周 病中怀妊泄泻。（泄泻）

焦术 炒白芍 炒黄芩 炒广皮

金 怀妊若患时症，古人重在保胎，今者喜暖恶寒，升则厥痛，坠微便痛绕腹，暖胎须避络伤，以及奇脉，畏虑胎坠难挽，辛香温柔之补，冀其止厥。（寒邪厥）

鹿角霜 淡苁蓉 炒杞子 柏子仁 当归 炒沙苑 炒大茴 茯苓

某 固护胎元，诸症俱减，惟心嘈觉甚，阴火上升，营虚之征。（营虚火炎）

人参 桑寄生 熟地 阿胶 丝绵灰 条芩 白芍 当归 茯苓 香附

某 怀妊，痢滞半月，胃阴既亏，阳气上逆，咽中阻，饮水欲哕，舌尖红赤，津液已耗，燥补燥劫，恐阴愈伤，而胎元不保，议益胃和阳生津治之。（痢伤胃阴）

用川石斛煎汤代水。

潘 血液护胎，尚且不固，心中如饥空洞，食不能纳，况又战栗呕逆，凡内外摇动，都是动胎，从来有胎而病外感，麻桂硝黄等剂，必加四物，是治病保胎第一要法。（热邪伤阴）

小生地 白芍 阿胶 知母 黄芩 青蒿梗

王 临月下痢脓血，色紫形厚，热伏阴分，议用白头翁汤。（热邪下痢脓血）

黄芩 黄柏 炒银花 炒山楂 茯苓 泽泻

某 胎漏鼻衄，发疹而喘。（胎漏）

淡黄芩 真阿胶 青苎

某 触胎下血，腹痛而坠。（触胎下血）

人参 炒白芍 炙草 广皮 熟地炭 炒砂仁末

加纹银一二两、青苎一两。

陆（十八） 形瘦，脉数尺动，不食恶心，证象恶阻，腰痛见红，为胎漏欲坠。

青苎（二钱） 建莲（五钱） 纹银（一两） 砂仁（七分） 白糯米（一钱）

某 三月胎漏，用固下益气。

人参 熟术 熟地 阿胶 白芍 炙草 砂仁 艾炭

华 血下，殒胎未下，浊气扰动，晕厥呕逆，腹满，少腹硬，二便窒塞不通，此皆有形有质之阻，若不急为攻治，浊瘀上冒，必致败坏，仿子和玉烛散意。（殒胎不下）

川芎 当归 芒硝 茺蔚子 大腹皮 青皮 黑豆皮

调回生丹。

程 怀妊八月，子肿，腹渐坠，正气虚弱，补剂必须理气，预为临产之算。（子肿）

人参 茯苓 广皮 大腹皮 苏梗 砂仁末

<D>易曰，大哉乾元，万物资始，此言气之始也，又曰，至哉坤元，万物资生，此言形之始也，人得父母之气，以生气生形，即禀此乾坤之气也，两仪既兆，五行斯彰，故天一生水，水属肾，肾脏先生，地二生火，火属心，心又次生，天三生木，木属肝，肝又次生，地四生金，金属肺，肺又次生，天五生土，土属脾，脾又次生，天既以五行生五脏，而仁义礼智信之五德，亦即寓于其中，朱夫子所云，天以阴阳五行，化生万物，气以成形，而理亦赋焉，此之谓也，因此古人重胎教，所以端其本也，而今不复讲矣，然六淫之感，七情之伤，妊妇禀气有强弱，小儿胎元有静躁，故安胎之法，不可不详，如恶阻胎淋胎晕胎肿胎悬及漏胎等症，古人言之甚晰，兹不具赘，今阅叶先生案，胎前大约以凉血顺气为主，而肝脾胃三经，尤为所重，因肝藏血，血以护胎，肝血失荣，胎无以荫矣，肝主升，肝气横逆，胎亦上冲矣，胎气系于脾，如寄生之托于苞桑，茑与女萝之施于松柏，脾气过虚，胎无所附，堕滑难免矣，至于胃为水谷之海，妊妇全赖水谷之精华，以养身护胎，故胃气如兵家之饷道，不容一刻稍缓也，其余有邪则去邪，有火则治火，阴虚则清滋，阳虚则温补，随机应变，无所执着，学人更能引而伸之，触类而通之，安胎之法，可一以贯之，无余蕴矣。（秦天一）

徐评 案方亦清，无大出入，然非妇科专门，多有未到之处，当更博求之。</D>