钦 初产汗出眩晕，胸痞，腹痛，宜通恶露。（新产恶露瘀滞）

炒山楂 延胡 郁金 赤芍 炒牛膝 香附 童便（冲）

炒山楂 郁金 丹参 橘红 炒川贝 甜花粉

程 冲脉为病，男子内结七疝，女子带下瘕聚，故奇脉之结实者，古人必用苦辛，和芳香，以通脉络，其虚者，必辛甘温补，佐以流行脉络，务在气血调和，病必全愈，今产后体虚，兼瘀而痛，法当益体攻病，日期已多，缓治为宜。（体虚兼瘀）

此苦辛偶方，加丹皮以通外，琥珀以通内，所以取效。

又照前方去红花郁李仁，加泽兰。

某（二五） 恶露淋漓，痛由腰起，攻及少腹，此督带空虚，奇经气阻奚疑，奇经为病，通因一法，为古圣贤之定例。

当归 楂肉炭 炒丹皮 泽兰 川断 制首乌

唐 产后骤脱，参附急救，是挽阳固气方法，但损在阴分，其头痛汗出烦渴，乃阳气上冒，凡开泄则伤阳，辛热则伤阴，俱非新产郁冒之治道，尝读仲景书，明本草意，为是拟方于后，亦非杜撰也。（郁冒）

生左牡蛎（一钱） 生地（二钱） 上阿胶（二钱） 炒黑楂肉（三钱） 茺蔚子（一钱半）

吴 新产阴气下泄，阳气上冒，日晡至戌亥，阳明胃衰，厥阴肝横，肝血无藏，气冲扰膈，致心下格拒，气干膻中，神乱昏谵，若恶露冲心则死矣，焉有天明再醒之理，回生丹酸苦直达下焦血分，用过不应，谅非瘀痹，想初由汗淋发热，凡外感风邪，邪滞汗解，此热昏乱，即仲景之新产郁冒也，倘失治，必四肢牵掣，如惊似风痫则危，议从亡阳汗出谵语例，用救逆法。

生龙骨（三钱） 生牡蛎（三钱） 桂枝（五分） 淮小麦（百粒） 炙甘草（三分） 南枣（二钱）

人参（二钱） 龙齿（三钱捣） 枣仁（三钱） 茯神（三钱） 炒黑杞子（二钱） 黑壳建莲肉（五钱）

紫石英一两，捣碎，用水三盏，煎减半，用以煎药。

人参（二钱） 龙齿（三钱） 枣仁（三钱） 茯神（三钱） 桑螵蛸（炙二钱） 炒黑远志（五分）

用紫石英煎汤，煎药。

人参（五钱） 熟附子（一钱） 川桂枝木（一钱） 炮姜炭（一钱） 炙黑甘草（五分） 茯苓（三钱）

沈 此产后阴虚疟疾，鼻煤，喉燥舌干，脘痞不饥，大便窒塞不通，乃阳明津枯，不上供肺，下少滋肠，风阳游行，面肿耳聋，仲景谓阴气先绝，阳气独发，后人以饮食消息，取义甘寒，则知辛温逐瘀之谬。

人参 炒麦冬 枣仁 乌梅肉 蜜水炒黄知母

张 产后郁冒，汗出潮热，腹痛。

炒生地 炒山楂 丹参 茯神 浮小麦 黑稆豆皮

吴 产后十二朝，先寒战，后发热，少腹A2K0痛，腹膨满，下部腰肢不能转侧伸缩，小溲涩少而痛，此败血流入经络，延及变为疡症，议用交加散。（败血入经络为疡）

小生地 生姜 车前 牛膝 五灵脂 炒楂肉

调入琥珀末一钱。

归须 炒桃仁 延胡 炒楂肉 官桂 香附 川楝 小茴

程 脉濡，恶露紫黑，痛处紧按稍缓，此属络虚，治在冲任，以辛甘理阳。（营络虚寒恶露未清）

炒归身 炒白芍 肉桂 茯苓 小茴 杜仲

人参 炒归身 炒白芍 茯神 炙草 桂心

许 产后阴虚，肝风动灼，喉干呛咳，晚则头晕。（阴虚风阳动）

程 坐蓐过劳肝风阳气动，面浮气短，腹膨，恶露未清，不可腻滞，须防痉厥。

小生地 丹参 泽兰 茯神 黑稆豆皮 琥珀末

某 产后下焦阴亏，奇脉不固，阳浮乃升，风动则飧泄嘈杂，液损必消渴骨热，治在肝肾，静药固摄。

熟地 湖莲 炙草 五味 芡实 山药 旱莲 女贞

某 新产后，阴分大虚，汗出胸痞潮热，阳浮卫不固，虽痰多咳频，忌用苦辛表散，恐久延蓐劳耳。（阴虚阳浮汗泄）

某 产后身痛，少腹满。（血虚寒滞）

楂肉 川芎（醋炒） 延胡（醋炒） 泽兰 丹皮 艾叶 小茴 香附（醋炒） 茯苓

羊肉胶丸。

孙 产难，伤力惊恐，面微浮，腹膨，小便不爽。（气血滞兼湿）

炒黑楂肉 大黑豆皮 大腹皮绒 生香附 茯苓 泽泻

白花益母草煎汤代水。

金 腹胀气滞，久泻，产后五日。（气滞胀泻）

于术 厚朴 茯苓 泽泻 南山楂 延胡

凌 一岁四气之交，夏季发泄为甚，凡夏至一阴初复，未及充盈，恰当产期，为阴气未充先泄，暑热乘隙内侵，正如内经最虚之处，便是容邪之处矣，产科未明此旨，徒晓产后逐瘀成药，苦辛破血，津液愈劫，所伏暑热，无由可驱，六气客邪，内迫脏腑，渐渐昏蒙内闭，攻热害正，养正邪留，药难立方调治，幼读仲景，揣摩圣诲，惟育阴可以除热，况乎暑必伤气，人参非益气之圣药乎，大队阴药，佐以人参，诚为阴分益气之法，服之热疖垒垒而起，恶露缓缓而下，扶正却邪，并行不悖，今谷食已安，谅无反复，难成易亏之阴，须安养可望图功，倘加情志感触，轻则奇损带淋，重则髓枯蓐损，莫道赠言之不详也。（阴虚夹暑）

雄乌骨鸡（一只） 人参（二两秋石拌） 鲜生地（三两） 柏子仁（一两半） 天冬（一两半） 麦冬（二两） 阿胶（二两） 建莲肉（三两） 茯神（二两）

熬膏。

项 初病舌赤神烦，产后阴亏，暑热易深入，此亟清营热，所谓瘦人虑虚其阴。（暑伤营阴）

张 产后十三朝，舌黄边赤，口渴脘中紧闷，不食不饥，不大便，此阴分已虚，热入营中，状如疟症，大忌表散清克，议滋清营热，救其津液为要。

生首乌 麻仁 麦冬 蜜水炒知母 苏子 花粉

某 浊阴上逆，恶心不食，冷汗烦燥，最防暴脱，不可但执恶露滞满，而专泻气攻血也。（阳虚欲脱）

冲入童便。

某 脉无神，神倦欲昏，汗出，乃阳气走泄，泻利系阴气不守，产后见症，是属重虚，深恐节间暴脱，而寒热胸痞腹痛，岂遑论及标末。

人参 制附子 人尿 猪胆汁

某（二五） 产后骤加惊恐，阳上瞀冒为厥，左肢麻木，耳窍失聪，皆阳挟内风，混入清窍，以上实下虚，镇阳填阴，味厚质静之药。（产后阴虚阳浮发厥）

熟地 龟甲心 天冬 萸肉 五味 磁石 茯神 黑壳建莲

某 产后去血过多，阴虚阳实，头中眩晕，汗出肉瞤，惊畏身热等症，最易昏厥，苦辛气味宜忌。

生地 小麦 炙黑甘草 麦冬 阿胶 茯神 生左牡蛎

顾（三一） 产后真阴不复，阳越风动，四肢麻木，先厥后热。

徐 少腹冲及心下，脘中痛而胀满，若云肝气犯胃，必有呕逆，前法益阴和阳不应，显是产后下虚，厥气上攻，议用柔阳之药。（冲任虚气上逆脘痛胀）

炒归身 苁蓉 炒枸杞 柏子仁 小茴 茯神

当归 苁蓉 紫石英 茯苓 河车 鹿角霜

虞（三二） 背寒心热，天明汗出乃凉，产后两三月若此，此属下焦真阴已亏，渐扰阳位，二气交乘，并非客症，头晕耳鸣心悸，寒热后必泻，内风震动，当与静药。（阴虚风阳动，六月二十日）

人参 炙草 白芍 麦冬 炒生地 炒乌梅

熟地（水制） 人参 阿胶 萸肉 远志炭 山药 茯神 建莲

乌骨鸡膏丸。

吴 坐蓐过劳，惊恐交迫，真阴既伤，经年不复，目暗昏花，烦动热升，皆肾阴不得自充，何以涵养肝木，厥仆眩晕，阳挟肝风直上无制，则当静药填阴，佐酸以收摄。

陈（二八） 寒热时作，经岁不痊，且产后病起，阳维为病明矣。（阳维病寒热）

归桂枝汤。

郭（二四） 产后下元阴分先伤，而奇经八脉，皆丽于下，肝肾怯不固，八脉咸失职司，经旨谓阳维脉痛，苦寒热，阴维脉病，苦心痛，下损及胃，食物日减，然产伤先伤真阴，忌用桂附之刚，温煦阴中之阳，能入奇经者宜之。（下损及胃奇脉虚）

人参 鹿茸 紫石英 当归 补骨脂 茯苓

陈（四一） 产后四月，腰痛牵引少腹，冷汗不食。（营络虚寒腰腹痛）

当归 羊肉 小茴 桂枝木 茯苓 紫石英

沈 产后动怒，气血皆逆，痛呕不卧，俯不能仰，面冷肢冷，口鼻气寒，痛必自下冲上，此属疝瘕厥痛。（气血寒滞结瘕）

淡吴萸 韭白 两头尖 川楝子 桂枝木 茯苓

吴（二六） 产后百日内，右胁下少腹痛坚膨，络空无血，气乘于中，有结聚癥瘕之累，延及变成胀满，经水不转，成大病矣。

当归 桂心 生桃仁 牛膝 山楂 炒黑小茴

陆 产后邪深入阴，气血胶结，遂有瘕疝之形，身体伛偻，乃奇脉纲维不用，充形通络可效，仿仲景当归羊肉汤意。

羊肉胶丸。

某 产后胞损溺淋，筋脉牵掣，治当摄下。（胞损）

桑螵蛸 生沙苑 萸肉炭 炒黄柏 茯神

冯（四二） 产后两月，汗出身痛。（营卫兼虚）

归芪建中汤。

余 产后不复，心悸欲呕，遇寒腹痛，先议进和营卫，继当补摄。

归桂枝汤加茯苓。

吴（三八） 胃痛三月不止，茹素面黄，产后吞酸少食，中焦阳惫，岂宜再加攻泄，与辛补血络方。（阳虚胃痛血络瘀滞）

桃仁 归须 公丁香皮 川桂枝 半夏 茯苓

某 产虚，下焦起病，久则延胃，不饥不食，乃阴损及阳，阳明脉空，厥阴风动掀旋，而头痛面浮，肢冷指麻，皆亡血家见象。（阴损及阳肝风犯胃）

人参（一钱） 杞子（炒焦三钱） 归身（一钱） 牛膝（盐水炒焦一钱） 巴戟天（一钱） 浙江黄甘菊花炭（五分） 茯苓（一钱半）

（丸方） 人参（二两另研） 茯苓（二两蒸） 萸肉（二两炒焦） 五味（一两半） 杞子（二两炒） 桑螵蛸壳（盐水煮烘一两） 生白龙骨（一两） 浙江黄菊花（一两炙炭）

蜜丸，早服四钱，开水送。

杨（三一） 自幼作劳，即患头眩，加之刮痧，一月之内，必发数次，前岁产后，体甚不健，右耳日夜响鸣，鸣即头眩，神色衰夺，唇黄舌白，带下手冷脚肿，脉右大是阳明空，气泄不固，暖下温中主之。（胃虚下焦虚寒）

人参（二两） 桑螵蛸（三两制） 鹿角霜（一两半） 淡苁蓉（一两半） 炒杞子（二两） 柏子霜（一两半） 茯苓（一两半） 紫石英（一两半醋煅飞） 白龙骨（一两半）

红枣四两，蕲艾五钱，水煮捣丸，服四钱。

某 胃痛欲呕肢冷，痛引腰背，产后病发更甚。

当归 炒沙苑 炒黑杞子 炒黑小茴 鹿角霜

生精羊肉煎服。

（丸方） 人参 鹿茸 生杜仲 炒杞子 当归 鹿角霜 茯苓 沙苑 小茴

羊腰子蒸熟捣丸。

邹（三二） 阳不入阴，不寐汗出，产伤，阴先受损，继而损至奇经，前主温养柔补，谓阴伤不受桂附刚猛，阅开列病情，全是阴虚阳浮，漏经几一月，尤为急治，夜进局方震灵丹五十粒，前方复入凉肝，益阴配阳，是两固法则。（阴虚阳浮经漏）

人参 麋茸 枸杞 天冬 茯神 沙苑

某 产后淋带，都是冲任奇脉内怯，最有崩漏劳损淹缠之虑，但固补实下，须通奇经者宜之。（奇脉虚淋滞）

桑螵蛸 人参 茯苓 生杜仲 沙苑 芡实 湖莲

陈 产后百脉空隙，腰脊痛漏淋。

桑螵蛸 鹿角霜 龙骨 淡苁蓉 炒杞子 沙苑 茯苓

吴 阅病原产后阴虚液亏，加以平时嗔怒，阳气暴升，络血不宁，奇空冲任少贮，带淋暗泄等症。

阿胶 天冬 当归 白芍 淡黄芩 青蒿膏 女贞子 茯神 乌骨鸡炙

蜜丸。

赵 蓐损八脉，经水不来，带下频频颇多，产后下焦先虚，继及中宫，乃血液脂膏之涸，桂附热燥，更助劫烁，此温药，是温养之义，非温热之谓。

人参 河车 麋茸 鹿角霜 归身 茯苓 紫石英

杨 瘕泄起于产后，三年方愈，下损已极，经水几月一至，来必衰颓如病，奇经冲任交空，下焦畏冷，食冷则泻，心中疼热，暖下温经主之。（虚寒瘕泄）

人参 鹿角霜 炒菟丝 生杜仲 炒杞子 熟白术 淡骨脂 茯苓

蒸饼丸。

金（三八） 经后即背寒不热，逾月不愈，嗽痰有血，自秋令产蓐，屡屡若伤风咳嗽，正月至谷减，思产后不复是下虚，形寒减食，先调脾胃，即和营卫法。（中虚）

某 易饥易怒，腹溏气坠，知饥不进食，自胎前至今，两月不愈，并非客邪，用固摄升阳。（督任虚寒）

鹿茸 鹿角霜 熟地炭 当归 桂枝 五味 茯苓

某 产后十年有余，病发必头垂脊痛，椎尻气坠，心痛冷汗，此督任气乖，跷维皆不用，是五液全涸，草木药饵，总属无情，不能治精血之惫，故无效当以血肉充养，取其通补奇经。

鹿茸 鹿角霜 鹿角胶 当归 茯苓 杞子 柏子仁 沙苑 生杜仲 川断

潘 胎前水溢浮肿，喘满不得卧，余用开太阳膀胱获效，既产浮肿自然渐退，女科不明产后下虚，专以破气宽胀，百日来腹大且满，按之则痛，此皆气散弥漫，丸药又补涩守中，益助其钝气血凝涩，经候不来，为难治之病，议肾气汤，煅药成炭，取其气之通，勿令味浊，兼调琥珀末以调其血涩，仿古法中之所有，非杜撰也。（阳虚肿胀）

桂七味加车前牛膝，炒炭，水洗煎，临服调入琥珀末。

徐（三六） 产后九年，心中胀甚则泻甚，肌浮足肿，食减过半，凡胀必有喘，产后先伤在下，用薛氏济生丸三钱，十服。

某 产后血去过多，下焦冲任空虚，跗肿腹膨，形寒面黄，脉濡，当用温养。

鹿角霜（三钱） 补骨脂（一钱） 紫石英（三钱） 茯苓（三钱） 桂心（四分） 炒黑小茴（七分）

方（三二） 脉沉濡，产虚寒入，痛胀，腹鸣晨泄，病患述心痛呕逆，其实治下为是。

熟附子 胡芦巴 良姜 炒黑茴香 茯苓 广木香

朱（四六） 脉微弱，形无华色，据说病起产后，食减吐泻，是下焦不复，中焦又伤，渐加浮肿胀满，倏甚忽平，皆下焦厥逆上冲也，下虚于产后，刚剂难以专任，是病之不易取效者在此。

淡苁蓉 炒黑杞子 当归 小茴 茯苓 沙苑

某（四五） 产后未满百日，胸胁骨节收引，四肢肌肉麻木，浮肿腹胀，早轻夜重，食减，畏寒便溏，脉得右迟左弦，先与理中，健阳驱浊。

范 病胀起于产后，下焦先伤，浊阴犯中，不可以胀满为实症，夫腑阳不通，肾气散漫，吸气不入，息音如喘，此身动便喘，非外客之邪干肺，春半温气外侵，面肿颈项结核，曾以夏枯菊叶辛解得效，乃一时暴邪治法，至于本病之腹满洞泄跗肿，未经调理，且胀势侵晨至午颇减，日暮黄昏胀形渐甚，中焦阳微，已见一斑，愚见胀满在中，而病根在下，仲景于产后失调，都从下虚起见，阅女科汤药一方，殊属不解，思平居咽干喉痹牙宣，肝肾真阴下亏，不敢刚药宣通，仿薛氏肾气法，减泄肝如牛膝肉桂之辛，不致劫阴，仍可通阳为法。

六味去萸，加芍药、附子、牡蛎、炒炭煎。

某 产后肿胀不愈，显系下虚，肝肾气不收摄，形寒痞闷，食少痰多，脉细肉消，治从阴分，非分和攻消者。

济生肾气丸沉香汁冲开水送，接服金匮肾气丸。

王 胀满六年，产后小愈，今胀势复甚，兼脱肛淋症，大腿热如滚水滚泼，食入脐中作痛，议治其腑。（温热肿胀）

小温中丸（三钱），六服。

傅 风胜为肿，湿甚生热，乃经脉为病，但产后百日，精神未复，不可过劫。（风湿）

羚羊角 木防己 片姜黄 川桂枝 大杏仁 苡仁

方 产后腹大，半年不愈，近日有形冲突，肠如刀搅，据述坐蓐艰产，血去盈斗，而腹形即已胀满，想八脉不用，肾气散越不收，非瘀血积气为病，议用大全方乌鸡煎丸。（奇脉虚肾气不摄肿胀）

乌骨鸡 人参 苍术 附子 乌药 肉桂 陈皮 草果 红花 海桐皮 黄芪 白术 蓬术 川乌 延胡 白芍 木香 肉果 琥珀 丹皮

即以鸡挦去毛头嘴爪肠杂，将药放鸡肚内，贮砂锅中，以好酒一斗同煮，令干，去鸡骨，以油单盛焙令干，为末，蜜丸。

范 冲任伤，督带损，皆由产时劳怖，理难复元，固摄下真，兼理奇脉，治非背谬，但腹满膨痛，若徒固补，不以通调，恐滋胀肿，大意阳宜通，阴宜固，包举形骸，和养脉络，乃正治方法，病样多端，纷纭缕治，难以立方矣。

人参 鲜河车胶 淡苁蓉 砂仁制熟地 鹿角霜 归身 茯苓 紫石英 小茴香 羊腰子

某 产后下虚，血病为多，今脘中痞胀，减食不适，全是气分之恙，但调气宽中，勿动下焦为稳。（气滞脘痞胀）

香附 神曲 苏梗 白蔻仁 茯苓 桔梗

朱（四十） 产后冬月，右腿浮肿，按之自冷，若论败血，半年已成痈疡，针刺泄气，其痛反加，此乃冲任先虚，跷维脉不为用，温养下元，须通络脉，然取效甚迟，恪守可望却病。（下焦脉络寒滞肿痛）

苁蓉 鹿角霜 当归 肉桂 小茴 牛膝 茯苓

鹿角胶溶酒蜜丸。

某 产后必病，阴虚可知，两足跗中筋掣瘀痛，不耐走趋，当温养肝肾，以壮筋骨，但食后脘中痞阻，按之漉漉有声，手麻胁痛，心烦，耳目昏眩，宛是阳气不主流行，痰饮内聚之象，处方难以兼摄，议用分治法。（肝肾虚兼痰饮）

中焦药，日中服，桂苓六君子，竹沥姜汁法丸。

下焦药，侵晨服，从四斤丸金刚丸参写。

苁蓉 牛膝 虎骨 生杜仲粉 天麻 木瓜 萆薢

蜜丸。

程 脉沉，喘咳浮肿，鼻窍黑，唇舌赤，渴饮则胀急，大便解而不爽，此秋风燥化，上伤肺气，气壅不降，水谷汤饮之湿，痹阻经隧，最多坐不得卧之虑，法宜开通太阳之里，用仲景越婢小青龙合方，若畏产后久虚，以补温暖，斯客气散漫，三焦皆累，闭塞告危矣。（燥伤肺气水气痹阻）

陈（三十） 夏季坐蓐，秋月热病，半年来不寐不便，无皮毛焦落之象，是痰饮为气所阻，以致升降失常，乃痹之基也，议宣肺以通肠。（痰饮阻气不寐不便）

紫菀（八钱） 杏仁（三钱） 枳壳（一钱） 桔梗（一钱） 瓜蒌皮（一钱） 郁金（一钱）

陆 背寒，夜卧气冲欲坐，乃下元虚乏，厥浊饮邪皆令上泛，胎前仅仅支撑，产后变症蜂起，奈何庸庸者流，泄肺冀其嗽缓，宜乎药增病势矣。（下虚饮浊上逆）

桂枝 茯苓 炙草 五味 淡干姜

许 实喘属肺，虚喘属肾，产后下虚最多，痰饮易于上泛，喘嗽食减，有浮肿胀满，不得卧之忧，不可小视。

王 产后未复，风温入肺，舌白面肿喘咳，泄泻，小水渐少，必加肿满，不易治之症。（风温客肺饮邪上逆）

半夏 姜汁 黍米 茯苓

生于术 建泽泻 茯苓 苡仁

某 脉小左弦，咳逆脘闷，小便不利，大便溏泻，不思纳谷，嗳气臭秽，此皆胎前气上逆冲，浊得盘踞膈间，肺失清肃降令，上窍痹，致下窍不利，汤食聚湿，气不宣行，怕延出浮肿腹满，喘急不卧诸款，不独以产后通瘀为事。（湿浊踞膈肺不肃降）

郁金汁 杏仁 通草 桔梗 茯苓皮 苡仁

沈 产后未复，加以暑热上干，暑必伤气，上焦先受，头胀，微微呕恶，脘闷不晓饥饱，暮热早凉，汗泄不已，经水连至，热迫血络妄动，盖阴虚是本病，而暑热系客气，清上勿得碍下，便是理邪，勿混乱首鼠，致延蓐损不复矣。（暑伤上焦气分）

卷心竹叶 生地 炒川贝 连翘心 玄参 地骨皮

袁（二一） 神识不甚灵慧，陡然狂乱入井，夫暴病痰火风为多，今诊视色脉，产后未满百日，多惊怕，五味皆变，厥阴肝木，顺乘阳明，古称一阴一阳变乱为痫，先以清心胞解营热，食进便通，再酌调理。（木火盛心营热）

某（三五） 产后不复元，仍自乳抚育，损不能复，即是蓐劳，速速断乳，药力可扶，凡产必下焦先损，必以形质血气之属，莫以心热，再用寒凉，伐其生气。（蓐劳）

人参 当归 沙苑 杜仲 补骨脂 茯苓 羊内肾（二枚）

沈 时热，属上焦病，超时自解，缘体质素薄，长夏坐蓐，不但肝肾阴伤，诸气皆为发泄，阴不主恋阳，冲脉上冲，而心热骨痿，总是阴亏不肯复元，久久延成损症，此与清润治肺之咳无预，法宜填补下焦，摄之固之，迎养秋收冬藏，胃纳有加，庶乎渐安。

鲜紫河车 人参 真秋石 茯神 水煮熟地 归身 五味 芡实 山药

生羯羊肉胶共河车胶，二共和丸。

姚（三十） 面少华色，脉似数，按之芤涩，产后三年，从未经来，腹中有形，升逆则痛，肩背映胁，卒痛难忍，咳吐都是涎沫，着枕气冲欲坐，食减便溏，身动语言喘急，此乃蓐劳损极不复，谅非草木可以图幸，由下焦元海少振，惊恐馁弱，冲脉动，斯诸脉交动，拟益元气，充形骸，佐重镇以理怯，护持体质之义，非治病方药矣。

人参 杞子 白龙骨 茯苓 紫石英 羊肉

邹（二八） 产后成劳损，先伤下焦血分，寒热数发不止，奇经八脉俱伤，欲呕不饥，肝肾及胃，有形凝瘕，议柔剂温通补下。

人参 当归（小茴香拌炒） 茯苓 沙苑 淡苁蓉 杞子 鹿角霜 生紫石英

汪 产后百日，寒热消渴，心痛恶食，溏泻，此蓐劳液涸，已属沉疴难治，拟酸甘化阴扶胃，望其小安而已。

人参 乌梅 炙草 赤石脂 木瓜 茯神 炒粳米

张（二八） 产后下虚，厥气上冲犯胃，食入呕胀，脉络日空，营卫两怯，寒热汗泄，淹淹为蓐劳之病，最难调治。

淡吴萸（七分） 桂枝（五分） 茯苓（三钱） 炮姜（八分） 炒木瓜（一钱） 南枣

黄 产后，陡然惊恐，阴亏，厥阳上逆，血涌吐痰，胸背胁俞大痛，乃八脉空乏之征，蓐劳重症延绵，最难全好，议镇固一法。

熟地炭 炒杞子 五味 紫石英 茯神 牛膝炭

熬膏，人参汤送。

顾 小产三日，脉数，头痛，脘痞，小腹坠痛，欲厥，此属郁冒。（小产郁冒）

连翘 郁金汁 丹皮 钩藤 茯苓 炒山楂

某（二五） 小产后，恶露淋漓，营血内亏，厥阳由是鼓动，头胀耳鸣，心中洞然，病在下焦矣。（营血虚阳升）

枸杞子（三钱） 柏子仁（一钱） 全当归（一钱半） 白芍（一钱半） 豆皮（三钱） 茯神（三钱）

朱 脉小，半产一日，舌白，频频呕吐青绿水汁涎沫，左肢浮肿，神迷如寐，此胃阳大虚，肝风内泛，欲脱之象，急急护阳安胃，冀得呕缓，再商治病。（胃阳虚肝风动呕吐欲脱）

人参 淡附子 炒焦粳米 煨老姜

人参 淡附子 熟于术 炮姜 茯苓 南枣

某 小产不及一月，忽有厥逆痰潮，此阴分既虚，厥阳上冒，今二便已通，神志似属愦散，病虽已成癫痫，却非痰火有余，肝肾位远，治宜镇补，拟陈无择琥珀散。（阴虚阳冒成癫痫）

人参 白芍 铁落 辰砂 磁石 远志 菖蒲 牛黄 琥珀

孔 形畏寒凛凛，忽然轰热，腰膝坠胀，带下汗出，由半产下焦之损，致八脉失其拥护，少腹不和，通摄脉络治之。（奇脉阳虚不升固）

鹿角霜 炒当归 杜仲 菟丝子 小茴香 桂枝

陈 怀妊三月，小产半年不复，寒从背起，热起心胸，经水后期不爽，带下脉脉不断，脊膂腰髀痿坠酸疼，膝骨跗胫易冷无力，由冲任督带伤损，致阴阳维跷不用，调治非法，有终身不肯孕育之累。（奇脉虚淋滞）

鹿角霜 炒枸杞 当归 炒沙苑 桂枝 小茴

顾 上年小产，下虚不复，冬令藏聚未固，春夏阳升，风温乘虚上受，清窍不利，耳失聪，鼻多塞，咽燥痰稠，悉见上焦不清，究竟下虚是本病，议食后用清窍，早上用镇纳。（下虚上受风温）

青菊叶（三钱） 羚羊角（一钱） 黑栀皮（一钱） 连翘心（一钱半） 玄参心（二钱） 苦丁茶（一钱）

磁石六味加龟胶北味。

程 久泻延虚，痛后而泻，气弱不司营运，病因小产而来，法当中下两调。（阳气虚久泻）

人参 炒菟丝子 木香 茯苓 炒白芍 炒补骨脂

汪 小产后，气冲结瘕，是奇经八脉损伤，医谓病尚有形，佥从瘀血施治，半年来肌肉大消，内热，咯痰带血，食过脘下，辄云腹痛，盖产后下焦真阴大亏，攻瘀清热，气味苦辛，是重虚其虚，药先入胃，既不中病先戕胃口，致令饮食废矣，阴虚生热，经训灼然，只以胃口伤残，难与滋腻之药，此症延成蓐劳，必得饮食渐和，方有调病之理，见病治病，贻害岂可再循前辙，议肝胃两和方法。（蓐劳）

炒黑杞子（三钱） 云茯神（一钱半） 柏子仁（三钱） 生沙苑（一钱） 焦当归（一钱） 小茴（七分同当归合炒） 紫石英（五钱先煎廿滚入药）

某 三次两月胎漏而下，是厥阴失养，脉数右大，腹痛恶露未尽。（肝虚血滞）

柏子仁 炒楂肉 丹皮 泽兰叶 细生地

调入琥珀末。

倪 小产半月颇安，忽然腰腹大痛，或攒膝跗足底，或引胁肋肩胛，甚至汤饮药饵，呕吐无存，娠去液伤，络空风动，昔贤谓按之痛缓属虚，勿道诸痛为实。（液虚风动）

炙草 淮小麦 南枣 阿胶 细生地 生白芍

<D>金匮要略云，新产妇人有三病，一者病痉，二者病郁冒，三者大便难，新产血虚，多汗出，善中风故令病痉，亡血复汗，寒多，故令郁冒，亡津液，胃燥，故大便难，心典云，血虚汗出，筋脉失养，风入而益其劲，此筋病也，亡阴血虚，阳气遂厥，而寒复郁之，则头眩而目瞀，此神病也，胃藏津液，而渗灌诸阳，亡津液，胃燥，则大肠失其润，而大便难，此液病也，三者不同，其为亡血伤津则一，故皆为产后所有之病，即此推之，凡产后血虚诸症，可心领而神会矣，张路玉云，产后元气亏损，恶露乘虚上攻，眼花头晕，或心下满闷，神昏口噤，或痰涎壅盛者，急用热童便主之，或血下多而晕，或神昏烦乱者，芎归汤加人参泽兰童便，兼补而散之，又败血上卫有三，或歌舞谈笑，或怒骂坐卧，甚则逾墙上屋，此败血冲心多死，用花蕊石散，或琥珀黑龙丹，如虽闷乱，不致颠狂者，失笑散加郁金，若饱闷呕恶，腹满胀痛者，此败血冲胃，五积散，或平胃加姜桂，不应，送来复丹，呕逆腹胀，血化为水者，金匮下瘀血汤，若面赤呕逆欲死，或喘急者，此败血冲肺，人参苏木，甚则加芒硝荡涤之，大抵冲心者十难救一，冲胃者五死五生，冲肺者十全一二，又产后口鼻起黑色，而鼻衄者，是胃气虚败，而血滞也，急用人参苏木，稍迟不救，丹溪云，产后当大补气血，即有杂症，以末治之，一切病，多是血虚，皆不可发表，景岳云，产后既有表邪，不得不解，既有火邪，不得不清，既有内伤停滞，不得不开通消导，不可偏执，如产后外感风寒，头痛身热，便实中满，脉紧数洪大有力，此表邪实症也，又火盛者，必热渴躁烦，或便结腹胀，口鼻舌焦黑，酷喜冷冻饮料，眼眵，尿痛溺赤，脉洪滑，此内热实症也，又或因产过食，致停蓄不散，此内伤实症也，又或郁怒动肝，胸胁胀痛，大便不利，脉弦滑，此气逆实症也，又或恶露未尽，瘀血上冲，心腹胀满，疼痛拒按，大便难，小便利，此血逆实症也，遇此等实症，若用大补，是养虎为患，误矣，以上四家之论，俱属产后治病扼要处，学人当细心体察，再参观叶先生医案，更能博考群书，以治产后诸病，易如反掌矣，否则如眇能视，不足以有明也，如跛能履，不能以与行也，乌得称司命哉。（秦天一）

妇人善病，而病由产后者为更多，亦为更剧，产后气血大亏，内而七情，外而六气，稍有感触，即足致病，使治之失宜，为患莫测，朱丹溪曰，产后以大补气血为主，虽有他症，以末治之，此语固为产后症之宗旨，而症实多端，论其常，未尽其变也，医者惟辨乎脉候，以明内外之因，审乎阴阳，以别虚实之异，病根透彻，而施治自效，慎毋以逐瘀为了事，亦毋以温补为守经，今观先生案中，凡内因之实症，未尝不用攻治之剂，然如热炽昏乱，有似恶露冲心者，先生则曰，阴气下泄，阳气上冒，从亡阳汗出谵语例，为救逆法，如少腹冲及心脘，痛而胀满，有似肝气犯胃者，先生则曰，产后下虚，厥气上攻，惟用柔阳之药，如头痛汗出烦渴，有似感冒风寒者，先生则曰，开泄则伤阳，辛热则伤阴，从仲景新产郁冒之治以立方，至于奇经八脉，为产后第一要领，盖八脉丽于下，产后阴分一伤，而八脉自失所司，温补镇摄，在所必先，无奈世人罕知，即有一二讲论者，终属影响模糊，惟先生于奇经之法，条分缕析，尽得其精微，如冲脉为病，用紫石英以为镇逆，任脉为病，用龟板以为静摄，督脉为病，用鹿角以为温煦，带脉为病，用当归以为宣补，凡用奇经之药，无不如芥投针，若夫外因为病者，风温入肺，用苇茎汤甘寒淡渗，以通肺气，遇寒腹痛，用当归桂枝汤，辛甘化阳，以和营卫，暑气上干，则阴虚是本病，暑热是客气，清上勿致碍下，便是理邪，如湿伤脾阳，而饮邪阻气，用苦温淡渗之品，泽术汤治之，热蒸化燥而胃阻肠痹，用首乌麻仁麦冬花粉清滋润燥之剂治之，热乘阴虚而入营中，则忌表散清克，惟育阴可以除热，更如邪入营络而成疟症，不得发汗腻补，当以轻清和解为主，要之先生于内因之症，一一寻源探本，非同俗手漫谓补虚，于外因之端，种种审变达权，不以产后自为荆棘，惟读书多而胸具灵机，故于丹溪本末二字，尤为神化无迹，此所谓知其要者，一言而终，不知其要者，流散无穷也，案中诸症甚多，学人果能悟焉，则一以贯之矣。（龚商年）

徐评 近来诸医，误信产后属寒之说，凡产后无不用炮姜熟地肉桂人参等药，不知产后血脱，孤阳独旺，虽石膏竹茹，仲景亦不禁用，而世之庸医，反以辛热之药戕其阴而益其火，无不立毙，我见甚多，案中绝无此弊，足征学有渊源，惟喜用人参，而少用血药，消痰清胃之法，尚未见及，则有未到也，胎产之后，总由营虚大脱，不论有邪无邪，必养血为主，其去瘀消痰降火驱风种种治法，皆从血分中推详变化，不离本官，案中诸方多随见施，竟有不似产后之方者，此非专门之故也。</D>