赤芍 --- 炒山楂 延胡 郁金 赤芍 炒牛膝 香附 童便（冲）

益母草 --- 益母草汤代水。

炒川贝 --- 炒山楂 郁金 丹参 橘红 炒川贝 甜花粉

芳香 --- 程 冲脉为病，男子内结七疝，女子带下瘕聚，故奇脉之结实者，古人必用苦辛，和芳香，以通脉络，其虚者，必辛甘温补，佐以流行脉络，务在气血调和，病必全愈，今产后体虚，兼瘀而痛，法当益体攻病，日期已多，缓治为宜。（体虚兼瘀）

丹皮 --- 此苦辛偶方，加丹皮以通外，琥珀以通内，所以取效。

郁李仁 --- 又照前方去红花郁李仁，加泽兰。

炒丹皮 --- 当归 楂肉炭 炒丹皮 泽兰 川断 制首乌

生左牡蛎 --- 生左牡蛎（一钱） 生地（二钱） 上阿胶（二钱） 炒黑楂肉（三钱） 茺蔚子（一钱半）

炙甘草 --- 生龙骨（三钱） 生牡蛎（三钱） 桂枝（五分） 淮小麦（百粒） 炙甘草（三分） 南枣（二钱）

建莲肉 --- 人参（二钱） 龙齿（三钱捣） 枣仁（三钱） 茯神（三钱） 炒黑杞子（二钱） 黑壳建莲肉（五钱）

紫石英 --- 紫石英一两，捣碎，用水三盏，煎减半，用以煎药。

远志 --- 人参（二钱） 龙齿（三钱） 枣仁（三钱） 茯神（三钱） 桑螵蛸（炙二钱） 炒黑远志（五分）

紫石英 --- 用紫石英煎汤，煎药。

炒麦冬 --- 人参 炒麦冬 枣仁 乌梅肉 蜜水炒黄知母

黑稆豆皮 --- 炒生地 炒山楂 丹参 茯神 浮小麦 黑稆豆皮

小生地 --- 小生地 生姜 车前 牛膝 五灵脂 炒楂肉

炒桃仁 --- 归须 炒桃仁 延胡 炒楂肉 官桂 香附 川楝 小茴

炒白芍 --- 炒归身 炒白芍 肉桂 茯苓 小茴 杜仲

炒白芍 --- 人参 炒归身 炒白芍 茯神 炙草 桂心

黑稆豆皮 --- 小生地 丹参 泽兰 茯神 黑稆豆皮 琥珀末

熟地 --- 熟地 湖莲 炙草 五味 芡实 山药 旱莲 女贞

川芎 --- 楂肉 川芎（醋炒） 延胡（醋炒） 泽兰 丹皮 艾叶 小茴 香附（醋炒） 茯苓

益母 --- 益母膏丸。

羊肉 --- 羊肉胶丸。

生香附 --- 炒黑楂肉 大黑豆皮 大腹皮绒 生香附 茯苓 泽泻

益母草 --- 白花益母草煎汤代水。

人参 --- 凌 一岁四气之交，夏季发泄为甚，凡夏至一阴初复，未及充盈，恰当产期，为阴气未充先泄，暑热乘隙内侵，正如内经最虚之处，便是容邪之处矣，产科未明此旨，徒晓产后逐瘀成药，苦辛破血，津液愈劫，所伏暑热，无由可驱，六气客邪，内迫脏腑，渐渐昏蒙内闭，攻热害正，养正邪留，药难立方调治，幼读仲景，揣摩圣诲，惟育阴可以除热，况乎暑必伤气，人参非益气之圣药乎，大队阴药，佐以人参，诚为阴分益气之法，服之热疖垒垒而起，恶露缓缓而下，扶正却邪，并行不悖，今谷食已安，谅无反复，难成易亏之阴，须安养可望图功，倘加情志感触，轻则奇损带淋，重则髓枯蓐损，莫道赠言之不详也。（阴虚夹暑）

鲜生地 --- 雄乌骨鸡（一只） 人参（二两秋石拌） 鲜生地（三两） 柏子仁（一两半） 天冬（一两半） 麦冬（二两） 阿胶（二两） 建莲肉（三两） 茯神（二两）

麦冬 --- 生首乌 麻仁 麦冬 蜜水炒知母 苏子 花粉

童便 --- 冲入童便。

猪胆汁 --- 人参 制附子 人尿 猪胆汁

天冬 --- 熟地 龟甲心 天冬 萸肉 五味 磁石 茯神 黑壳建莲

柏子仁 --- 炒归身 苁蓉 炒枸杞 柏子仁 小茴 茯神

鹿角霜 --- 当归 苁蓉 紫石英 茯苓 河车 鹿角霜

炒生地 --- 人参 炙草 白芍 麦冬 炒生地 炒乌梅

熟地 --- 熟地（水制） 人参 阿胶 萸肉 远志炭 山药 茯神 建莲

桂枝 --- 归桂枝汤。

桂枝木 --- 淡吴萸 韭白 两头尖 川楝子 桂枝木 茯苓

生桃仁 --- 当归 桂心 生桃仁 牛膝 山楂 炒黑小茴

当归 --- 陆 产后邪深入阴，气血胶结，遂有瘕疝之形，身体伛偻，乃奇脉纲维不用，充形通络可效，仿仲景当归羊肉汤意。

羊肉 --- 羊肉胶丸。

生沙苑 --- 桑螵蛸 生沙苑 萸肉炭 炒黄柏 茯神

茯苓 --- 归桂枝汤加茯苓。

川桂枝 --- 桃仁 归须 公丁香皮 川桂枝 半夏 茯苓

黄甘菊 --- 人参（一钱） 杞子（炒焦三钱） 归身（一钱） 牛膝（盐水炒焦一钱） 巴戟天（一钱） 浙江黄甘菊花炭（五分） 茯苓（一钱半）

黄菊花 --- （丸方） 人参（二两另研） 茯苓（二两蒸） 萸肉（二两炒焦） 五味（一两半） 杞子（二两炒） 桑螵蛸壳（盐水煮烘一两） 生白龙骨（一两） 浙江黄菊花（一两炙炭）

鹿角霜 --- 人参（二两） 桑螵蛸（三两制） 鹿角霜（一两半） 淡苁蓉（一两半） 炒杞子（二两） 柏子霜（一两半） 茯苓（一两半） 紫石英（一两半醋煅飞） 白龙骨（一两半）

红枣 --- 红枣四两，蕲艾五钱，水煮捣丸，服四钱。

鹿角霜 --- 当归 炒沙苑 炒黑杞子 炒黑小茴 鹿角霜

羊肉 --- 生精羊肉煎服。

鹿角霜 --- （丸方） 人参 鹿茸 生杜仲 炒杞子 当归 鹿角霜 茯苓 沙苑 小茴

天冬 --- 人参 麋茸 枸杞 天冬 茯神 沙苑

人参 --- 桑螵蛸 人参 茯苓 生杜仲 沙苑 芡实 湖莲

鹿角霜 --- 桑螵蛸 鹿角霜 龙骨 淡苁蓉 炒杞子 沙苑 茯苓

淡黄芩 --- 阿胶 天冬 当归 白芍 淡黄芩 青蒿膏 女贞子 茯神 乌骨鸡炙

鹿角霜 --- 人参 河车 麋茸 鹿角霜 归身 茯苓 紫石英

鹿角霜 --- 人参 鹿角霜 炒菟丝 生杜仲 炒杞子 熟白术 淡骨脂 茯苓

人参 --- 人参建中汤。

鹿角霜 --- 鹿茸 鹿角霜 鹿角胶 当归 茯苓 杞子 柏子仁 沙苑 生杜仲 川断

牛膝 --- 桂七味加车前牛膝，炒炭，水洗煎，临服调入琥珀末。

鹿角霜 --- 鹿角霜（三钱） 补骨脂（一钱） 紫石英（三钱） 茯苓（三钱） 桂心（四分） 炒黑小茴（七分）

熟附子 --- 熟附子 胡芦巴 良姜 炒黑茴香 茯苓 广木香

淡苁蓉 --- 淡苁蓉 炒黑杞子 当归 小茴 茯苓 沙苑

牛膝 --- 范 病胀起于产后，下焦先伤，浊阴犯中，不可以胀满为实症，夫腑阳不通，肾气散漫，吸气不入，息音如喘，此身动便喘，非外客之邪干肺，春半温气外侵，面肿颈项结核，曾以夏枯菊叶辛解得效，乃一时暴邪治法，至于本病之腹满洞泄跗肿，未经调理，且胀势侵晨至午颇减，日暮黄昏胀形渐甚，中焦阳微，已见一斑，愚见胀满在中，而病根在下，仲景于产后失调，都从下虚起见，阅女科汤药一方，殊属不解，思平居咽干喉痹牙宣，肝肾真阴下亏，不敢刚药宣通，仿薛氏肾气法，减泄肝如牛膝肉桂之辛，不致劫阴，仍可通阳为法。

附子 --- 六味去萸，加芍药、附子、牡蛎、炒炭煎。

川乌 --- 乌骨鸡 人参 苍术 附子 乌药 肉桂 陈皮 草果 红花 海桐皮 黄芪 白术 蓬术 川乌 延胡 白芍 木香 肉果 琥珀 丹皮

鹿角霜 --- 人参 鲜河车胶 淡苁蓉 砂仁制熟地 鹿角霜 归身 茯苓 紫石英 小茴香 羊腰子

白蔻仁 --- 香附 神曲 苏梗 白蔻仁 茯苓 桔梗

鹿角霜 --- 苁蓉 鹿角霜 当归 肉桂 小茴 牛膝 茯苓

鹿角 --- 鹿角胶溶酒蜜丸。

姜汁 --- 中焦药，日中服，桂苓六君子，竹沥姜汁法丸。

天麻 --- 苁蓉 牛膝 虎骨 生杜仲粉 天麻 木瓜 萆薢

姜汁 --- 半夏 姜汁 黍米 茯苓

郁金汁 --- 郁金汁 杏仁 通草 桔梗 茯苓皮 苡仁

五味 --- 袁（二一） 神识不甚灵慧，陡然狂乱入井，夫暴病痰火风为多，今诊视色脉，产后未满百日，多惊怕，五味皆变，厥阴肝木，顺乘阳明，古称一阴一阳变乱为痫，先以清心胞解营热，食进便通，再酌调理。（木火盛心营热）

必下 --- 某（三五） 产后不复元，仍自乳抚育，损不能复，即是蓐劳，速速断乳，药力可扶，凡产必下焦先损，必以形质血气之属，莫以心热，再用寒凉，伐其生气。（蓐劳）

补骨脂 --- 人参 当归 沙苑 杜仲 补骨脂 茯苓 羊内肾（二枚）

真秋石 --- 鲜紫河车 人参 真秋石 茯神 水煮熟地 归身 五味 芡实 山药

羊肉 --- 生羯羊肉胶共河车胶，二共和丸。

紫石英 --- 人参 杞子 白龙骨 茯苓 紫石英 羊肉

鹿角霜 --- 人参 当归（小茴香拌炒） 茯苓 沙苑 淡苁蓉 杞子 鹿角霜 生紫石英

炒木瓜 --- 淡吴萸（七分） 桂枝（五分） 茯苓（三钱） 炮姜（八分） 炒木瓜（一钱） 南枣

人参 --- 熬膏，人参汤送。

郁金汁 --- 连翘 郁金汁 丹皮 钩藤 茯苓 炒山楂

益母草 --- 益母草汤煎。

淡附子 --- 人参 淡附子 炒焦粳米 煨老姜

淡附子 --- 人参 淡附子 熟于术 炮姜 茯苓 南枣

白芍 --- 人参 白芍 铁落 辰砂 磁石 远志 菖蒲 牛黄 琥珀

炒当归 --- 鹿角霜 炒当归 杜仲 菟丝子 小茴香 桂枝

鹿角霜 --- 鹿角霜 炒枸杞 当归 炒沙苑 桂枝 小茴

磁石 --- 磁石六味加龟胶北味。

炒白芍 --- 人参 炒菟丝子 木香 茯苓 炒白芍 炒补骨脂

云茯神 --- 炒黑杞子（三钱） 云茯神（一钱半） 柏子仁（三钱） 生沙苑（一钱） 焦当归（一钱） 小茴（七分同当归合炒） 紫石英（五钱先煎廿滚入药）

细生地 --- 柏子仁 炒楂肉 丹皮 泽兰叶 细生地

生白芍 --- 炙草 淮小麦 南枣 阿胶 细生地 生白芍

葱白 --- 葱白丸。

人参 --- <D>金匮要略云，新产妇人有三病，一者病痉，二者病郁冒，三者大便难，新产血虚，多汗出，善中风故令病痉，亡血复汗，寒多，故令郁冒，亡津液，胃燥，故大便难，心典云，血虚汗出，筋脉失养，风入而益其劲，此筋病也，亡阴血虚，阳气遂厥，而寒复郁之，则头眩而目瞀，此神病也，胃藏津液，而渗灌诸阳，亡津液，胃燥，则大肠失其润，而大便难，此液病也，三者不同，其为亡血伤津则一，故皆为产后所有之病，即此推之，凡产后血虚诸症，可心领而神会矣，张路玉云，产后元气亏损，恶露乘虚上攻，眼花头晕，或心下满闷，神昏口噤，或痰涎壅盛者，急用热童便主之，或血下多而晕，或神昏烦乱者，芎归汤加人参泽兰童便，兼补而散之，又败血上卫有三，或歌舞谈笑，或怒骂坐卧，甚则逾墙上屋，此败血冲心多死，用花蕊石散，或琥珀黑龙丹，如虽闷乱，不致颠狂者，失笑散加郁金，若饱闷呕恶，腹满胀痛者，此败血冲胃，五积散，或平胃加姜桂，不应，送来复丹，呕逆腹胀，血化为水者，金匮下瘀血汤，若面赤呕逆欲死，或喘急者，此败血冲肺，人参苏木，甚则加芒硝荡涤之，大抵冲心者十难救一，冲胃者五死五生，冲肺者十全一二，又产后口鼻起黑色，而鼻衄者，是胃气虚败，而血滞也，急用人参苏木，稍迟不救，丹溪云，产后当大补气血，即有杂症，以末治之，一切病，多是血虚，皆不可发表，景岳云，产后既有表邪，不得不解，既有火邪，不得不清，既有内伤停滞，不得不开通消导，不可偏执，如产后外感风寒，头痛身热，便实中满，脉紧数洪大有力，此表邪实症也，又火盛者，必热渴躁烦，或便结腹胀，口鼻舌焦黑，酷喜冷冻饮料，眼眵，尿痛溺赤，脉洪滑，此内热实症也，又或因产过食，致停蓄不散，此内伤实症也，又或郁怒动肝，胸胁胀痛，大便不利，脉弦滑，此气逆实症也，又或恶露未尽，瘀血上冲，心腹胀满，疼痛拒按，大便难，小便利，此血逆实症也，遇此等实症，若用大补，是养虎为患，误矣，以上四家之论，俱属产后治病扼要处，学人当细心体察，再参观叶先生医案，更能博考群书，以治产后诸病，易如反掌矣，否则如眇能视，不足以有明也，如跛能履，不能以与行也，乌得称司命哉。（秦天一）

紫石英 --- 妇人善病，而病由产后者为更多，亦为更剧，产后气血大亏，内而七情，外而六气，稍有感触，即足致病，使治之失宜，为患莫测，朱丹溪曰，产后以大补气血为主，虽有他症，以末治之，此语固为产后症之宗旨，而症实多端，论其常，未尽其变也，医者惟辨乎脉候，以明内外之因，审乎阴阳，以别虚实之异，病根透彻，而施治自效，慎毋以逐瘀为了事，亦毋以温补为守经，今观先生案中，凡内因之实症，未尝不用攻治之剂，然如热炽昏乱，有似恶露冲心者，先生则曰，阴气下泄，阳气上冒，从亡阳汗出谵语例，为救逆法，如少腹冲及心脘，痛而胀满，有似肝气犯胃者，先生则曰，产后下虚，厥气上攻，惟用柔阳之药，如头痛汗出烦渴，有似感冒风寒者，先生则曰，开泄则伤阳，辛热则伤阴，从仲景新产郁冒之治以立方，至于奇经八脉，为产后第一要领，盖八脉丽于下，产后阴分一伤，而八脉自失所司，温补镇摄，在所必先，无奈世人罕知，即有一二讲论者，终属影响模糊，惟先生于奇经之法，条分缕析，尽得其精微，如冲脉为病，用紫石英以为镇逆，任脉为病，用龟板以为静摄，督脉为病，用鹿角以为温煦，带脉为病，用当归以为宣补，凡用奇经之药，无不如芥投针，若夫外因为病者，风温入肺，用苇茎汤甘寒淡渗，以通肺气，遇寒腹痛，用当归桂枝汤，辛甘化阳，以和营卫，暑气上干，则阴虚是本病，暑热是客气，清上勿致碍下，便是理邪，如湿伤脾阳，而饮邪阻气，用苦温淡渗之品，泽术汤治之，热蒸化燥而胃阻肠痹，用首乌麻仁麦冬花粉清滋润燥之剂治之，热乘阴虚而入营中，则忌表散清克，惟育阴可以除热，更如邪入营络而成疟症，不得发汗腻补，当以轻清和解为主，要之先生于内因之症，一一寻源探本，非同俗手漫谓补虚，于外因之端，种种审变达权，不以产后自为荆棘，惟读书多而胸具灵机，故于丹溪本末二字，尤为神化无迹，此所谓知其要者，一言而终，不知其要者，流散无穷也，案中诸症甚多，学人果能悟焉，则一以贯之矣。（龚商年）

熟地 --- 徐评 近来诸医，误信产后属寒之说，凡产后无不用炮姜熟地肉桂人参等药，不知产后血脱，孤阳独旺，虽石膏竹茹，仲景亦不禁用，而世之庸医，反以辛热之药戕其阴而益其火，无不立毙，我见甚多，案中绝无此弊，足征学有渊源，惟喜用人参，而少用血药，消痰清胃之法，尚未见及，则有未到也，胎产之后，总由营虚大脱，不论有邪无邪，必养血为主，其去瘀消痰降火驱风种种治法，皆从血分中推详变化，不离本官，案中诸方多随见施，竟有不似产后之方者，此非专门之故也。</D>