某（六一） 高年卫阳式微，寒邪外侵，引动饮邪，上逆咳嗽，形寒，仲景云，治饮不治咳，当以温药通和之。（外寒引动宿饮上逆）

杏仁（三钱） 粗桂枝（一钱） 淡干姜（一钱半） 茯苓（三钱） 苡仁（三钱） 炙草（四分）

周 向有耳聋鸣响，是水亏木火蒙窍，冬阳不潜，亦属下元之虚，但今咳聋，喉下有痰音，胁痛，卧着气冲，乃冲阳升而痰饮泛，脉浮，当此骤冷，恐有外寒引动内饮，议开太阳以肃上。

云茯苓 粗桂枝 干姜 五味（同姜打） 白芍 炙草

当午时服。

某（二一） 新凉外束，肺受寒冷，气馁不降，宿饮上干，而病发矣，法当暧护背心，宿病可却。

淡生姜粉 半夏 蛤蜊粉 茯苓 桂枝木

某（五十） 背寒咳逆，此属饮象，先当辛通饮邪，以降肺气。（饮上逆肺气不降）

鲜枇杷叶 杏仁 茯苓 橘红 生姜 半夏

某（五二） 脉右大弦，气喘，咳唾浊沫，不能着枕，喜饮汤水，遇寒病发，此属饮邪留于肺卫，如见咳，投以清润，愈投愈剧矣。

葶苈子 山东大枣

徐（氏） 痰饮上吐，喘不得卧，乃温邪阻蔽肺气，气不下降，壅滞不能着右，议用宣通，开气分方法。

小青龙去细辛、麻黄，加苡仁、白糖、炒石膏。

沈（妪） 冬温，阳不潜伏，伏饮上泛，仲景云，脉沉属饮，面色鲜明为饮，饮家咳甚，当治其饮，不当治咳，缘高年下焦根蒂已虚，因温暖气泄，不主收藏，饮邪上扰乘肺，肺气不降，一身之气交阻，熏灼不休，络血上沸，经云，不得卧，卧则喘甚痹塞，乃肺气之逆乱也，若以见病图病，昧于色诊候气，必致由咳变幻，腹肿胀满，渐不可挽，明眼医者，勿得忽为泛泛可也，兹就管见，略述大意，议开太阳，以使饮浊下趋，仍无碍于冬温，从仲景小青龙越婢合法。

方（氏） 冷暖失和，饮泛气逆，为浮肿喘咳，腹胀，卧则冲呛，议用越婢方。

施（四七） 劳烦太甚胃阳受伤，外卫单薄，怯寒畏冷，食物少运痰饮内起，气阻浊凝胸背皆痛，辛甘理阳已效，当此长夏，脾胃主令，崇其生气，体旺病可全好。（脾胃阳虚）

六君子加益智木香。

黄（三四） 身居沿海，氛瘴雾露客邪，侵入清阳，阳伤畏寒，久嗽病患不知却病护身，犹然用力承办，里结饮邪，沉痼不却病。

胡（四六） 脉沉而微，微则阳气不足，沉乃寒水阴凝，心痛怔忡，渐及两胁下坠，由阳衰不主营运，痰饮聚气欲阻，致痛之来，其心震之谓，亦如波撼岳阳之义，议用外台茯苓饮合桂苓方。

白（二六） 脉沉小弦，为阴浊饮邪，禀质阳不充旺，胸中清气不得舒展旷达，偶触入寒冷，或误进寒物饮邪暴冷，凝结胸痞，当平日食物，忌用酒肉腥浊，便清阳流行，常服仲景苓桂术甘汤百剂，若病来因冷，即服大顺散。

戴 病去，神已爽慧，但本脉带弦，平素有饮，为阳气不足之体，年纪渐多，防有风痹，此酒肉宜少用，劳怒当深戒矣，议外台茯苓饮方。

朱（四九） 烦劳太过，阳伤，痰饮日聚，阳跷脉空，寤不成寐卫阳失护，毛发自坠，乃日就其衰夺矣。初进通饮浊以苏阳，接服外台茯苓饮。

吴（氏） 脉弦，背中冷，左偏微痛，食少欲呕，四肢牵强，此饮邪内结，议通阳气。

某 眩晕恶心胸脘不爽，脉右弦左弱，面色红亮，此乃痰饮上泛，有厥中之事。

炒半夏 制蒺藜 橘红 煨天麻 石菖蒲 茯苓 姜汁

尤 口中味淡，是胃阳虚，夫浊饮下降痛缓，向有饮湿为患，若不急进温通理阳，浊饮必致复聚，议大半夏汤法。

张（二七） 酒客谷少中虚，常进疏散表药，外卫之阳亦伤，其痰饮发时，胸中痞塞，自述或饥遇冷病来，其为阳气受病何疑，不必见痰搜逐，但护中焦脾胃，使阳气健运不息，阴浊痰涎，焉有窃踞之理。（脾阳不运）

生于术 川桂枝 茯苓 淡姜渣 苡仁 泽泻

王（三二） 脉沉为痰饮，是阳气不足，浊阴欲蔽，当以理脾为先，俾中阳默运，即仲景外饮治脾之意。

苓桂术甘，加半夏陈皮水法丸。

某（三四） 舌白，咳逆不渴，非饮象而何，宜宣温药和之。

杏仁 苡仁 半夏 干姜 粗桂枝 茯苓 厚朴 炙草

某 食后脘中痞阻，按之漉漉有声，手麻胁痛，心烦，耳目昏眩，是气不流行，痰饮内聚中焦。

用桂苓丸，竹沥姜汁法丸。

黄 味过甘腻，中气缓，不主运，延绵百天，聚气结饮，东垣云，病久发不焦，毛不落，不食不饥，乃痰饮为患，饮属阴类，故不渴饮，仲景五饮互异，其要言不繁，当以温药和之，通阳方法，固无容疑惑，大意外饮宜治脾，内饮治肾，是规矩准绳矣，议用苓桂术甘汤。

某 形体似乎壮实，阳气外泄，畏风怯冷，脾阳消乏，不司健运，水谷悍气，蒸变痰饮，隧道日壅，上实下虚，仲景谓饮邪当以温药和之，苓桂术甘得效，从外饮立方。

人参 淡附子 生于术 枳实 茯苓 泽泻

荆沥姜汁法丸。

某 老人久嗽妨食，议以外饮治脾。

苓桂术甘汤。

王（三四） 脉沉，背寒，心悸如坠，形盛气衰，渐有痰饮内聚，当温通补阳方复辟，斯饮浊自解。（脾肾阳虚）

人参 淡附子 干姜 茯苓 生于术 生白芍

冯 阳虚则形寒汗出，痰饮痞聚，都是阴浊成形，乘阳气衰微，致上干窃踞，古人法则，必通其阳以扫阴氛，但宿病无急攻方，况平素忧郁，气滞血涩，久耗之体，不敢纯刚，防劫液耳。

人参 熟附子 淡干姜 炒川椒 川桂枝 乌梅肉 生白芍

另真武丸三两。

程（四八） 左脉沉静，右脉微弦，四旬清阳日薄，脾脏鼓运渐迟，加以烦心萦思，水谷悍气，蕴蒸痰饮，仲景谓外饮当治脾阳，况中年常有遗泄之患，按脉非龙相之动搏，议固下益肾，转旋运脾二方，分早晚服，早服从还少聚精七宝，参用丸方。

熟地 苁蓉 枸杞 五味 萸肉 茯神 山药 菟丝 覆盆 鱼胶 菖蒲 远志 龙骨 青盐

熟蜜同枣肉捣丸，早服五七钱。

茅术 于术 半夏 茯苓 广皮 生益智 白蒺 钩藤

姜枣汤泛丸，晚服三钱，开水下。

徐 清阳未展，浊阴欲踞，久延必结痰饮，议用真武丸二钱五分，人参一钱煎汤送，胃阳得震，浊当退避矣，十服。

某 脉沉弦，饮泛呛咳，乃下虚无以制上，议早服肾气丸，摄纳下焦散失，以治水泛之饮，午服外台茯苓饮，转旋中焦，使食不致酿痰，茯苓饮去术。

某（七一） 高年久嗽，脉象弦大，寤不成寐，乃阳气微漓，浊饮上泛，仲景云，进温药和之。（脾胃阳虚饮逆咳呕）

杏仁（三钱） 茯苓（三钱） 川桂枝（一钱） 生姜（一钱） 苡仁（三钱） 炙草（四分） 大枣（二枚）

顾（二四） 咳嗽数月，呕出涎沫，建中不应，已非营卫损伤，视其面色鲜明，饮食仍进，仿饮邪主治。

小半夏汤加桂枝杏仁姜汁。

李（三八） 劳伤阳气，内起痰饮，卧着气钝饮阻，其咳为多，痰出稍通势缓，且体常汗泄，非风寒表邪不解，并不热渴，亦非火炎烁金，仲景云，饮家而咳，当治饮，不当治咳。

陈 脉涩小，舌白不渴，身动呕痰，身如在舟车中，此寒热攻胃致伤，逆气痰饮互结，通补阳明为正，白术甘草守中，未能去湿，宜缓商。

人参汁 半夏 枳实汁 茯苓 竹沥 姜汁

马（三四） 肌肉丰溢，脉来沉缓，始发右季胁痛，汤饮下咽，汩汩有声，吐痰涎头痛，此皆脾胃阳微，寒湿滞聚，年方壮盛，不必介怀，温中佐其条达，运通为宜。

茅术 厚朴 半夏 茯苓 陈皮 淡姜渣 胡芦巴 炙草

马（四十） 甘缓颇安，辛泄不受，此阳分气衰，将来饮邪日聚，然卧着咳多，清气失旋，先用苓桂术甘汤，继进外台茯苓饮。

曹（四七） 中年阳气日薄，痰饮皆属阴浊，上乾清道，为冲逆咳嗽，仲景治法，外饮治脾，内饮治肾，分晰甚明，昔年曾用桂苓泽术得效，是治支饮治法，数年真气更衰，古人谓饮邪当以温药和之，须忌治嗽肺药，先用小青龙去麻、辛，接服外台茯苓饮。

程（五七） 昔肥今瘦为饮，仲景云，脉沉而弦，是为饮家，男子向老，下元先亏，气不收摄，则痰饮上泛，饮与气涌，斯为咳矣，今医见嗽，辄以清肺降气消痰，久而不效，更与滋阴，不明痰饮皆属浊阴之化，滋则堆砌助浊滞气，试述着枕咳呛一端，知身体卧着，上气不下，必下冲上逆，其痰饮伏于至阴之界，肾脏络病无疑，形寒畏风，阳气微弱，而藩篱疏撤，仲景有要言不烦曰，饮邪必用温药和之，更分外饮治脾，内饮治肾，不读圣经，焉知此理。（脾肾阳虚饮逆咳呕）

桂苓甘味汤熟附都气加胡桃。

陈 痛久气乱，阳微，水谷不运，蕴酿聚湿，胃中之阳日薄，痰饮水湿，必倾囊上涌，而新进水谷之气，与宿邪再聚复出，致永无痊期，仲景云，饮邪当以温药和之，又云不渴者，此为饮邪未去故也，则知理阳通阳，诚有合于圣训，断断然矣。

真武汤。

张（四一） 痰饮喘咳，肌肉麻痹，痞胀不堪纳谷，冬寒日甚，春暖日减，全是阳气已衰，阴浊逆干犯上，肺药治嗽，无非辛泄滋润，盖辛散则耗阳，滋清助阴浊，浊阻在阳分，气不肃，为夜不得卧，小青龙意，主乎由上以泄水寒，直从太阳之里以通膀胱，表中里药也，仲景谓饮邪当以温药和之，驱阴邪以复阳，一定成法。

早肾气去萸换白芍，炒楂炭水法丸，晚外台茯苓饮，姜枣汤法丸。

程（六十） 肾虚不纳气，五液变痰上泛，冬藏失职，此病为甚，不可以肺咳消痰，常用八味丸，收纳阴中之阳，临时撤饮，用仲景桂苓味甘汤。

孙 未交冬至，一阳来复，老人下虚，不主固纳，饮从下泛，气阻升降，而为喘嗽，发散寒凉苦泻诸药，焉得中病，仲景云饮家而咳，当治饮，不当治咳，后贤每每以老人喘嗽，从脾肾温养定论，是恪遵圣训也。

甘草汤代水，加淡姜枣。

李 肠红久病，不必攻治，今者气冲喘嗽，脘胁痞阻，是饮浊上僭，最宜究悉。

川桂枝（七分） 茯苓（三钱） 干姜（一钱） 五味子（同姜合捣一钱） 杏仁（一钱半） 白芍（一钱） 炙草（五分） 生左牡蛎（三钱）

吴（二七） 壮年下元久虚，收纳气泄，每交秋冬受冷，冷气深入，伏饮夹气上冲，为咳喘呕吐，疏肺降气不效者，病在肾络中也，盖精血少壮不旺，难以搜逐，病根不去谓此，绝欲一年，小暑艾灸，静养一百二十天可愈，附都气加车前。（肾阳虚饮逆喘咳呕）

潘（二九） 劳力喘甚，肩背恶寒，饮泛上逆，皆系下元虚损，莫以喘用泻肺等药。

薛氏八味丸。

王 秋深天气收肃，背寒喘咳，饮浊上泛，缘体中阳气少振，不耐风露所致，最宜暖护背部，进通阳以治饮。

陈 脉虚微，春阳地升浊阴上干，喘不得卧，治在少阴。

人参 淡熟附子 猪胆汁

人参 生于术 淡附子 茯苓 泽泻

董 脉弦右濡，阳微恶寒，饮浊上干，咳吐涎沫，且食减胃衰，寒疝窃踞，阴浊见症，岂止一端，喻嘉言谓浊阴上加于天，非离照当空，氛雾焉得退避，反以地黄五味阴药附和其阴，阴霾冲逆肆虐，饮邪滔天莫制，议以仲景熟附配生姜法，扫群阴以驱饮邪，维阳气以立基本，况尊年尤宜急护真阳为主。

人参 茯苓 熟附子 生姜汁 南枣

戴 十二月间，诊得阳微，浊饮上干为咳，不能卧，曾用小青龙汤，减去麻黄细辛，服后已得着枕而卧，想更医接用不明治饮方法，交惊蛰阳气发泄，病势再炽，顷诊脉来濡弱无神，痰饮咳逆未已，谅非前法可效，宗仲景真武汤法，以熟附配生姜，通阳逐饮立法。

真武汤去白术，加人参。

计 不卧呛喘，泛起白沫，都是肾病，议通太阳膀胱。（肾阳虚膀胱气化不通降）

茯苓 川桂枝 淡干姜 五味子 白芍 炙草

顾 饮邪泛溢，喘嗽，督损头垂，身动喘甚，食则脘中痞闷，卧则喘咳不得息，肺主出气，肾主纳气，二脏失司，出纳失职，议用早进肾气丸三钱，以纳少阴，晚用小青龙法，涤饮，以通太阳经腑，此皆圣人内饮治法，与乱投腻补有间矣。

小青龙去麻辛甘芍，加茯苓杏仁大枣。

某 形盛面亮，脉沉弦，此属痰饮内聚，暮夜属阴，喘不得卧，仲景谓饮家而咳，当治其饮，不当治咳，今胸满腹胀，小水不利，当开太阳以导饮逆，小青龙去麻辛合越婢。

某 服三拗汤，音出喘缓，可见苦寒沉降之谬，素多呕逆下血，中焦必虚，而痰饮留伏显然，议治其饮。

桂枝汤去甘草，加杏仁茯苓苡仁糖炒石膏。

某 太阳经气不开，小水不利，下肢肿浮渐上，着枕气塞欲坐，浊饮上干，竟有坐卧不安之象，医者但以肺病刻治，于理未合，急用小青龙法，使膀胱之气无阻碍，浊饮痰气自无逆冲之患矣。

章 伏饮阴浊上干，因春地气主升而发，呕吐不饥，自然脾胃受伤，六君子宣补方法，未尝不妙，今诊得吸气甚微，小溲晨通暮癃，足跗浮肿，其腑中之气开阖失司，最虑中满，夫太阳司开，阳明司阖，浊阴弥漫，通腑即是通阳，仿仲景开太阳一法。

张（二七） 呛喘哮，坐不得卧，神迷如呆，气降则清，水寒饮邪，上冲膻中，用逐饮开浊法。（寒饮浊邪上冲膻中）

姜汁炒南星 姜汁炙白附子 茯苓 桂枝 炙草 石菖蒲

某（三四） 咳缓，痰少，脘中不爽，肌腠瘙痒，皆湿邪未尽，痰饮窃踞之象，当用六安法。（肺胃湿痰）

杏仁 白芥子 炒半夏 茯苓 淡干姜 橘红

王 当年阳虚，浊饮上泛喘急，用真武汤丸而效，因平素嗜酒少谷，中虚湿聚，热蕴蒸痰，目黄龈血，未可为实热论治，议方用外台茯苓饮，减甘草佐以微苦，清渗理其湿热，以酒客忌甜故也。（中虚湿热）

金石斛八两，煮汁为丸。

汪 面色鲜明，脘中漾漾欲呕，因郁勃热气，蒸为痰饮，宜暂缓参术，务清中焦热痰。（中焦痰热）

杏仁 枳实汁 橘红 瓜蒌皮 郁金 半夏曲 桔梗 黑栀皮

张（氏） 痰饮挟燥，咳，喉中痒。（痰饮挟燥）

陈（妪） 痰饮挟气火上踞，脘痞胀不爽，宜理气热。（气火不降）

半夏 茯苓 瓜蒌皮 黑栀皮 橘红 郁金

某 脉弦右涩，面亮舌白，口干不喜饮，头重岑岑然，胸脘痹塞而痛，得嗳气稍舒，酒客谷少中虚，痰饮聚蓄，当此夏令，地气上升，饮邪挟气上阻清空，遂令前症之来，金匮云，脉弦为饮，色鲜明者为留饮，口干不欲饮水者，此为饮邪未去故也，况漐漐汗出，岂是风寒？春夏温邪，辛温发散为大禁，自云身体空飘，年已六旬又四，辛散再泄其阳，不亦左乎。

潘（三八） 远客路途，风寒外受，热气内蒸，痰饮日聚于脏之外，络脉之中，凡遇风冷，或曝烈日，或劳碌形体，心事不宁，扰动络中宿饮，饮泛气逆，咳嗽，气塞喉底胸膈，不思食物，着枕呛吐稠痰，气降自愈，病名哮喘伏饮，治之得宜，除根不速，到老年岁，仍受其累耳。（哮喘伏饮）

小青龙汤去细辛。

童（五六） 背寒，短气，背痛映心，贯胁入腰，食粥噫气脘痞，泻出黄沫，饮邪伏湿，乃阳伤窃发，此温经通络为要，缓用人参。（饮伏经络）

川桂枝 生白术 炒黑蜀漆 炮黑川乌 厚朴 茯苓

叶（四十） 脉右弦，舌黄不渴，当心似阻，昔形壮，今渐瘦，咳久不已，卧着则咳，痰出稍安，此清阳少旋，支脉结饮，议通上焦之阳。（胸次清阳少旋支脉结饮）

鲜薤白 瓜蒌皮 半夏 茯苓 川桂枝 姜汁

杨 头中冷痛，食入不消，筋脉中常似掣痛，此皆阳微不主流行，痰饮日多，气隧日结，致四末时冷，先以微通胸中之阳。

干薤白 桂枝 半夏 茯苓 瓜蒌皮 姜汁

程（三三） 支脉聚饮，寒月喘甚，初因寒湿而得，故食辛稍安。（支脉结饮）

赵 支饮，胁痛咳逆。

小青龙去麻辛。

汪（氏） 支脉结饮，阻气喘胀，入胁则痛，厥逆为眩。

茯苓 桂枝 半夏 杏仁 郁金 糖炒石膏

黄 支脉结饮，发必喘急，病发用。

冯 悬饮流入胃中，令人酸痛，涌噫酸水，当辛通其阳以驱饮。（悬饮）

桂枝木 半夏 茯苓 炒黑川椒 姜汁

施 诊脉右虚，左小弦，面色黄，少华采，左胁肋痛，五六年未愈，凡久恙必入络，络主血，药不宜刚，病属内伤，勿事腻补，录仲景旋覆花汤，加柏子仁归须桃仁。

服苦药痛呕，可知胃虚，以参苓阖阳明，用草桂开太阳，并辛香入络，用姜枣通营卫，生姜恐伐肝，故取煨以护元气，而微开饮气也。

某 夏季阳气大升，痰多呛咳，甚至夜不得卧，谷味皆变，大便或溏或秘，诊脉右大而弦，议以悬饮流入胃络，用开阖导饮法。

大半夏汤加炒黑川椒。

<D>内经止有积饮之说，本无痰饮之名，两汉以前谓之淡饮，仲景始分痰饮，因有痰饮悬饮溢饮支饮之义，而立大小青龙半夏苓桂术甘肾气等汤，以及内饮外饮诸法，可谓阐发前贤，独超千古，与后人所立风痰湿痰热痰酒痰食痰之法迥异，总之痰饮之作，必由元气亏乏，及阴盛阳衰而起，以致津液凝滞，不能输布，留于胸中，水之清者悉变为浊，水积阴则为饮，饮凝阳则为痰，若果真元充足，胃强脾健，则饮食不失其度，营运不停其机，何痰饮之有，故仲景云，病痰饮者，当以温药和之，乃后人不知痰饮之义，妄用滚痰丸，茯苓丸，消痰破气，或滋填腻补等法，大伤脾胃，堆砌助浊，其于仲景痰饮之法，岂不大相乖谬乎，然痰与饮，虽为同类，而实有阴阳之别，阳盛阴虚，则水气凝而为痰，阴盛阳虚，则水气溢而为饮，故王晋三先生取仲景之小半夏茯苓，及外台饮三汤，从脾胃二经分痰饮立治法，而先生又取仲景之苓桂术甘，外台茯苓饮，肾气丸，真武汤，分内饮外饮治法，而于痰饮之症，无遗蕴矣，愚历考先生治痰饮之法，则又有不止于此者，然而病变有不同，治法亦有异，如脾肾阳虚，膀胱气化不通者，取仲景之苓桂术甘汤，茯苓饮，肾气真武等法，以理阳通阳，及固下益肾，转旋运脾为主，如外寒引动宿饮上逆，及膀胱气化不通，饮逆肺气不降者，以小青龙合越婢等法，开太阳膀胱为主，如饮邪伏于经络，及中虚湿热成痰者，则有川乌蜀漆之温经通络，外台茯苓饮去甘草，少佐苦辛清渗理湿之法，其饮邪上冲膻中，及悬饮流入胃中而为病者，又有姜附南星菖蒲旋复川椒等，驱饮开浊，辛通阳气等法，丝丝入扣，一以贯之，病情治法，胸有成竹矣，非深于得道者，其孰能之。（邹滋九） </D>