[
  [
    {
      "type": "text",
      "value": "某（二二） 客邪外侵，头胀，当用辛散。（寒邪客肺）"
    },
    {
      "type": "text",
      "value": "苏梗 杏仁 桔梗 桑皮 橘红 连翘"
    }
  ],
  [
    {
      "type": "text",
      "value": "某 寒热，头痛脘闷。"
    },
    {
      "type": "text",
      "value": "淡豆豉 嫩苏梗 杏仁 桔梗 厚朴 枳壳"
    }
  ],
  [
    {
      "type": "text",
      "value": "某（五二） 复受寒邪，背寒，头痛，鼻塞。（风寒伤卫）"
    },
    {
      "type": "text",
      "value": "桂枝汤加杏仁。"
    }
  ],
  [
    {
      "type": "text",
      "value": "某（十九） 时邪外袭，卫痹发热，头痛，先散表邪。（寒邪兼湿）"
    },
    {
      "type": "prescriptionItems",
      "value": [
        {
          "herb": "淡豆豉"
        },
        {
          "herb": "苏梗"
        },
        {
          "herb": "杏仁"
        },
        {
          "herb": "厚朴"
        },
        {
          "herb": "木防己"
        },
        {
          "herb": "茯苓"
        }
      ]
    }
  ],
  [
    {
      "type": "text",
      "value": "杨（四二） 太阳脉行，由背抵腰，外来风寒，先伤阳经，云雾自下及上，经气逆而病发，致呕痰涎头痛，小溲数行病解，膀胱气通，斯逆者转顺矣，当通太阳之里，用五苓散，倘外感病发再议。（寒客太阳膀胱经气逆）"
    }
  ],
  [
    {
      "type": "text",
      "value": "某（二八） 劳伤阳气，形寒身热，头疼脘闷，身痛。（劳倦阳虚感寒）"
    },
    {
      "type": "text",
      "value": "杏仁（三钱） 川桂枝（八分） 生姜（一钱） 厚朴（一钱） 广皮（一钱） 茯苓皮（三钱）"
    }
  ],
  [
    {
      "type": "text",
      "value": "<D>伤寒症，仲景立法于前，诸贤注释于后，先生虽天资颖敏，若拟其治法，恐亦不能出仲景范围，其所以异于庸医者，在乎能辨症耳，不以冬温春温风温温热湿温伏暑内伤劳倦瘟疫等症，误认为伤寒，其治温热暑湿诸症，专辨邪之在卫在营，或伤气分，或伤血分，更专究三焦，故能述前人温邪忌汗，湿家忌汗，当用手经之方，不必用足经之药等明训，垂示后人，此乃先生独擅见长之处也，若夫伤寒之书，自成无己注解以后，凡注疏者不啻数百家，其尤着者，如嘉言三书，景岳书，伤寒三注四注等篇，近有柯韵伯来苏集，伤寒论翼方翼，王晋三古方选注中所解一百十三方，诸家析疑辨义处，虽稍有异同，然皆或登仲景之堂，或造仲景之室者，业医者，当日置案头，潜心参究，庶乎临症可无误矣。（华岫云）"
    },
    {
      "type": "text",
      "value": "伤寒一症，内经云，热病者，皆伤寒之类也，又曰，凡病伤寒而成温者，先夏至日者为病温，后夏至日者为病暑，又曰，冬伤于寒，春必病温，其症有六经相传，并病合病，两感直中，难经又言伤寒有五，有中风，有伤寒，有湿温，有热病，有温病，其所苦各不同，再加以六淫之邪，有随时互相兼感而发之病，且其一切现症，则又皆有头痛发热，或有汗无汗，或恶风恶寒，不食倦卧烦渴等，则又大略相同，故其症愈多，其理愈晦，毋怪乎医者临症时，不能灼然分辨，即其所读之书，前人亦并无至当不易之论，将灵素难经之言，及一切外感之症，逐一分晰辨明，使人有所遵循，故千百年来，欲求一鉴垣之士，察六淫之邪，毫不紊乱者，竟未见其人，幸赖有仲景之书，以六经分症，治以汗吐下和寒温诸法，故古人云仲景之法，不但治伤寒，苟能悉明其理，即治一切六气之病与诸杂症，皆可融会贯通，无所不宜，此诚属高论，固深知仲景者也，然余谓六淫之邪，头绪甚繁，其理甚奥，即汇集河间东垣丹溪，及前贤辈诸法而治之，犹虑未能兼括尽善，若沾沾焉，必欲但拘仲景之法而施治，此乃见闻不广，胶柱鼓瑟，不知变通者矣，今观叶氏之书，伤寒之法，固属无多，然其辨明冬温春温风温温热湿温之治，实超越前人，以此羽翼仲景，差可嘉惠后学，观者幸毋忽诸。（华玉堂）"
    },
    {
      "type": "text",
      "value": "徐评 此即俗名著寒之症，偶尔受寒之小疾，不入经络之病也，何必牵引伤寒大症，发诸议论，及细阅此编，竟无治伤寒一门，即此数方为伤寒之法，不禁失笑，夫医者之学问，全在明伤寒之理，则万病皆通，故仲景之书只有二种，伤寒论治伤寒之法也，金匮治杂症之法也，而金匮之方，则又半从伤寒论中来，则伤寒乃病中之第一症，而学医者之第一功夫也，今此编独阙此一门，则平日所习何书，所治何病耶，此老数十年医道大行，岂无数千百大症经手，乃竟只录此数方以了局，此非此老之过，乃编书之人胸中茫无定见耳。</D>"
    }
  ]
]