某（二十） 脉数暮热，头痛腰疼，口燥，此属温邪。（温邪入肺）

某 温邪化热，肺痹喘急，消渴胸满，便溺不爽，肺与大肠见症。

谢 积劳伤阳，卫疏，温邪上受，内入乎肺，肺主周身之气，气窒不化，外寒似战栗，其温邪内郁，必从热化，今气短胸满，病邪在上，大便泻出稀水，肺与大肠表里相应，亦由热迫下泄耳，用辛凉轻剂为稳。

龚 襁褓吸入温邪，酿为肺胀危症。

施 久患虚损，原寝食安舒，自服阴柔腻补，不但减食不寐，脘中常闷，渴欲饮凉，此口鼻吸入温邪，先干于肺，误补则邪愈炽，气机阻塞，弱质不敢开泄，援引轻扬肃上，兼以威喜丸，淡以和气，上焦得行，可进养胃法。

兼服威喜丸。

王 温邪发热，津伤，口糜气秽。（温邪劫津）

某 春温身热，六日不解，邪陷劫津，舌绛，骨节痛，以甘寒熄邪。

竹叶心 知母 花粉 滑石 生甘草 梨皮

丁 口鼻吸入热秽，肺先受邪，气痹不主宜通，其邪热由中及于募原，布散营卫，遂为寒热，既为邪踞，自然痞闷不饥，虽邪轻未为深害，留连不已，热蒸形消，所谓病伤，渐至于损而后已。（热伤胃津）

桂枝白虎汤。

杨 伏邪发热，烦渴，知饥无寐，乃胃津受伤所致。

拟进竹叶石膏汤加花粉。

叶 热伤气分，用甘寒方。白虎汤加竹叶。

某 右脉未和，热多口渴，若再劫胃汁，怕有脘痞不饥之事，当清热生津，仍佐理痰，俟邪减便可再商。

叶（二八） 仲景云，阴气先伤，阳气独发，不寒瘅热，令人消烂肌肉，条例下不注方，但曰以饮食消息之，后贤谓甘寒生津，解烦热是矣，今脉数，舌紫渴饮，气分热邪未去，渐次转入血分，斯甘寒清气热中，必佐存阴，为法中之法。

毛（六十） 温邪热入营中，心热闷，胁肋痛，平素痰火，与邪胶结，致米饮下咽皆胀，老年五液已涸，忌汗忌下。（热入心营）

马 少阴伏邪，津液不腾，喉燥舌黑，不喜饮水，法当清解血中伏气，莫使液涸。

陈（妪） 热入膻中，夜烦无寐，心悸怔，舌绛而干，不嗜汤饮，乃营中之热，治在手经。

张 营络热，心震动。

复脉汤去姜桂参加白芍。

陆（六九） 高年热病，八九日，舌燥烦渴，谵语，邪入心胞络中，深怕液涸神昏，当滋清去邪，兼进牛黄丸，驱热利窍。（热邪入心胞）

胡 脉数，舌赤耳聋，胸闷，素有痰火，近日冬温，引动宿病，加以劳复，小溲不利，议治胞络之热。

顾 温邪误表劫津，邪入胞络内闭，至宝丹。

王 吸入温邪，鼻通肺络，逆传心胞络中，震动君主，神明欲迷，弥漫之邪，攻之不解，清窍既蒙，络内亦痹，幼科不解，投以豁痰降火理气，毫无一效，忆平脉篇，清邪中上，肺位最高，既入胞络，气血交阻，逐秽利窍，须藉芳香，议用局方至宝丹。

施 温邪如疟，阴气先伤，苦辛再伤阳及胃，内风肆横，肢掣瘛疭，邪闭心胞络中，痰潮神昏，乃热气蒸灼，无形无质，此消痰消食清火，竟走肠胃，与病情隔靴搔痒，速速与至宝丹三分，冷开水调服，若得神清，再商治法。

顾 饮酒又能纳谷，是内风主乎消烁，当春尽夏初，阳气弛张，遂致偏中于右，诊脉左弦且坚，肌腠隐约斑点，面色光亮而赤，舌胎灰黄，其中必夹伏温邪，所怕内闭神昏，治法以清络宣窍，勿以攻风劫痰，扶助温邪，平定廓清，冀其带病久延而已。

犀角 生地 玄参 连翘心 郁金 小青叶 竹叶心 石菖蒲

至宝丹四丸，匀四服，凉开水，调化。

包 老年下虚，春温上受，痰潮昏谵，舌绛黄苔，面赤微痉，先清上焦。（热邪闭窍神昏）

天竺黄 金银花 竹叶心 连翘 竹沥

张 温邪自里而发，喉肿口渴，舌心灰滞，上焦热蒙，最怕窍闭昏痉，苦寒直降，攻其肠胃，与温邪上郁无涉。

连翘 黑栀皮 牛蒡子 杏仁 花粉 马勃 瓜蒌皮 夏枯草 金汁 银花露

张 周岁内，未得谷味精华，温邪吸入，上焦先受，头面颐颔肿浮，邪与气血混处，刀针破伤经络，温邪内闭热壅，蔓延三焦，昏寐痰潮，舌刺卷缩，小溲点滴混浊，热气结锢在里，但膏连芩栀之属，药性直降，竟由胃达肠，而热气如烟如雾，原非形质可荡可扫，故牛黄产自牛腹，原从气血而成，混处气血之邪，藉此破其蕴结，是得效之因由也，夫温热时疠，上行气分，而渐及于血分，非如伤寒足六经，顺传经络者，大抵热气鸱张，必熏塞经络内窍，故昏躁皆里窍之欲闭，欲宣内闭，须得芳香，气血久郁，必致疡毒内攻，谨陈大意参末议，用紫雪丹三分，微温开水调服。

褚 温邪中自口鼻，始而入肺，为咳喘，继传膻中则呛血，乃心营肺卫受邪，然邪在上焦，壅遏阻气，必聚为热，痰臭呛渴，是欲内闭，惜不以河间三焦立法，或谓伤寒主六经，或谓肺痈专泄气血，致热无出路，胸突腹大，危期至速矣，即有对病药饵，气涌沸腾，势必涌吐无余，焉望有济，夫温热秽浊，填塞内窍，神识昏迷，胀闷欲绝者，须以芳香宣窍，佐牛黄金箔深入脏络，以搜锢闭之邪，今危笃若此，百中图一而已。

紫雪丹。

陈 温邪逆传膻中，热痰蔽阻空窍，所进寒凉消导，徒攻肠胃，毫无一效，痰乃热熏津液所化，膻中乃空灵之所，是用药之最难，至宝丹芳香，通其神明之窍，以驱热痰之结极是，但稚年受温邪，最易阴亏津耗，必兼滋清以理久伏温邪为正。

化服至宝丹。

某 湿为渐热之气，迷雾鬲间，神机不发，三焦皆被邪侵，岂是小恙，视其舌伸缩如强，痰涎粘着，内闭之象已见，宣通膻中，望其少苏，无暇清至阴之热。

至宝丹四分，石菖蒲金银花汤送下。

王（十八） 夜热早凉，热退无汗，其热从阴而来，故能食，形瘦，脉数左盛，两月不解，治在血分。（热陷血分）

生鳖甲 青蒿 细生地 知母 丹皮 淡竹叶

许 温邪已入血分，舌赤音低，神呆潮热，即发斑疹，亦是血中热邪，误汗消食，必变昏厥。

张 舌绛裂纹，面色枯槁，全无淖泽，形象畏冷，心中热焚，邪深竟入厥阴，正气已经虚极，勉拟仲景复脉汤，合乎邪少虚多治法。（热入厥阴）

复脉去人参生姜，加甘蔗汁，代水煎。

复脉汤去桂，加人参甘蔗汁，代水煎药。

生白芍 炙甘草 阿胶 鸡子黄 人参 生地 麦冬 炒麻仁

某 误下热陷于里，而成结胸，所以身不大热，但短气胸满烦躁，此皆邪热内燔，扰乱神明，内闭之象，棘手重恙，仿仲景泻心法，备参末议，再候明眼定裁。（误下热陷成结胸）

川连 黄芩 半夏 炮淡干姜 生姜 枳实

吴 神气如迷，不饥不食，乃苦辛消导发散，劫夺胃津所致，盖温邪手经为病，今世多以足六经主治，故致此。（误治伤胃津液）

王（妪） 温热十三日，舌黄，心中闷痛，初病手经，不当用足经方，老人怕其液涸，甘寒醒胃却热。

吴（十五） 近日天未寒冷，病虚气不收藏，所感之邪谓冬温，参苓益气，薄荷桔梗杏仁泄气，已属背谬，加补骨脂温涩肾脏，尤不通之极，自述夜寐深更，漐漐有汗，稚年阴不充，阳易泄，论体质可却病。（冬温伤液）

糯米汤煎药。

陈（半岁） 冬温入肺，胶痰化热，因未纳谷之身，不可重药消痰通利。

某 脉数右大，烦渴舌绛，温邪，气血两伤，与玉女煎。（气血两伤）

陈（二三） 阴虚温邪，甘寒清上。（阴虚感温邪）

关 阴虚挟温邪，寒热不止，虽不宜发散消食，徒补亦属无益，拟进复脉汤法。

青甘蔗汁煎。

黄 体虚，温邪内伏，头汗淋漓，心腹窒塞，上热下冷，舌白烦渴，春阳升举为病，犹是冬令少藏所致，色脉参视，极当谨慎。

张（五五） 劳倦内伤，温邪外受，两月不愈，心中温温液液，津液无以上供，夜卧喉干燥，与复脉汤去姜桂参，三服后可加参。（劳倦感温阴液燥）

汪 劳倦更感温邪，阳升头痛，寒热战栗，冷汗邪虽外达，阳气亦泄致神倦欲眠，舌赤黄胎，口不知味，当以育阴除热为主，辛散苦降非宜。

复脉汤去参姜桂麻加青甘蔗浆。

曹 脉促数，舌白不饥，寒热汗出，初起腹痛，脐右有形，乃久伤劳倦，复感温邪，今病两旬又六，微咳有痰，并不渴饮，寒来微微齿痉，此营卫二气大衰，恐延虚脱，议固卫阳，冀寒热得平。（劳倦感温，营卫胃阳兼虚。）

陈 热病后，不饥能食，不寐，此胃气不和。（病退胃不和）

华（五五） 口鼻受寒暄不正之气，过募原，扰胃系，寒热已罢，犹不饱不饥，舌边赤，中心黄，余邪未清，食入变酸，乃邪热不胜谷，以温胆和之，半曲温胆去甘草茯苓枳实，加郁金黑山栀。

林（氏） 腹满已久，非是暴症，近日面颔肿胀，牙关紧闭，先有寒热，随现是象，诊脉右搏数，左小，乃温邪触自口鼻，上焦先受，气血与热胶固，致清窍不利，倏有痹塞之变，理当先治新邪，况头面咽喉结邪，必辛凉轻剂以宣通，若药味重浊，徒攻肠胃矣，仿东垣普济消毒意。（热毒壅结上焦）

连翘 牛蒡子 马勃 射干 滑石 夏枯草 金银花露 金汁

席 脉左数，右缓弱，阳根未固，阴液渐涸，舌赤微渴，喘促自利溲数，晡刻自热，神烦呓语，夫温邪久伏少阴，古人立法，全以育阴祛热，但今见症，阴分固有伏邪，真阳亦不肯收纳，议仿刘河间浊药轻投，不为上焦热阻，下焦根蒂自立，冀其烦躁热蒸渐缓。（阴虚邪伏）

熟地炭 茯苓 淡苁蓉 远志炭 川石斛 五味子

饮子煎法。

生地炭 玄参心 川石斛 炒麦冬 犀角 石菖蒲

三才加茯神黄柏金箔，晚进周少川牛黄清心丸一服。

程（二八） 温热病，已伤少阴之阴，少壮阴未易复者，恰当夏令发泄，百益酒酿造有灰，辛热劫阴泄气，致形体颓然，药难见效，每日饵鸡距子生用，其汤饮用马料豆汤。（邪热兼酒热伤阴）

<D>冬伤于寒，春必病温者，重在冬不藏精也，盖烦劳多欲之人，阴精久耗，入春则里气大泄，木火内燃，强阳无制，燔燎之势，直从里发，始见必壮热烦冤，口干舌燥之候矣，故主治以存津液为第一，黄芩汤坚阴却邪，即此义也，再者在内之温邪欲发，在外之新邪又加，葱豉汤最为快捷方式，表分可以整肃，至于因循贻误，岂止一端，或因气燥津枯，或致阴伤液涸，先生用挽救诸法，如人参白虎汤，黄连阿胶汤，玉女煎，复脉法，申明条例甚详，余则治痉厥以甘药缓肝，昏闭用幽芳开窍，热痰之温胆，蓄血而论通瘀，井井有条，法真周到。（邵新甫）

徐评 细详诸案，俱是热邪误治入脏之坏症居多，时邪温热之症绝少。</D>