大豆黄卷 --- 西瓜翠衣 川白通草 大豆黄卷 马兜铃 射干 苡仁

川贝母 --- 嫩竹叶 连翘 飞滑石 野郁金汁 大杏仁 川贝母

黑山栀 --- 连翘 飞滑石 嫩竹叶 荷叶边汁 桑叶 杏仁 象贝 黑山栀

竹叶心 --- 吴 连朝骤热，必有暑气内侵，头热目瞑，吸短神迷，此正虚邪痹，清补两难，先与益元散三四钱，用嫩竹叶心二钱，煎汤凉用三四小杯，常用绿豆煎汤服。

赤芍 --- 薄荷 淡竹叶 杏仁 连翘 黄芩 石膏 赤芍 木通

黑栀皮 --- 连翘心 玄参 犀角 郁金 橘红（蜜水炒） 黑栀皮 川贝 鲜菖蒲根 加竹沥

嫩竹叶 --- 至宝丹每服三分，灯心嫩竹叶汤送。

苇茎 --- 苇茎合葶苈大枣汤。

石膏 --- 临好，加入石膏末二钱。

甘草 --- 半夏泻心汤去甘草、干姜，加杏仁、枳实。

芳香 --- 某（三三） 秽暑吸入，内结募原，脘闷腹痛，便泄不爽，法宜芳香逐秽，以疏中焦为主。

半夏曲 --- 藿香梗 杏仁 厚朴 茯苓皮 半夏曲 广皮 香附 麦芽

归身 --- 人参 黄芪 白术 甘草 麦冬 五味 青皮 陈皮 泽泻 葛根 升麻 黄柏 归身 神曲

白术 --- 人参 白术 广皮 五味 麦冬 川连 黄柏 升麻 葛根 神曲 麦芽 谷芽

鲜荷叶汁 --- 鲜荷叶汁泛丸。

麦门冬 --- 金匮麦门冬汤。

玉女 --- 汪 暑风久入营络，微热忽凉，议用玉女煎。（暑风入营）

麦冬 --- 玉女煎去麦冬、牛膝，加丹皮竹叶。

内虚 --- 顾 右脉空大左脉小芤，寒热麻痹，腰痛冷汗，平素积劳内虚，秋暑客邪，遂干脏阴，致神迷心热烦躁，刮痧似乎略爽，病不肯解，此非经络间病，颇虑热深劫阴，而为痉厥，张司农集诸贤论暑病，谓入肝则麻痹，入肾为消渴，此其明征，议清阴分之邪，仍以养正辅之。（暑热深入劫阴）

飞滑石 --- 丝瓜叶 飞滑石 淡竹叶 茯苓皮 厚朴 藿香 广皮 通草

白蔻仁 --- 杏仁 香薷 木通 飞滑石 茯苓 厚朴 白蔻仁 淡竹叶

知母 --- 杨（二八） 暑热必挟湿，吸气而受，先伤于上，故仲景伤寒，先分六经，河间温热，须究三焦，大凡暑热伤气，湿着阻气，肺主一身周行之气，位高，为手太阴经，据述病样，面赤足冷，上脘痞塞，其为上焦受病显著，缘平素善饮，胃中湿热久伏，辛温燥烈，不但肺病不合，而胃中湿热，得燥热锢闭，下利稀水即协热下利，故黄连苦寒，每进必利甚者，苦寒以胜其辛热药味尚留于胃底也，然与初受之肺邪无当，此石膏辛寒，辛先入肺，知母为味清凉，为肺之母气，然不明肺邪，徒曰生津，焉是至理，昔孙真人未诊先问，最不误事，再据主家说及病起两旬，从无汗泄，经云，暑当汗出勿止，气分窒塞日久，热侵入血中，咯痰带血，舌红赤，不甚渴饮，上焦不解，漫延中下，此皆急清三焦，是第一章旨，故热病之瘀热，留络而为遗毒，注腑肠而为洞利，便为束手无策，再论湿乃重浊之邪，热为熏蒸之气，热处湿中，蒸淫之气，上迫清窍，耳为失聪，不与少阳耳聋同例，青蒿减柴胡一等，亦是少阳本药，且大病如大敌，选药若选将，苟非慎重，鲜克有济，议三焦厘清治，从河间法。（初三日）

大杏仁 --- 飞滑石 生石膏 寒水石 大杏仁 炒黄竹茹 川通草 莹白金汁 金银花露

炒川贝 --- 知母 竹叶心 连翘心 炒川贝 竹沥 犀角 玄参 金汁 银花露

炒川贝 --- 细生地 玄参心 知母 炒川贝 麦冬 地骨皮 银花露 竹沥

汉防己 --- 丝瓜叶（三钱） 大杏仁（三钱） 六一散（三钱） 茯苓皮（三钱） 汉防己（一钱半） 绵茵陈（一钱） 细木通（一钱） 白蔻仁（五分）

苍术 --- 苍术白虎汤加滑石。

西瓜翠衣 --- 西瓜翠衣 竹叶心 青荷叶汁 杏仁 飞滑石 苡仁

象贝母 --- 杏仁 象贝母 郁金 川通草 桑叶 石膏 橘红 苡仁

苍术 --- <D>天之暑热一动，地之湿浊自腾，人在蒸淫热迫之中，若正气设或有隙，则邪从口鼻吸入，气分先阻，上焦清肃不行，输化之机，失于常度，水谷之精微，亦蕴结而为湿也，人身一小天地，内外相应，故暑病必挟湿者，即此义耳，前人有因动因静之分，或伤或中之候，以及入心入肝，为疟为痢，中痧霍乱，暴厥卒死，种种传变之原，各有精义可参，兹不重悉，想大江以南，地卑气薄，湿胜热蒸，当此时候，更须防患于先，昔李笠翁记中所谓使天只有三时而无夏，则人之病也必稀，此语最确，盖暑湿之伤，骤者在当时为患，缓者于秋后为伏气之疾，其候也，脉色必滞，口舌必腻，或有微寒，或单发热，热时脘痞气窒，渴闷烦冤，每至午后则甚，入暮更剧，热至天明，得汗则诸恙稍缓，日日如是，必要两三候外，日减一日，方得全解，倘如元气不支，或调理非法，不治者甚多，然是病比之伤寒，其势觉缓，比之疟疾，寒热又不分明，其变幻与伤寒无二，其愈期反觉缠绵，若表之汗不易彻，攻之便易溏泻，过清则肢冷呕恶，过燥则唇齿燥裂，每遇秋来，最多是症，求之古训，不载者多，独己任编名之曰秋时晚发，感症似疟，总当以感症之法治之，要知伏气为病，四时皆有，但不比风寒之邪一汗而解，温热之气，投凉即安，夫暑与湿，为熏蒸粘腻之邪也，最难骤愈，若治不中，暑热从阳上熏，而伤阴化燥，湿邪从阴下沉，而伤阳变浊，以致神昏耳聋，舌干龈血，脘痞呕恶，洞泄肢冷，棘手之候丛生，竟至溃败莫救矣，参先生用意，宗刘河间三焦论立法，认明暑湿二气，何者为重，再究其病，实在营气何分，大凡六气伤人，因人而化，阴虚者火旺，邪归营分为多，阳虚者湿胜，邪伤气分为多，一则耐清，一则耐温，脏性之阴阳，从此可知也，于是在上者以辛凉微苦，如竹叶连翘杏仁，薄荷之类，在中者以苦辛宣通，如半夏泻心之类，在下者以温行寒性，质重开下，如桂苓甘露饮之类，此皆治三焦之大意也，或有所夹，又须通变，至于治气分有寒温之别，寒者宗诸白虎法，及天水散意，温者从乎二陈汤，及正气散法，理营分知清补之宜，清者如犀角地黄，加入心之品，补者有三才复脉等方，又如湿热沉混之苍术石膏汤，气血两燔之玉女法，开闭逐秽，与牛黄及至宝紫雪等剂，扶虚进参附，及两仪诸法，随其变幻，审其阴阳，运用之妙，存乎心也，附骥芜词，高明教正。（邵新甫）

人参 --- 徐评 所列诸案，皆平素伏暑之症为多，其卒然受暑之病绝少，若卒受之症，则当以香茹饮为主，不可不知也，此老治暑邪，能用轻清凉润之品以和肺，是其所长，但暑邪深入，必有闷乱烦躁等症，近于霍乱，此则更有治法，至于病重症危，属热邪横逆，不但人参不可轻用，而桂附干姜服之，无不立毙，乃亦仿仲景伤寒坏症治法，轻于一试，当时不知有害与否，而耳食之徒，竟以为必用之药，名本于此老，我见死者甚多，伤心惨目，不得不归咎于作俑之人也。</D>