活水芦根 --- 大杏仁 金石斛 飞滑石 紫厚朴 活水芦根

淡黄芩 --- 淡黄芩 连翘 炒杏仁 白通草 滑石 野赤豆皮

牛蒡子 --- 连翘 牛蒡子 银花 马勃 射干 金汁

芳香 --- 李（三二） 时令湿热之气，触自口鼻，由募原以走中道，遂致清肃不行，不饥不食，但温乃化热之渐，致机窍不为灵动，与形质滞浊有别，此清热开郁，必佐芳香以逐秽为法。（湿热秽气阻窍）

黑山栀 --- 瓜蒌皮 桔梗 黑山栀 香豉 枳壳 郁金 降香末

芳香 --- 某 吸受秽邪，募原先病，呕逆，邪气分布，营卫皆受，遂热蒸头胀，身痛经旬，神识昏迷，小水不通，上中下三焦交病，舌白，渴不多饮，是气分窒塞，当以芳香通神，淡渗宣窍，俾秽湿浊气，由此可以分消。

通草 --- 苡仁 茯苓皮 猪苓 大腹皮 通草 淡竹叶

炒麦冬 --- 鲜省头草 知母 川斛 苡仁 炒麦冬

连翘心 --- 犀角 连翘心 玄参 石菖蒲 金银花 野赤豆皮

生白芍 --- 人参 生干姜 黄芩 川连 枳实 生白芍

通草 --- 通草汤煎。

生于术 --- 生于术 茯苓 苡仁 郁金 炒远志 石菖蒲汁

炒黄川贝 --- 炒黄川贝 茯苓 苡仁 郁金 地骨皮 淡竹叶

生于术 --- 生于术（五钱） 苡仁（三钱） 寒水石（一钱半） 桔梗（七分） 猪苓（一钱） 泽泻（一钱） 广皮白（一钱半）

生于术 --- 生于术 川黄连 厚朴 淡生姜渣 广皮白 酒煨大黄

川连 --- 小川连 半夏 姜汁 枳实 茯苓 香豉

桂枝木 --- 绵茵陈（三钱） 生白术（一钱） 寒水石（三钱） 飞滑石（三钱） 桂枝木（一钱） 茯苓皮（三钱） 木猪苓（三钱） 泽泻（一钱）

煨草果 --- 厚朴 广皮 煨草果 炒楂肉 藿香梗 炒神曲

谷芽 --- 藿香梗 广皮 茯苓 大腹皮 厚朴 谷芽

草果仁 --- 山茵陈 草果仁 茯苓皮 大腹皮绒 厚朴 广皮 猪苓 泽泻

广皮白 --- 杏仁 藿香 茯苓皮 滑石 厚朴 广皮白

赤小豆 --- 生白术 赤小豆皮 绵茵陈 黄柏 茯苓 泽泻

白蔻仁 --- 厚朴 杏仁 白蔻仁 木通 茯苓皮 大腹皮 滑石 竹叶

白蔻仁 --- 黄芩 滑石 茯苓皮 大腹皮 白蔻仁 通草 猪苓

淡干姜 --- 炒黑生附子 炒黑川椒 生淡干姜 葱白 调入猪胆汁（一枚）

熟附子 --- 桂枝 淡干姜 熟附子 生白术

姜 --- 莫（五十） 今年夏四月，寒热不饥，是时令潮沴气蒸，内应脾胃，夫湿属阴晦，必伤阳气，吞酸形寒，乏阳营运，议鼓运转旋脾胃一法，苓姜术桂汤。

姜 --- 某（十六） 地中湿气，自足先肿，湿属阴邪，阳不易复，畏寒，筋骨犹牵强无力，以金匮苓姜术桂汤。

香附汁 --- 荜茇 生香附汁 木香 草果 茯苓 广皮白

生茅术 --- 生茅术 官桂 茯苓 厚朴 广皮白 飞滑石 猪苓 泽泻 炒楂肉

黑附子 --- 生茅术 人参 厚朴 广皮 炮姜灰 生炒黑附子

广皮白 --- 藿香梗 厚朴 杏仁 广皮白 茯苓皮 神曲 麦芽 绵茵陈

浙茯苓 --- 猪苓 浙茯苓 寒水石 晚蚕砂 皂荚子（去皮）

大豆黄卷 --- 厚朴 广皮 藿香梗 茯苓皮 大豆黄卷 木防己 川通草 苡仁

芒硝 --- 牛 向年积聚，误服燥热诸药，频与清夺推陈致新乃安，身处江南湿热之乡，饮啖仍用山右厚重之味，留热由肠升膈，三焦不消，议攻无形之热，清心凉膈去芒硝加菖蒲。

熟附子 --- 茯苓 熟附子 生白术 左牡蛎 泽泻 车前子

胡芦巴 --- 鹿茸 胡芦巴 附子 韭子 赤石脂 补骨脂 真茅术 茯苓 菟丝子 大茴香

附子 --- 生白术 附子 干姜 茯苓

生茅术 --- 生茅术 炮黑川乌 姜汁 白芥子 厚朴 广皮 荜茇 茯苓

炒半夏 --- 防己 杏仁 滑石 醋炒半夏 连翘 山栀 苡仁 野赤豆皮

白蔻仁 --- 苡仁 竹叶 白蔻仁 滑石 茯苓 川通草

滑石 --- <D>湿为重浊有质之邪，若从外而受者，皆由地中之气升腾，从内而生者，皆由脾阳之不运，虽云雾露雨湿，上先受之，地中潮湿，下先受之，然雾露雨湿，亦必由地气上升而致，若地气不升，则天气不降，皆成燥症矣，何湿之有，其伤人也，或从上，或从下或遍体皆受，此论外感之湿邪，着于肌躯者也，此虽未必即入于脏腑，治法原宜于表散，但不可大汗耳，更当察其兼症，若兼风者，微微散之，兼寒者佐以温药，兼热者佐以清药，此言外受之湿也然水流湿，火就燥，有同气相感之理，如其人饮食不节，脾家有湿，脾主肌肉四肢，则外感肌躯之湿，亦渐次入于脏腑矣，亦有外不受湿，而但湿从内生者，必其人膏粱酒醴过度，或嗜饮茶汤太多，或食生冷瓜果及甜腻之物，治法总宜辨其体质阴阳，斯可以知寒热虚实之治，若其人色苍赤而瘦，肌肉坚结者，其体属阳，此外感湿邪，必易于化热，若内生湿邪，多因膏粱酒醴，必患湿热，湿火之症，若其人色白而肥，肌肉柔软者，其体属阴，若外感湿邪，不易化热，若内生之湿，多因茶汤生冷太过，必患寒湿之症，人身若一小天地，今观先生治法，若湿阻上焦者，用开肺气，佐淡渗，通膀胱，是即启上闸，开支河，导水势下行之理也，若脾阳不运，湿滞中焦者，用术朴姜半之属，以温运之，以苓泽腹皮滑石等渗泄之，亦犹低窳湿处，必得烈日晒之，或以刚燥之土培之，或开沟渠以泄之耳，其用药总以苦辛寒治湿热，以苦辛温治寒湿，概以淡渗佐之，或再加风药，甘酸腻浊，在所不用，总之肾阳充旺，脾土健运，自无寒湿诸症，肺金清肃之气下降，膀胱之气化通调，自无湿火湿热暑湿诸症，若夫失治变幻，则有肿胀黄胆泄泻淋闭痰饮等类，俱于各门兼参之可也。（华岫云）

芳香 --- 徐评 方案重复，令阅者生厌，编书者意欲何为，治湿不用燥热之品，皆以芳香淡渗之药，疏肺气而和膀胱，此为良法，惟健脾消痰培土之方未备，则于固本之法，犹有缺耳。</D>