某 风温上郁，目赤，脉左弦，当用辛以散之。（风温）

某（二三） 失血后，复受燥热，左目赤痛，当以辛凉清之。（燥热）

鲜菊叶 冬桑叶 生甘草 赤苓皮 绿豆皮 豆皮

鲍（氏） 秋风化燥，上焦受邪，目赤珠痛。

席 用淡渗渐安，是暑入气阻，热蒸湿郁，勿取大辛大苦之开泄，仿清邪中上治法。（暑湿郁蒸）

冬桑叶 谷精草 望月砂 苡仁 川通草 绿豆皮 茯苓

顾（五四） 头额闷胀，目赤。（木火上郁）

羚羊角 夏枯草 草决明 山栀皮 连翘 生香附

潘 戒饮，浊减十四，略可加谷，近日竟夕无寐，目珠赤痛，阳升不交于阴，暂停妙香散。

陆（妪） 郁勃气火，翳遮目睛，高年苦辛难进。

夏枯草 谷精草 草决明 望月砂 生香附 连翘 山栀皮 丹皮

某 头面风肿，目起星，是气中热。

羚羊角 夏枯草 薄荷梗 谷精草 生香附 小生地 丹皮 望月砂 连翘 山栀

汪 脉左弦，左目赤痛，泪多。

桑叶 丹皮 草决明 小胡麻 夏枯草 谷精草 绿豆皮 黑稆豆皮

汪 目痛偏左，翳膜红丝，诊脉左弦涩，由肝胆气热所致。

某（十一） 肝火上郁，目眶红肿。

连翘 赤芍 菊花叶 黑栀皮 苦丁茶 夏枯草

江 脉数右大，郁久热生目，障心痛。

夏枯草花 小生香附 金石斛 半夏曲 茯苓 橘红

某（八岁） 目胞浮肿，不饥不运。（脾肺蕴湿）

桑皮（八分） 茯苓皮（三钱） 大腹皮（一钱） 广皮（一钱） 姜皮（五分） 苡仁（一钱半） 通草（一钱）

王（妪） 高年目暗已久，血络空虚，气热乘其空隙，攻触脉络，液尽而痛，当夜而甚，乃热气由阴而上，想外科用酒调末药，必系温散攻坚，因此而痛，虚症可知。（血络虚热）

羚羊角 连翘心 夏枯草 青菊叶 全当归 川桂枝 丹皮

叶 微寒，汗大出，下有痔漏，左眼眶疼痛，此阴伤火郁，不可作时邪泛治。（阴虚火郁）

六味去萸加。

芍蔓荆子丹皮重用。

某（三六） 右目多泪，眦胀，心嘈杂，阳明空虚，肝阳上扰使然，当调补肝胃。（胃虚肝风）

嫩黄芪（三钱） 当归（一钱半） 白芍（一钱半） 茯神（三钱） 煨姜（一钱） 南枣（一枚）

祝（四八） 当夏形懒，不耐大气发泄，入冬两目无光，精气无收藏，凡五脏精华，皆聚于目，失藏失聚，内乏生真，不独一脏之损，当用养营汤。（营阴虚）

某（三六） 脉涩细，左目痛，泪热翳膜，此肝阴内亏，厥阳上越所致。（肝阴虚）

冬桑叶（一钱） 炒枸杞（一钱半） 小胡麻（一钱半） 望月砂（三钱） 制首乌（三钱） 石决明（一具） 黄菊花（一钱） 豆皮（三钱）

某（三六） 目痛无光。（肝肾虚）

制首乌（六两） 枸杞子（二两） 柏子仁（一两） 细生地（二两） 石决明（四两） 小胡麻（三两） 望月砂（三两） 刺蒺藜（二两） 冬桑叶（一两半） 黄菊花（一两）

用稆豆皮八两，谷精珠二两，煎厚汁泛丸，每服五钱，开水送。

某 眦胀目昏，心中嘈杂，当治肝肾。

熟地（六两） 枸杞子（三两） 桑椹子（二两） 沙苑（二两） 石决明（二两） 茯神（二两） 女贞子（一两半） 青盐（一两） 黄菊花（一两） 川斛（四两）

加蜜丸，早上开水送四钱。

某（三六） 脉涩，眦痛，右目当风泪多，当治肝肾。

制首乌 枸杞子 炒归身 桑椹子 沙苑子 茯神

某（二五） 遗止，心嘈目泪，仍是阳气过动，当填阴和阳。

某 瞳神散大，左偏头痛，先损左目，是焦烦郁勃，阳升化风，劫伤血液使然，法当兼补肝肾。

熟地 枸杞子 山萸肉 五味 茯神 菊花 生神曲 谷精草 山药

<D>眼科一症，古有五轮八廓，七十二问之辨，傅氏又分为一百零八症，因名目太多，徒滋惑乱，至于见症，杨仁斋已备论，具载景岳，但阴阳虚实寒热标本施治，不可紊乱，经云，五脏六腑之精华，皆上注于目，又云，目者肝之窍也，肝与胆为表里，肝液胆汁充足，目乃能远视，故无论外感与内症，皆与肝胆有关系焉，夫六淫之邪，惟风火燥居多，兼寒兼湿者，亦间有，内起之症，肝胆心肾为多，他脏亦间有之，若夫论治，则外感之症，必有头痛寒热鼻塞，筋骨酸疼，脉见紧数，或浮洪，一切表症，方可清散，至于内因之症，有虚实之殊，实者肝胆之风热盛也，凡暴赤肿痛，胀闷难开，翳膜眵泪，酸涩作痒，斑疮入睛，皆实症也，当除风散热，虚者，肾经之水火衰也，凡久痛昏暗，青盲雀目，内障昏蒙，五色花翳，迎风泪出，皆虚候也，治宜壮水益火，若阴血虽亏，而风热未尽，则当审其缓急，相参而治，若久服寒凉，虚阳转盛，则当补以甘温，从乎反佐，至于红色浅淡而紫者为虚热，鲜泽而赤者为实热，瞳神内涌白睛带赤者，为热症，瞳神青绿白睛枯槁者，为寒症，肿胀红赤，眼珠刺痛，夜则尤甚，目不能开，而视物犹见者，为邪火炽盛，若白翳遮睛，珠不甚痛，或全不痛，目仍能开，而视物不见者，为真火不足，当细察其形症色脉，因症而用药，此内治之大法也，若日久失调，致气血凝滞，火热壅结，而为赤肿腐烂，翳膜遮蔽，致成外障，譬之镜受污垢，必当濯磨，须用点药，若但服药，必不能愈，至于内障之症，但宜服药，倘用点药，徒伤其气血，必无益而有损，更当知目眦白珠属阳，故昼痛，点苦寒药则可效，瞳子黑睛属阴，故夜痛，点苦寒药则反剧，是外治之法，亦当以阴阳区别也，若夫偏正头风，属气虚痛者，朝重暮轻，血虚痛者，朝轻暮重，亦有外感内因之别，此症当以补养正气为主，略兼治表，倘概以风热而论，专于表散，最易损目，更有肝阴亏耗，木火上炎，头痛恶心，眉棱骨痛，不欲饮食，眼胞红肿，睛珠刺痛，眵泪如脓，白睛如胬，目珠上窜不下，不得寤寐，甚则巅顶脑后，如破如裂，此内发之风也，夫肝属木，木主风，热盛化风，其体必本阴亏，男子或有遗精白浊，肠风痔漏下血等疾，女子或犯淋带崩漏诸症，此系阴伤阳升，内风沸起，大忌发散，宜用育阴熄风，柔肝滋肾等法，或可救十中之四五，凡羌活、防风、川芎、细辛、藁本、升麻等药，皆不可用，倘或失治，必致膏伤低陷，青黄牒出，致成痼疾而不可救，专是科者，不可不留意焉，叶先生虽非眼目专科，观其案内诸法，真补前贤之未备，较之惯用苦寒升散，及概用点药者，不啻如霄壤之殊矣，学人当细心而参玩之。（丁圣彦）

徐评 眼科自有专家，其现症各有主治之方，案中虽未必切中，然清淡和平，无苦寒温补等弊，反胜于近日之名为眼科者，医理苟明，则无不通矣，若欲深求，则有专门之书在。</D>