[
  [
    {
      "type": "text",
      "value": "陆 风火上郁，项肿咽痛。（风火）"
    },
    {
      "type": "prescriptionItems",
      "value": [
        {
          "herb": "薄荷"
        },
        {
          "herb": "连翘"
        },
        {
          "herb": "射干"
        },
        {
          "herb": "牛蒡子"
        }
      ]
    }
  ],
  [
    {
      "type": "text",
      "value": "邵 风火上郁，咽痛头胀，宜用辛凉。"
    },
    {
      "type": "text",
      "value": "西瓜翠衣 滑石 连翘 桑皮 射干 杏仁"
    }
  ],
  [
    {
      "type": "text",
      "value": "汪（二三） 左脉弦数，咽痛脘闷，阴亏体质，不耐辛温，当以轻药，暂清上焦。（肺燥热）"
    },
    {
      "type": "text",
      "value": "桑叶 生绿豆皮 白沙参 川贝 玄参 川斛"
    }
  ],
  [
    {
      "type": "text",
      "value": "王（二七） 劳伤恐有瘀腐，进辛润宣血，初服身痛，继渐平复，但喉间紧痹，而呼吸饮食仍不觉其苦，眼白仍带黄，议清肺中气热治。"
    },
    {
      "type": "text",
      "value": "百部 大沙参 鲜枇杷叶 活水芦根 川贝 地骨皮 南花粉 苡仁"
    }
  ],
  [
    {
      "type": "text",
      "value": "徐（五六） 老劳咽疼。"
    },
    {
      "type": "text",
      "value": "生鸡子白（一枚） 糯稻根须（水洗五钱） 甜北沙参（一钱半） 炒麦冬（三钱） 川石斛（一钱半） 生甘草（三分）"
    }
  ],
  [
    {
      "type": "text",
      "value": "杨 未病阴气走泄为虚，秽浊上受则实，咽喉肿痹，上窍邪蒙，日暮昏烦，阴伤日炽，肌肤柔白，气分不足，此医药虽宜凉解清上，但不可犯及中下。（秽浊上受喉肿痹）"
    },
    {
      "type": "text",
      "value": "连翘 郁金 马勃 牛蒡子 竹叶心 黑山栀 杏仁 橘红"
    }
  ],
  [
    {
      "type": "text",
      "value": "艾 上焦之病，都是气分，气窒则上下不通，而中宫遂胀，热气蒸灼，喉舌疳蚀，清气之中，必佐解毒，皆受重药之累瘁。（气分热毒）"
    },
    {
      "type": "text",
      "value": "银花（二钱） 川贝（三钱） 马兜铃（五分） 连翘心（一钱半） 川通草（一钱） 白金汁（一杯） 活水芦根汁（半杯）"
    },
    {
      "type": "next",
      "value": "又 余热蒸痰壅气，当脘膈因咳而痛，议以润降清肃。"
    },
    {
      "type": "prescriptionItems",
      "value": [
        {
          "herb": "甜杏仁"
        },
        {
          "herb": "花粉"
        },
        {
          "herb": "川贝"
        },
        {
          "herb": "甘草"
        },
        {
          "herb": "桔梗"
        }
      ]
    }
  ],
  [
    {
      "type": "text",
      "value": "孙（四九） 肾液不收，肝阳上越，巅胀流涕，咽喉微痛。（阴虚火炎）"
    },
    {
      "type": "text",
      "value": "六味加牛膝、车前、五味。"
    }
  ],
  [
    {
      "type": "text",
      "value": "伍（四六） 咽喉痛痹，发时如有物阻膈，甚至痛连心下，每晚加剧，是阴液日枯，肝脏厥阳化火风上灼，法以柔剂，仿甘以缓其急耳。"
    },
    {
      "type": "prescriptionItems",
      "value": [
        {
          "herb": "细生地"
        },
        {
          "herb": "天冬"
        },
        {
          "herb": "阿胶"
        },
        {
          "herb": "生鸡子黄"
        },
        {
          "herb": "玄参心"
        },
        {
          "herb": "糯稻根"
        }
      ]
    }
  ],
  [
    {
      "type": "text",
      "value": "陈（三七） 阴阳交虚营卫欹斜，为忽冷忽热，周身骸骨皆痛，百脉皆损，秋半天气已降，身中气反泄越，汗出喉痹，阳不入于阴，致自为动搏耳，夫咽喉之患，久则喉痹喉宣，妨阻受纳，最不易治，从少阴咽痛例，用猪肤汤旬日，喉痛得缓，对症转方。"
    }
  ],
  [
    {
      "type": "text",
      "value": "张（二三） 阴损三年不复，入夏咽痛拒纳，寒凉清咽，反加泄泻，则知龙相上腾，若电光火灼，虽倾盆豪雨，不能扑灭，必身中阴阳协和方息，此草木无情难效耳，从仲景少阴咽痛用猪肤汤主之。"
    },
    {
      "type": "next",
      "value": "又 阴涸于下，阳炽于上，为少阴喉痛，乃损怯之末传矣，用猪肤甘凉益坎，有情之属而效，今肉腠消烁殆尽，下焦易冷，髓空极矣，何暇以痰嗽为理，议滑涩之补味咸入肾可也。"
    },
    {
      "type": "text",
      "value": "牛骨髓（四两） 羊骨髓（四两） 猪骨髓（四两） 麋角胶（四两）"
    },
    {
      "type": "text",
      "value": "用建莲肉五两，山药五两，芡实二两，同捣丸。"
    }
  ],
  [
    {
      "type": "text",
      "value": "金（四二） 脏液不充，阳气虚风鼓动，病起喉辣心震，频频举发，多因劳怒，用内经甘缓一法。"
    },
    {
      "type": "prescriptionItems",
      "value": [
        {
          "herb": "人参"
        },
        {
          "herb": "萸肉炭"
        },
        {
          "herb": "白芍"
        },
        {
          "herb": "炙甘草"
        },
        {
          "herb": "茯神"
        },
        {
          "herb": "小麦"
        }
      ]
    },
    {
      "type": "next",
      "value": "又 复脉汤去桂。"
    }
  ],
  [
    {
      "type": "text",
      "value": "<D>内经云，一阴一阳结，谓之喉痹，一阴者手少阴君火，心之脉气也，一阳者，手少阳相火，三焦之脉气也，夫二经之脉，并络于喉，故气热则内结，结甚则肿胀，胀甚则痹，痹甚则不通而死矣，即今之所谓喉癣喉风喉蛾等类是也，夫推原十二经，惟足太阳别下项，其余皆凑咽喉，然内经独言一阴一阳结，为喉痹者，何也，盖以君相二火独胜，则热且痛也，愚历考咽喉汤方，皆用辛散咸软，去风痰，解热毒为主，如玄参升麻汤，圣济透关散，及玉钥匙，如圣散，普济消毒饮子，皆急于治标，而缓于治本，恐缓则伤人，故以治标为急耳，又尝考仲景伤寒论，咽喉生疮等症，每用甘草桔梗半夏散及汤为主，一为少阴水亏，不能上济君火，以致咽喉生疮，不能出声，故以半夏之辛滑，佐鸡子清利窍通声，使以苦酒入阴，劫涎敛疮，桂枝解肌由经脉而出肌表，悉从太阳开发，而半夏治咽痛，可无燥津涸液之患，一为阴火上结而为咽痛，故用生甘草甘凉泄热，功在缓肾急而救阴液，佐以桔梗开提足少阴之热邪，如肾液下泄，不能上蒸于肺，致络燥而为咽痛者，仲景又有猪肤一法，润燥解热缓中，使其阴阳协和而后愈，是固本而兼治标者也，如风火上郁，阴亏脉数而为咽痛者，先生又有辛凉清上诸法，如咽喉紧痹，气热而为咽痛者，又有清肺中气热一法，如情志郁勃，相火上炎，而为咽痛者，则又有降气开浊一法，如肾液不收，肝阳上越而为咽痛者，宗钱氏六味汤，如阴阳交虚，龙相上灼而为咽痛者，宗仲景猪肤汤法。（邹滋九）"
    },
    {
      "type": "text",
      "value": "徐评 凡病属于经络脏腑者，皆煎丸之所能治，一属形体及九窍，则属有形之病，实有邪气凝结之处，药入胃中，不过气到耳，安能去凝结之邪，故煎丸之功，不过居其半耳，若欲速效，必用外治之法，可以应手而愈，博考方书，广求秘法，自能得之，此老尚未知之也，故其治有形诸病，皆非所长，又外治之法，上古所鲜闻，因其用针灸之术，通神入妙，何必外治，此则外治之最者也，后世针法不传，于是乎以药代针，而多外治之法，若针灸既废，而外治之法亦不讲，则天下之病，即使用药的当，只能愈其半耳，其外症之必需外治者，竟无愈理，此亦医道之一大关也，后之学人须知之。</D>"
    }
  ]
]