川桂枝 --- 生鹿茸（三钱） 鹿角霜（一钱） 当归（二钱） 生菟丝子（五钱） 沙蒺藜（一钱） 川桂枝尖（五分）

淡苁蓉 --- 当归 舶茴香 淡苁蓉 枸杞子 安息香 茯苓

川楝子 --- 川楝子（二两） 穿山甲（二两炙） 炮黑川乌（五钱去皮） 炒黑小茴香（一两） 橘核（二两炒） 乳香（五钱）

白根 --- 用老韭白根汁泛丸，饥时服二钱五分。

青木香 --- 川连 吴萸 穿山甲 青木香 金铃子 延胡

青橘叶 --- 青橘叶汤丸。

金铃子 --- 郁（十七） 肝病，络虚气聚，少腹滞胀，前用河间金铃子散，加牡蛎橘叶，合咸苦辛胜法，小效加食，述饥则胁腹鸣盛，而浊气下泄颇安，乃络虚不足中之有余，形质瘦怯，不可纯攻。

南山楂 --- 桃仁 当归梢 炒小茴 橘核 郁李仁 南山楂 葱白汁丸

川楝子 --- 归须 杜牛膝根 小茴香 川楝子 穿山甲 柏子仁

炒桃仁 --- 炒桃仁 炒橘核 金铃子 炒延胡 韭白汁 两头尖 小茴 青皮

生牡蛎 --- 粗桂枝 吴萸 川楝子 茯苓 生牡蛎 泽泻

青皮 --- 磨青皮汁十匙。

汉防己 --- 五苓散加独活、汉防己。

羊内肾 --- 羊内肾蒸熟和丸。

淡苁蓉 --- 淡苁蓉 归身 炒枸杞 小茴 炒沙苑 茯苓 红枣肉

黑山栀 --- 归须 橘核 青木香 青皮 小茴 黑山栀 青葱管

黑附子 --- 生炮黑附子 生淡干姜 猪胆汁 吴萸 川楝子

青木香 --- 肉桂 真橘核 青木香 小茴 穿山甲 粗桂枝 李根白皮

淡干姜 --- 人参（一钱半） 炮乌头（一钱） 淡干姜（一钱） 吴萸（泡淡一钱） 茯苓（三钱）

两头尖 --- 韭白根 两头尖 金铃子 延胡 归须 肉桂心

胡芦巴 --- 人参 炒黑川椒 附子 茯苓 川楝子 胡芦巴

龙胆 --- 詹 老年久疝，因嗔怒而肿大，热痛，肝失疏泄，火腑湿热蕴结不通，温补升阳固谬，盖肝性主刚湿闭反从燥化，此龙胆苦坚不应，议柔苦制热，反佐辛热，以开血中郁痹，用东垣滋肾丸。（久疝湿热郁）

龙胆草 --- 龙胆草 黄柏 芦荟 山栀 知母 海金沙 猪苓 泽泻 细辛

泽泻 --- 寒水石 海金沙 猪苓 泽泻 通草 木香汁

当归 --- 当归 鹿角 桂枝 肉桂 小茴 川芎 炙草 茯苓 生姜

羊肉 --- 羊肉胶丸。

淡苁蓉 --- 淡苁蓉 归身 枸杞子 炒黑小茴 穿山甲 全蝎

大茴香 --- 鹿茸 大茴香 穿山甲 当归 水安息香 炮黑川乌 全蝎

黑大豆 --- 用黑大豆炒赤淋酒一杯，滤酒汁和丸，每服二钱，暖酒送。

当归 --- <D>经云，任脉为病，男子内结七疝，女子带下瘕聚，又督脉生病，从少腹上冲心而痛，不得前后为冲疝，又曰，脾传之肾，病名曰疝瘕，又曰三阳为病，发寒热，其传为A2J7疝，又曰邪客于足厥阴之络，令人卒疝暴痛，此素问言诸经之疝也，又经脉等篇云，足阳明之筋病，A2J7疝，腹筋急，足太阴之筋病，阴器纽痛，下引脐两胁痛，足厥阴之经筋病，阴器不用，此灵枢言诸经之疝也，后人因有筋、水、狐、A2J7、气、血、寒七疝之名，其主治各有专方，立法可谓大备，然其中不无错杂之处，终非可训之定法，惟仲景先生，独以寒疝为名，其所出三方，亦以温散祛寒，调营补虚为主，并不杂入气分之药，而子和治法又以辛香流气为主，谓肝得疏泄而病愈矣，其金铃虎潜诸法，可谓发前人所未发，故疝病之本，不离乎肝，又不越乎寒，以肝脉络于阴器，为至阴之脏，足太阳之脉，属肾络膀胱，为寒水之经，故仲景所云寒疝，腹中痛逆冷，手足不仁，腹满，脉弦而紧，恶寒不欲食，绕脐痛，及胁痛里急，是内外皆寒气作主，无复界限，其乌头二方，专以破邪治标为急，虚实在所不论，是急则治标之义也，其当归羊肉一方，专以补虚散寒为主，故以当归羊肉辛甘重浊，温暖下元，而不伤阴，佐以生姜，随血肉有情之品，引入下焦，温散冱寒，是固本不治标也，子和所云，疝不离乎肝者，以疝病有阴囊肿胀，或痛而里急筋缩，或茎中作痛，或牵引睾丸，或少腹攻冲作痛，或号笑忿怒而致，此皆肝经脉络之现症，其金铃散一法，以泄肝散逆为主，故以川楝导膀胱小肠之热，元胡和一身上下诸痛，以肝主疏泄故也，其所取虎潜一法，以柔缓导引为主，故方中用虎骨熄肝风，壮筋骨，羊肉龟板补髓填精，佐以地黄补肾，当归补肝，使以陈皮利气疏肝，芍药通肝调营，是治肝而顾及于肾也，及观先生治疝之法，又更有进焉者，其旨以暴疝多寒，久疝多热，为疝病之大纲，其余随症施治，如气坠下结者，以鹿茸鹿角升阳为主，其胀结有形，痛甚于下者，宗丹溪通阳泄浊为治，其火腑湿热郁结不通者，用柔苦制热，反佐辛热，以开血中郁痹为主，其寒湿下坠，太阳之里，膀胱之气不和，二便不为通利者，五苓散加减，通太阳膀胱为主，其湿热久聚，气坠少腹阴囊者，用控涎丹，浚川丸等，逐痹通腑分消，兼辛甘化风法为主，如下焦阴阳两虚煮，用有情温通以培生气，兼通补熄风为主，而先生于治疝之法，可谓曲尽病情，诸法备矣，仲景又有狐疝一方，究非王道之品，兹不具赘。（邹滋九）