吴 脉小涩，脘中隐痛，呕恶吞酸，舌绛不多饮，此高年阳气结于上，阴液衰于下，为关格之渐，当开痞通阳议治。（阳结于上阴衰于下关格）

川连 人参 姜汁 半夏 枳实汁 竹沥

卢 阴阳逆乱，已成关格，议用附子泻心汤，为上热下寒主治。

徐（七八） 老人食入涎涌，吐痰略能咽粥，二便艰少，是阳不转旋上结，阴枯于下便难，极难调治，勿用腥油膻味，脉弦大而搏，议妙香丸。

毛 老年形消，不食不便，气冲涌涎，乃关格之症，议用进退黄连汤。

濮（七十） 七旬有年，纳食脘胀，大便干涩，并不渴饮，痰气凝遏阻阳，久延关格最怕。

杜（六四） 老人积劳久虚，因渴饮冷，再伤胃阳，洞泄复加呕吐，不受汤饮食物，上不得入，下不得出，此为关格难治。

某 清阳日结，腹窄不能纳谷，阴液渐涸，肠失润，大便难。

毕（五四） 夏间诊视，曾说难愈之疴，然此病乃积劳伤阳，年岁未老，精神已竭，古称噎膈反胃，都因阴枯而阳结也，秋分后复诊，两脉生气日索，交早咽燥，昼日溺少，五液告涸，难任刚燥阳药，是病谅非医药能愈，大半夏汤加黄连姜汁。

某 脉寸口搏大，按之则涩，形瘦气逆，上不纳食，下不通便，老年积劳内伤，阳结不行，致脘闭阴枯，腑乏津营，必二便交阻，病名关格，为难治。

人参 枳实 川连 生干姜 半夏 茯苓

苏（五四） 向来翻胃，原可撑持，秋季骤加惊忧，厥阳陡升莫制，遂废食不便，消渴不已，如心热，呕吐涎沫，五味中喜食酸甘，肝阴胃汁，枯槁殆尽，难任燥药通关，胃属阳土，宜凉宜润，肝为刚脏，宜柔宜和，酸甘两济其阴。（肝阴胃汁枯）

乌梅肉 人参 鲜生地 阿胶 麦冬汁 生白芍

某 阳明汁干成膈。

王（五三） 老年血气渐衰，必得数日大便通爽，然后脘中纳食无阻，此胃汁渐枯，已少胃气下行之旨，噎症萌矣，病乃操持太过，身中三阳，燔燥烁津所致，故药饵未能全功，议用丹溪法。（烦劳阳亢肺胃津液枯）

麦冬汁 鲜生地汁 柏子仁汁 甜杏仁什 黑芝麻汁 杜苏子汁 松子仁浆

水浸布纸，绞汁滤清，炖自然膏。

马（六十） 劳心劳力经营，向老自衰，平日服饵桂附生姜三十年，病食噎不下膈吐出，此在上焦之气不化，津液不注于下，初病大便艰涩，按经云，味过辛热，肝阳有余，肺津胃液皆夺，为上燥，仿嘉言清燥法。

某 脉涩左大，食入为噎，是属液亏，先宜理气，后用润剂。（液亏气滞）

程 舌黄微渴，痰多咳逆，食下欲噎，病在肺胃，高年姑以轻剂清降。（肺胃气不降）

鲜枇杷叶 杏仁 郁金 瓜蒌皮 山栀 淡香豉

沈 格拒食物，涎沫逆气，自左上升，此老年悒郁所致，必使腑通浊泄，仅可延年，议两通阳明厥阴之法。（肝郁气逆）

俞 酒热郁伤，脘中食阻而痛，治以苦辛寒。（酒热郁伤肺胃）

某 忧思郁结，凝痰阻碍，已属噎塞之象，当怡情善调。（忧郁痰阻）

炒半夏（一钱半） 茯苓（五钱） 秫米（三钱） 枳实（一钱炒） 姜汁（三小匙冲）

杨（四七） 脉弦而小涩，食入脘痛格拒，必吐清涎，然后再纳，视色苍，眼筋红黄，昔肥今瘦，云是郁怒之伤，少火皆变壮火，气滞痰聚日拥，清阳莫展，脘管窄隘，不能食物，噎膈渐至矣，法当苦以降之，辛以通之，佐以利痰清膈，莫以豆蔻沉香劫津可也。

川黄连 杏仁 桔梗 土瓜蒌皮 半夏 橘红 竹沥 姜汁

朱（五二） 未老形衰，纳谷最少，久有心下忽痛，略进汤饮不安，近来常吐清水，是胃阳日薄，噎膈须防，议用大半夏汤，补腑为宜。（胃阳虚）

人参 半夏 茯苓 白香粳米 姜汁 河水煎

白（五六） 少食颇安，过饱食不肯下，间有冷腻涎沫涌吐而出，此有年胃阳久馁，最多噎膈反胃之虑，饮以热酒，脘中似乎快爽，显然阳微欲结，所幸二便仍通，浊尚下泄，犹可望安。

熟半夏（姜水炒二两） 茯苓（二两） 生益智仁（一两） 丁香皮（五钱） 新会皮（一两） 淡干姜（一两）

上药净末分量，用香淡豆豉一两洗净煎汁法丸，淡姜汤服三钱。

吕（六十） 劳倦饥饱，皆伤胃阳，年及花甲，最虑噎膈翻胃，此面饭酒肉重浊之物，与病不合。

半夏 姜汁 香豉 土瓜蒌皮 杏仁 橘红

冯（六七） 有年阳微，酒湿厚味，酿痰阻气，遂令胃失下行为顺之旨，脘窄不能纳物，二便如昔，病在上中，议以苦降辛通，佐以养胃，用大半夏汤。

顾（四十） 脉濡缓无力，中年胸胁时痛，继以早食晚吐，此属反胃，乃胃中无阳，浊阴腐壅，议仿仲景阳明辛热宣通例。

尤 脉缓，右关弦，知饥恶食，食入即吐，肢浮，便溏溺少，不渴饮，此胃阳衰微，开合之机已废，老年噎膈反胃，乃大症也。

刘（五四） 脉左小弦，右濡涩，五旬又四，阴阳日衰，劳烦奔走，阳愈伤，致清气欲结，食入脘痛，痰涎涌逆，皆噎膈反胃见症，其饮酒愈甚，由正气先馁，非酒能致病。

川连 枳实汁 茯苓 半夏 广皮白 黑山栀 姜汁 竹沥

包（六十） 胸脘痞闷，嗳逆，三四日必呕吐粘腻，或黄绿水液，此属反胃，六旬有年，是亦重病。

陆 脉沉微，阳气大伤，阴浊僭踞，旦食不能暮食，周身掣痛，背胀，病状着难愈之症。（阳虚阴浊凝滞）

姚（六二） 腑阳不通降，浊壅为反胃，累遭病反，老年难以恢复，自能潜心安养，望其悠久而已，药不能愈是病矣。

人参 附子 干姜 公丁香

姜汁和丸。

某 积劳有年，阳气渐衰，浊凝瘀阻，脘中常痛，怕成噎膈便塞之症。（阳衰脘痹血瘀）

桃仁 红花 延胡 川楝子 半夏 橘红 郁金汁 瓜蒌皮

李 两关脉缓涩，食入气阻，吐涎稍通，前已吐过瘀浊胶粘，此皆久积劳倦，阳气不主旋运，为噎膈反胃之症，此病最多反复，必须身心安逸，方可却病，徒药无益耳。

某 胃痛，得瘀血去而减，两三年宿病复起，食进痞闷，怕其清阳结而成膈，大意益气佐通，仍兼血络为治。

人参 半夏 茯苓 新会皮 木香 生益智 当归 桃仁

水法丸，服三钱。

张（三三） 早食暮吐，大便不爽，病在中下，初因劳伤胃痛，痰瘀有形之阻。

<D>经云，三阳结谓之膈，又云一阳发病，其传为膈，仲景云，朝食暮吐，暮食朝吐，宿谷不化，名曰胃反，丹溪谓噎膈反胃，名虽不同病出一体，多因气血两虚而成，然历观噎膈反胃之因，实有不同，大抵饮食之际，气忽阻塞，饮食原可下咽，如有物梗塞之状者，名曰噎，心下格拒，饥不能食，或食到喉间，不能下咽者，名曰膈，食下良久复出，或隔宿吐出者，名曰反胃，夫噎膈一症，多因喜怒悲忧恐五志过极，或纵情嗜欲，或恣意酒食，以致阳气内结，阴血内枯而成，治宜调养心脾，以舒结气，填精益血，以滋枯燥，夫反胃乃胃中无阳，不能容受食物，命门火衰，不能熏蒸脾土，以致饮食入胃，不能运化，而为朝食暮吐，暮食朝吐，治宜益火之源，以消阴翳，补土通阳以温脾胃，故先生于噎膈反胃，各为立法以治之，其阳结于上，阴亏于下，而为噎膈者，用通阳开痞，通补胃腑，以及进退黄连，附子泻心诸法，上热下寒为治，其肝阴胃汁枯槁，及烦劳阳亢，肺胃津液枯而成噎膈者，用酸甘济阴，及润燥清燥为主，其液亏气滞，及阳衰血瘀而成噎膈者，用理气逐瘀，兼通血络为主，其胃阳虚而为噎膈反胃，及忧郁痰阻而成者，用通补胃腑，辛热开浊，以及苦降辛通，佐以利痰清膈为主，其肝郁气逆而为噎膈者，两通厥阴阳明为治，其酒热郁伤肺胃，气不降而为噎膈者，用轻剂清降，及苦辛寒开肺为主，而先生于噎膈反胃治法，可谓无遗蕴矣，张景岳云，治噎膈大法，当以脾肾为主，其理甚通，当宗之，又有饮膈热膈，及忧气恚食寒之膈，其主治各载本门，兹不复赘。（邹滋九）

是证，每因血枯气衰致此，凡香燥消涩之药，久在禁内，案中虽有一二仿用辛热，而亦必谛审其为阳微浊踞者，其余或苦辛泄滞而兼润养，或酸甘化液而直滋清，或郁闷于气分，而推扬谷气，或劳伤于血分，而宣通瘀浊，总以调化机关，和润血脉为主，阳气结于上，阴液衰于下，二语，实为证之确切论也。（姚亦陶）

徐评 果系膈症，百无一生，不必言治，若反胃则古人自有主方，不得泛用通治之品，此老尚未明也，案中多用人参，其意以为不食胃虚，不可不用参以补其精气，不知噎膈之症，必有瘀血顽痰逆气，阻膈胃气，其已成者，百无一治，其未成者，用消瘀去痰降气之药，或可望其通利，若用人参，虽或一时精气稍旺，而病根益深，永无愈期矣。</D>