川连 --- 川连 人参 姜汁 半夏 枳实汁 竹沥

附子 --- 卢 阴阳逆乱，已成关格，议用附子泻心汤，为上热下寒主治。

黄连 --- 毛 老年形消，不食不便，气冲涌涎，乃关格之症，议用进退黄连汤。

黄连 --- 毕（五四） 夏间诊视，曾说难愈之疴，然此病乃积劳伤阳，年岁未老，精神已竭，古称噎膈反胃，都因阴枯而阳结也，秋分后复诊，两脉生气日索，交早咽燥，昼日溺少，五液告涸，难任刚燥阳药，是病谅非医药能愈，大半夏汤加黄连姜汁。

川连 --- 人参 枳实 川连 生干姜 半夏 茯苓

五味 --- 苏（五四） 向来翻胃，原可撑持，秋季骤加惊忧，厥阳陡升莫制，遂废食不便，消渴不已，如心热，呕吐涎沫，五味中喜食酸甘，肝阴胃汁，枯槁殆尽，难任燥药通关，胃属阳土，宜凉宜润，肝为刚脏，宜柔宜和，酸甘两济其阴。（肝阴胃汁枯）

生白芍 --- 乌梅肉 人参 鲜生地 阿胶 麦冬汁 生白芍

鲜生地 --- 麦冬汁 鲜生地汁 柏子仁汁 甜杏仁什 黑芝麻汁 杜苏子汁 松子仁浆

生姜 --- 马（六十） 劳心劳力经营，向老自衰，平日服饵桂附生姜三十年，病食噎不下膈吐出，此在上焦之气不化，津液不注于下，初病大便艰涩，按经云，味过辛热，肝阳有余，肺津胃液皆夺，为上燥，仿嘉言清燥法。

鲜枇杷叶 --- 鲜枇杷叶 杏仁 郁金 瓜蒌皮 山栀 淡香豉

川连 --- 小川连 半夏 香豉 枳实 茯苓 姜汁

炒半夏 --- 炒半夏（一钱半） 茯苓（五钱） 秫米（三钱） 枳实（一钱炒） 姜汁（三小匙冲）

川黄连 --- 川黄连 杏仁 桔梗 土瓜蒌皮 半夏 橘红 竹沥 姜汁

半夏 --- 朱（五二） 未老形衰，纳谷最少，久有心下忽痛，略进汤饮不安，近来常吐清水，是胃阳日薄，噎膈须防，议用大半夏汤，补腑为宜。（胃阳虚）

人参 --- 人参 半夏 茯苓 白香粳米 姜汁 河水煎

淡干姜 --- 熟半夏（姜水炒二两） 茯苓（二两） 生益智仁（一两） 丁香皮（五钱） 新会皮（一两） 淡干姜（一两）

淡豆豉 --- 上药净末分量，用香淡豆豉一两洗净煎汁法丸，淡姜汤服三钱。

瓜蒌皮 --- 半夏 姜汁 香豉 土瓜蒌皮 杏仁 橘红

半夏 --- 冯（六七） 有年阳微，酒湿厚味，酿痰阻气，遂令胃失下行为顺之旨，脘窄不能纳物，二便如昔，病在上中，议以苦降辛通，佐以养胃，用大半夏汤。

黑山栀 --- 川连 枳实汁 茯苓 半夏 广皮白 黑山栀 姜汁 竹沥

川连 --- 川连 半夏 枳实 郁金 竹茹 姜汁

附子 --- 人参 附子 干姜 公丁香

姜汁 --- 姜汁和丸。

郁金汁 --- 桃仁 红花 延胡 川楝子 半夏 橘红 郁金汁 瓜蒌皮

瓜蒌皮 --- 半夏 姜汁 桃仁 韭白汁 香豉 瓜蒌皮 郁金

新会皮 --- 人参 半夏 茯苓 新会皮 木香 生益智 当归 桃仁

半夏 --- 半夏 枳实 制大黄 桃仁 韭白汁

附子 --- <D>经云，三阳结谓之膈，又云一阳发病，其传为膈，仲景云，朝食暮吐，暮食朝吐，宿谷不化，名曰胃反，丹溪谓噎膈反胃，名虽不同病出一体，多因气血两虚而成，然历观噎膈反胃之因，实有不同，大抵饮食之际，气忽阻塞，饮食原可下咽，如有物梗塞之状者，名曰噎，心下格拒，饥不能食，或食到喉间，不能下咽者，名曰膈，食下良久复出，或隔宿吐出者，名曰反胃，夫噎膈一症，多因喜怒悲忧恐五志过极，或纵情嗜欲，或恣意酒食，以致阳气内结，阴血内枯而成，治宜调养心脾，以舒结气，填精益血，以滋枯燥，夫反胃乃胃中无阳，不能容受食物，命门火衰，不能熏蒸脾土，以致饮食入胃，不能运化，而为朝食暮吐，暮食朝吐，治宜益火之源，以消阴翳，补土通阳以温脾胃，故先生于噎膈反胃，各为立法以治之，其阳结于上，阴亏于下，而为噎膈者，用通阳开痞，通补胃腑，以及进退黄连，附子泻心诸法，上热下寒为治，其肝阴胃汁枯槁，及烦劳阳亢，肺胃津液枯而成噎膈者，用酸甘济阴，及润燥清燥为主，其液亏气滞，及阳衰血瘀而成噎膈者，用理气逐瘀，兼通血络为主，其胃阳虚而为噎膈反胃，及忧郁痰阻而成者，用通补胃腑，辛热开浊，以及苦降辛通，佐以利痰清膈为主，其肝郁气逆而为噎膈者，两通厥阴阳明为治，其酒热郁伤肺胃，气不降而为噎膈者，用轻剂清降，及苦辛寒开肺为主，而先生于噎膈反胃治法，可谓无遗蕴矣，张景岳云，治噎膈大法，当以脾肾为主，其理甚通，当宗之，又有饮膈热膈，及忧气恚食寒之膈，其主治各载本门，兹不复赘。（邹滋九）

人参 --- 徐评 果系膈症，百无一生，不必言治，若反胃则古人自有主方，不得泛用通治之品，此老尚未明也，案中多用人参，其意以为不食胃虚，不可不用参以补其精气，不知噎膈之症，必有瘀血顽痰逆气，阻膈胃气，其已成者，百无一治，其未成者，用消瘀去痰降气之药，或可望其通利，若用人参，虽或一时精气稍旺，而病根益深，永无愈期矣。</D>