三七 --- 钱（三七） 脉细，右坚大，向有气冲，长夏土旺，呕吐不纳食，头胀脘痹，无非厥阳上冒，议用苦辛降逆，酸苦泄热，不加嗔怒，胃和可愈。

广皮白 --- 川连 半夏 姜汁 川楝子皮 乌梅 广皮白

附子 --- 炮附子 人参 半夏 吴萸 淡姜 茯苓

广皮白 --- 吴萸 半夏 姜汁 茯苓 公丁香柄 广皮白

淡附子 --- 淡附子 淡干姜 姜汁 生白芍 淡吴萸 白粳米

甘草 --- 温胆合左金为宜，去甘草、茯苓，加姜汁。

紫石英 --- 人参 川椒 乌梅 茯苓 紫石英 桑螵蛸

木瓜 --- 淡吴萸 厚朴 草蔻 藿香梗 木瓜 茯苓

炒白粳米 --- 小半夏汤加檀香泥、炒白粳米。

姜汁 --- 大半夏汤加姜汁桂枝南枣。

炒麦冬 --- 人参 炒半夏 炒麦冬 茯神 广皮白 炒香白粳米

乌梅肉 --- 炒黑川椒 乌梅肉 生干姜 川桂枝木 人参 白芍

吴茱萸 --- 某 积劳伤阳，先已脘痛引背，昨频吐微眩，脉弱汗出，胃中已虚，肝木来乘，防有呃忒吐蛔，仿仲景食入则呕者，吴茱萸汤主之。

葛 --- 张（氏） 勉强攻胎，气血受伤，而为寒热，经脉乏气，而为身痛，乃奇经冲任受病，而阳维脉不用事也，内经以阳维为病苦寒热，维者，一身之刚维也，既非外感，羌苏柴葛三阳互发，世无是病，又芩栀枳朴之属，辛散继以苦寒，未能中病，胃日屡伤，致汤饮皆哕出无余，大便不通，已经半月，其吐出形色青绿涎沫，显然肝风大动，将胃口翻空，而肠中污水，得风翔如浪决，东西荡漾矣，熄风镇胃，固是定理，但危笃若此，不易图也。

南枣肉 --- 淮小麦（百粒） 火麻仁（一钱） 阿胶（二钱） 生地（二钱） 秋石拌人参（一钱） 南枣肉（一钱）

桂枝木 --- 韭白根 淡吴萸 小茴香 桂枝木 两头尖 茯苓

川楝子 --- 吴萸 丁香 藿香 川楝子 木香 广皮 茯苓

白术 --- 半夏 厚朴 生益智 姜汁 生白术 茯苓

椒目 --- 宋（三四） 阳微不运，水谷悍气聚湿，致食入即呕，周身牵掣不和，乃阳明之脉，不用事也，久延恐致肿胀，苓姜术桂汤加厚朴椒目。

淡干姜 --- 半夏 姜汁 淡干姜 秦椒 厚朴 茯苓

半夏 --- 王 诊脉右濡左弦，舌白不饥，瘀血上吐下泻，胃阳大伤，药饵下咽则涌，前医用大半夏汤不应，询知所吐皆系酸水痰沫，议以理阳方法。

炒白粳米 --- 人参 淡熟附子 茯苓 炒白粳米 炒黄淡干姜

猪胆汁 --- 金 参药不受，皆浊阴在上，阻塞气机，几无法矣，勉与白通汤加人尿猪胆汁，急进以通阳泄浊。

猪胆汁 --- 附子 生淡姜 葱白（五寸） 人尿 猪胆汁

旋覆花 --- 人参 焦术 炒焦半夏 茯苓 旋覆花 代赭石

附子 --- 吴 寒热邪气扰中，胃阳大伤，酸浊上涌吐出，脘痛如刺，无非阳衰，阴浊上僭，致胃气不得下行，高年下元衰惫，必得釜底暖蒸，中宫得以流通，拟用仲景附子泻心汤，通阳之中，原可泄热开导，煎药按法用之。

熟附子 --- 人参（一钱半） 熟附子（一钱半） 淡干姜（一钱） 三味另煎汁 川连（六分） 炒半夏（一钱半） 枳实（一钱） 茯苓（三钱）

姜汁 --- 先煎一杯，入姜汁四分。

生姜 --- 孙（十四） 食物随入即吐，并不渴饮，当年以苦辛得效，三载不发，今心下常痛如辣，大便六七日始通，议通膈上，用生姜泻心汤。

半夏 --- 某（五二） 诊脉左弦右弱，食粥脘中有声，气冲涌吐，此肝木乘胃，生阳已薄，皆情怀不适所致，大半夏汤。

干姜 --- 炒黄干姜（一钱） 川椒（炒三分） 半夏（一钱炒） 茯苓块（三钱） 炒饴糖（四钱）

附子 --- 某（氏） 脉微肢冷，呕吐清水，食不下化，带下，脊髀酸软，阳气素虚，产后奇脉不固，急扶其阳，用附子理中汤。

附子 --- 附子 人参 生白术 炮姜 炙草

黄芪 --- 养营去远志黄芪、五味，即作丸方。

芳香 --- 吴（三六） 壮年形伟，脉小濡，恶闻秽气，食入呕哕，缘阳气微弱，浊阴类聚，口鼻受污浊异气，先入募原，募原是胃络分布，上逆而为呕吐，此病理标者，用芳香辟秽，扶正气治本，以温上通阳。（阳虚吸受秽浊气）

砂仁 --- 藿香 草果 公丁香 茯苓 厚朴 砂仁壳 广皮 荜茇

金石斛 --- 鲜竹茹（一钱半） 半夏（一钱半） 金石斛（三钱） 茯苓（一钱半） 广皮白（一钱半） 枳实（一钱） 姜汁（一匙调）

黑山栀 --- 炒竹茹 半夏 川斛 橘红 黑山栀 香豉

鹿角霜 --- 后加鹿角霜。

淡黄芩 --- 川连 淡黄芩 半夏 姜汁 黑山栀 枳实汁

麦门冬 --- 某 舌黄不渴饮，久嗽欲呕吐，前用金匮麦门冬汤养胃小效，自述背寒口吐清痰，暑湿客邪未尽，虚体，当辅正醒脾却暑。

人参 --- <D>呕吐症，内经与金匮论之详矣，乃后人但以胃火胃寒痰食气滞立论，不思胃司纳食，主乎通降，其所以不降而上逆呕吐者，皆由于肝气冲逆，阻胃之降而然也，故灵枢经脉篇云，足厥阴肝所生病者，胸满呕逆，况五行之生克，木动则必犯土，胃病治肝，不过隔一之治，此理浅近易明，人乃不能察，而好奇之辈，反夸隔二隔三之治，岂不见笑于大方也哉，试观安胃丸，理中安蛔丸，所用椒梅，及胃虚客气上逆之旋复代赭，此皆胃药乎，抑肝药乎，于此可省悟矣，今观先生之治法，以泄肝安胃为纲领，用药以苦辛为主，以酸佐之，如肝犯胃而胃阳不衰有火者，泄肝则用芩连，楝之苦寒，如胃阳衰者，稍减苦寒，用苦辛酸热，此其大旨也，若肝阴胃汁皆虚，肝风扰胃呕吐者，则以柔剂滋液养胃，熄风镇逆，若胃阳虚，浊阴上逆者，用辛热通之，微佐苦降，若但中阳虚而肝木不甚亢者，专理胃阳，或稍佐椒梅，若因呕伤，寒郁化热，劫灼胃津，则用温胆汤加减，若久呕延及肝肾皆虚，冲气上逆者，用温通柔润之补，下焦主治，若热邪内结，则用泻心法，若肝火冲逆伤肺，则用养金制木，滋水制火，总之治胃之法，全在温通，虚则必用人参，药味皆属和平，至于治肝之法，药味错杂，或寒热互用，或苦辛酸咸并投，盖因厥阴有相火内寄治法不得不然耳，但观仲景乌梅丸法，概可知矣，案辑六十有余，大半皆由肝邪为患，非先生之卓识，安能畅发此理乎哉。（华岫云）

人参 --- 徐评 所录诸方，属蓄饮者四五，属反胃者二三，反胃自有主治之法，蓄饮亦有成方可用，乃全不分别，惟以治肝胃之药参错成方，又用人参及姜附者七八，皆与反胃蓄饮相反，则呕吐一症，此老全未梦见也，患诸病者，亦大不幸矣，洞庭有一金姓者，患呕吐症数年，其先人与此老甚相契，此老竭力治之年余，皆用此等方，而病者几殆，因求治于余，余曰蓄饮也，世无知者，为制一方，其病立已，其人因受业于余，即此可征矣。</D>