炒山楂 --- 川连 芦荟 莱菔子 炒山楂 广皮 川楝子 山栀 厚朴（姜汁炒） 青皮

广皮白 --- 杏仁 郁金 厚朴 广皮白 芦荟 川楝子

大苦 --- 李（四九） 诊脉如前，服咸苦入阴，大便仍秘涩，针刺一次，病无增减，可谓沉锢之疾，夫病着深远，平素饮酒厚味，酿湿聚热，渍筋烁骨，既已经年不拔，区区汤液，焉能通逐，议以大苦寒坚阴燥湿方法，参入酒醴引导，亦同气相求之至理。（湿火）

金毛狗脊 --- 黄柏 茅术 生大黄 干地龙 金毛狗脊 川连 萆薢 晚蚕砂 穿山甲 汉防己 仙灵脾 海金沙 川独活 北细辛 油松节 白茄根

盐 --- 朱 足麻偻废，大热阴伤，内郁，大便不通，由怀抱不舒病加，先用滋肾丸四钱，盐汤下四服。（肾燥热）

肉苁蓉 --- 当归 麻仁 柏子仁 肉苁蓉 松子肉

麦冬 --- 某 液耗胃弱，火升便难，三才加麦冬茯神川斛。

炒杞子 --- 炒杞子 沙苑 天冬 桂酒拌白芍 茯苓 猪脊筋

川石斛 --- 龟甲心 生地 阿胶 锁阳 川石斛

鲜生地 --- 鲜生地（八钱） 阿胶（三钱） 天冬（一钱半） 人中白（一钱） 川斛（二钱） 寒水石（一钱）

柏子霜 --- （丸方） 生地（三钱） 阿胶（二钱） 天冬（一钱） 麦冬（一钱） 柏子霜（二钱） 松子仁（二钱）

咸苁蓉 --- 虎潜丸去琐阳，加咸苁蓉猪脊筋丸。

郁李仁 --- 柏子仁 当归 红花 桃仁 郁李仁 牛膝

柏子仁 --- 柏子仁 归须 菠菜 韭菜 五灵脂 桃仁 丹皮

郁李仁 --- 火麻仁 郁李仁 柏子仁 松子仁 桃仁 当归 白芍 牛膝

冬葵子 --- 当归 桃仁 红花 郁李仁 冬葵子 柏子霜 芦荟 松子肉

冬葵子 --- 桃仁 冬葵子 皂荚核 郁李仁 大黄 降香 郁金

桃仁 --- 李 据云，两次服辛温药，瘀浊随溢退场门，此必热瘀在肝胃络间，故脘胁痞胀，大便阻塞不通，芦荟苦寒通其阴，仅仅更衣，究竟未能却瘀攻病，有年久恙，自当缓攻，汤药荡涤，理难于用，议以桃仁承气汤为丸。

丹皮 --- 导赤散加丹皮赤苓。

芳香 --- 汪 秋暑秽浊，由吸而入，寒热如疟，上咳痰，下洞泄，三焦皆热，气不化则小便不通，拟芳香辟秽，分利渗热，必要小溲通为主。

泽泻 --- 藿香梗 厚朴 檀香汁 广皮 木瓜 猪苓 茯苓 泽泻

六一散 --- 六一散。

大杏仁 --- 飞滑石 石膏 寒水石 大杏仁 厚朴 猪苓 泽泻 丝瓜叶

防己 --- 防己 茯苓皮 猪苓 通草 海金沙 苡仁

泽泻 --- 滑石 石膏 寒水石 猪苓 泽泻

泽泻 --- 葶苈 杏仁 厚朴 大腹皮 猪苓 泽泻

附子 --- 生干姜 爆黑川附子

猪胆汁 --- 调入猪胆汁。

当归须 --- 芦荟 川楝子 郁李仁 炒桃仁 当归须 红花

西瓜翠衣 --- 苇茎汤去瓜瓣，加滑石、通草、西瓜翠衣。

山栀皮 --- 黄芩 黄连 厚朴 枳实 青皮 卜子 丹皮 山栀皮

盐 --- 先用滋肾丸，每早服三钱，淡盐汤送。

干白 --- 某 脉动数，舌干白，不欲饮水，交夏脐下左右攻痛，服米饮痛缓，超时复痛，六七日大便不通，小溲甚少，部位在小肠，屈曲有阻乃痛，未便骤认虫病，凡六腑宜通，通则不痛，以更衣丸二钱，专通火腑之壅结，一服。

制大黄 --- 桃仁 红花 郁李仁 制大黄 归须 小茴 桂枝木 川楝子

生大黄 --- 川芎（一两醋炒） 当归（一两醋炒） 生大黄（一两） 肉桂（三钱） 川楝子（一两） 青皮（一两） 蓬术（煨五钱） 三棱（煨五钱） 五灵脂（醋炒五钱） 炒黑楂肉（一两） 小香附（醋炒一两）

红枣 --- 上为末，用青葱白去根捣烂，略加清水淋滤清汁泛为丸，每日进食时服三钱，用红枣五枚，生艾叶三分，煎汤一杯服药。

两头尖 --- 老韭根 穿山甲 两头尖 川楝子 归须 小茴 橘红 乳香

通草 --- 通草五钱，海金沙五钱，煎汤代水。

黑山栀 --- 川连 黑山栀 丹皮 川楝子 吴萸 海金沙 飞滑石

大苦 --- <D>按便闭症，当与肠痹淋浊门兼参，其大便不通，有血液枯燥者，则用养血润燥，若血燥风生，则用辛甘熄风，或咸苦入阴，故三才五仁通幽虎潜等法，所必用者也，若血液燥则气亦滞，致气血结痹，又当于养阴润燥中，加行气活血之品，若火腑秘结，宜苦滑重镇者，用更衣丸以通之，若老人阳衰风闭，用半硫丸温润以通之，腑阳不行，则用玉壶丹，阳窒阴凝，清浊混淆痞胀，用来复丹，若郁热阻气，则用苦寒泄热，辛以开郁，或用三焦通法，若湿热伤气，阻遏经腑，则理肺气以开降之，此治大便之闭也，小便闭者，若小肠火结，则用导赤，湿壅三焦，则用河间分消，膀胱气化失司，则用五苓，若湿郁热伏，致小肠痹郁，用小温中丸清热燥湿，若肾与膀胱阴分蓄热致燥，无阴则阳无以化，故用滋肾丸，通下焦至阴之热闭，以上诸法，前人虽皆论及，然经案中逐一分晰发明，不啻如耳提面命，使人得有所遵循矣，至若膏粱曲蘖，酿成湿火，渍筋烁骨，用大苦寒坚阴燥湿，仍用酒醴引导，又厥阴热闭为癃，少腹胀满，用秽浊气味之品，直泄厥阴之闭，此皆发前人未发之秘，学人尤当究心焉，大凡小便闭而大便通调者，或系膀胱热结，或水源不清，湿症居多，若大便闭而小便通调者，或二肠气滞，或津液不流，燥症居多，若二便俱闭，当先通大便，小溲自利，此其大略也，至若胃腑邪热化燥便坚，太阳热邪传入膀胱之腑癃秘，又当于仲景伤寒门下法中，承气五苓等方酌而用之，斯无遗义矣。（华岫云）

猪胆 --- 大便燥结，本有承气汤，更衣等丸下之，外用猪胆蜜煎润之，可谓无遗蕴矣，然竟有效有不效者，盖因燥粪未尝不至肛门，奈肛门如钱大，燥粪如拳大，纵使竭力努挣，而终不肯出，下既不得出，则上不能食而告危矣，余友教人，先以胆汁或蜜煎导之，俟粪既至肛门，令病者亲手以中指染油，探入肛门内，将燥粪渐渐挖碎而出，中指须要有指甲者为妙，竟有大便一次，燥粪挖作百余块而出者，据云此法辗转授人，已救四五十人矣，若患此证者，切勿嫌秽而弃之。