 {"value":"60 石斛 半夏 菊花 人参 橘红 当归 蒺藜 熟地 肉苁蓉 茯苓 天冬 天麻 白芍 怀牛膝 麦冬 枸杞子 生地",
 "children": [
     {"value":"28 石斛 半夏 茯苓 菊花 天麻 人参 橘红 钩藤 羚羊角 当归 蒺藜 枸杞子 生地",
     "children": [
         {"value":"12 石斛 羚羊角 丹皮 小胡麻 连翘 玄参 黑稆豆 菊花 何首乌 枸杞子 天麻 生地",
         "children": [
             {"value":"5 橘红 天南星 连翘 羚羊角 玄参 丹皮 石菖蒲 生地",
             "children": [
                 {"value":"2 玄参 石斛 橘红 天南星 钩藤 连翘 犀角 羚羊角 丹皮 石菖蒲 生地",
                 "children": [
                     {"value":"1 玄参 橘红 天南星 连翘 犀角 羚羊角 石菖蒲 生地",
                     "children": []
                    },
                     {"value":"1 石斛 橘红 天南星 钩藤 连翘 丹皮 羚羊角 石菖蒲",
                     "children": []
                    }
                    ]
                },
                 {"value":"3 连翘 羚羊角 玄参 菊花 天麻 丹皮 栀子 天花粉",
                 "children": [
                     {"value":"1 玄参 竹沥 橘红 川贝 连翘 羚羊角 天花粉",
                     "children": []
                    },
                     {"value":"2 玄参 菊花 桑叶 天麻 连翘 丹皮 羚羊角 栀子 天花粉 生地",
                     "children": [
                         {"value":"1 玄参 桑叶 连翘 丹皮 羚羊角 生地",
                         "children": []
                        },
                         {"value":"1 玄参 菊花 天麻 连翘 丹皮 栀子 羚羊角 天花粉",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            },
             {"value":"7 石斛 怀牛膝 小胡麻 黑稆豆 何首乌 菊花 枸杞子 天麻 生地",
             "children": [
                 {"value":"3 小胡麻 石斛 黑稆豆 当归 怀牛膝 何首乌 菊花 枸杞子 天麻",
                 "children": [
                     {"value":"1 石斛 何首乌 菊花 枸杞子 天麻 生地 茯神",
                     "children": []
                    },
                     {"value":"2 小胡麻 黑稆豆 当归 怀牛膝 茯苓 石斛 何首乌 菊花 枸杞子 天冬 天麻 虎骨",
                     "children": [
                         {"value":"1 小胡麻 黑稆豆 当归 怀牛膝 石斛 何首乌 菊花 枸杞子 天麻",
                         "children": []
                        },
                         {"value":"1 小胡麻 黑稆豆 茯苓 石斛 何首乌 菊花 天冬 枸杞子 虎骨",
                         "children": []
                        }
                        ]
                    }
                    ]
                },
                 {"value":"4 牡蛎 肉苁蓉 女贞子 阿胶 石斛 旱莲草 黑稆豆 黄芪 桂圆肉 菊花 枸杞子 甘草 熟地 茯神 生地",
                 "children": [
                     {"value":"2 牡蛎 肉苁蓉 女贞子 阿胶 石斛 旱莲草 黑稆豆 黄芪 桂圆肉 菊花 枸杞子 甘草 熟地 茯神",
                     "children": [
                         {"value":"1 牡蛎 黄芪 桂圆肉 菊花 枸杞子 甘草",
                         "children": []
                        },
                         {"value":"1 黑稆豆 肉苁蓉 女贞子 阿胶 石斛 旱莲草 熟地 茯神",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 小胡麻 黑稆豆 牡蛎 怀牛膝 阿胶 北沙参 知母 石斛 生地",
                     "children": [
                         {"value":"1 牡蛎 阿胶 知母 石斛 生地",
                         "children": []
                        },
                         {"value":"1 小胡麻 黑稆豆 怀牛膝 北沙参 石斛 生地",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        },
         {"value":"16 人参 竹沥 枳实 橘红 钩藤 半夏 生姜 茯苓 蒺藜 陈皮 天麻",
         "children": [
             {"value":"8 人参 桑叶 当归 茯苓 白术 陈皮 黄芪 枸杞子 天麻",
             "children": [
                 {"value":"4 人参 桑叶 当归 黄芪 枸杞子 天麻 白术",
                 "children": [
                     {"value":"2 人参 当归 茯苓 黄芪 枸杞子 天麻 桑叶 白术 白芍 防风",
                     "children": [
                         {"value":"1 人参 当归 茯苓 枸杞子 天麻 桑叶 白术 白芍",
                         "children": []
                        },
                         {"value":"1 当归 黄芪 天麻 桑叶 白术 防风",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 人参 干姜 蒺藜 当归 陈皮 黄芪 大枣 菊花 枸杞子 天麻 白术 甘草 桑寄生",
                     "children": [
                         {"value":"1 人参 干姜 当归 陈皮 黄芪 大枣 天麻 白术 甘草",
                         "children": []
                        },
                         {"value":"1 蒺藜 当归 黄芪 菊花 枸杞子 天麻 白术 桑寄生",
                         "children": []
                        }
                        ]
                    }
                    ]
                },
                 {"value":"4 人参 钩藤 半夏 茯苓 陈皮 天麻",
                 "children": [
                     {"value":"2 人参 蒺藜 茯苓 陈皮 地栗粉 枳实 天麻 钩藤 黄连 半夏",
                     "children": [
                         {"value":"1 茯苓 陈皮 天麻 钩藤 半夏",
                         "children": []
                        },
                         {"value":"1 人参 蒺藜 茯苓 陈皮 地栗粉 枳实 天麻 钩藤 黄连 半夏",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 人参 茯苓 陈皮 秋石 天南星 香附 关白附 生地",
                     "children": [
                         {"value":"1 人参 茯苓 陈皮 天南星 香附 关白附",
                         "children": []
                        },
                         {"value":"1 人参 茯苓 秋石 生地",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            },
             {"value":"8 人参 竹沥 枳实 橘红 半夏 生姜 茯苓 蒺藜",
             "children": [
                 {"value":"4 竹沥 橘红 钩藤 羚羊角 半夏 生姜 茯苓 桂枝 石菖蒲",
                 "children": [
                     {"value":"2 生姜 竹沥 茯苓 石斛 枳实 橘红 天南星 钩藤 石菖蒲 半夏",
                     "children": [
                         {"value":"1 生姜 竹沥 茯苓 枳实 橘红 天南星 石菖蒲 半夏",
                         "children": []
                        },
                         {"value":"1 生姜 竹沥 茯苓 石斛 橘红 钩藤 石菖蒲 半夏",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 郁金 蒺藜 生姜 竹沥 茯苓 桂枝 橘红 钩藤 羚羊角 半夏",
                     "children": [
                         {"value":"1 郁金 生姜 竹沥 茯苓 桂枝 橘红 羚羊角 半夏",
                         "children": []
                        },
                         {"value":"1 蒺藜 茯苓 桂枝 橘红 钩藤 羚羊角 半夏",
                         "children": []
                        }
                        ]
                    }
                    ]
                },
                 {"value":"4 人参 枳实 半夏 蒺藜 茯苓 白芍",
                 "children": [
                     {"value":"2 乌梅 人参 蒺藜 生姜 竹沥 茯苓 枳实 盐水炒广皮 橘红 盐水炒黄连 白芍 半夏",
                     "children": [
                         {"value":"1 乌梅 人参 蒺藜 茯苓 枳实 盐水炒广皮 盐水炒黄连 白芍 半夏",
                         "children": []
                        },
                         {"value":"1 人参 蒺藜 生姜 竹沥 茯苓 枳实 橘红 半夏",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 人参 桑枝 蒺藜 茯苓 当归 陈皮 菊花 枸杞子 白芍 半夏 甘草",
                     "children": [
                         {"value":"1 人参 蒺藜 茯苓 菊花 枸杞子 半夏",
                         "children": []
                        },
                         {"value":"1 人参 桑枝 当归 茯苓 陈皮 白芍 半夏 甘草",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        }
        ]
    },
     {"value":"32 肉苁蓉 石斛 附子 茯神 天冬 人参 怀牛膝 麦冬 五味子 远志 枸杞子 熟地 生地",
     "children": [
         {"value":"16 人参 肉苁蓉 石斛 当归 怀牛膝 附子 五味子 远志 巴戟天 枸杞子 熟地",
         "children": [
             {"value":"8 五味子 人参 牡蛎 黄芪 龙骨 附子",
             "children": [
                 {"value":"4 人参 附子",
                 "children": [
                     {"value":"2 人参 黄芪 熟术 附子",
                     "children": [
                         {"value":"1 人参 黄芪 熟术 附子",
                         "children": []
                        },
                         {"value":"1 人参 附子",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 五味子 人参 干姜 牡蛎 猪胆汁 龙骨 附子",
                     "children": [
                         {"value":"1 五味子 人参 干姜 猪胆汁 附子",
                         "children": []
                        },
                         {"value":"1 五味子 人参 牡蛎 龙骨 附子",
                         "children": []
                        }
                        ]
                    }
                    ]
                },
                 {"value":"4 牡蛎 生姜 川羌 黄芪 桂枝 片姜黄 大枣 远志 至宝丹 龙骨 附子",
                 "children": [
                     {"value":"2 至宝丹",
                     "children": [
                         {"value":"1 至宝丹",
                         "children": []
                        },
                         {"value":"1 至宝丹",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 牡蛎 生姜 川羌 黄芪 桂枝 片姜黄 大枣 远志 龙骨 附子",
                     "children": [
                         {"value":"1 川羌 黄芪 桂枝 片姜黄 远志 附子",
                         "children": []
                        },
                         {"value":"1 牡蛎 生姜 黄芪 桂枝 大枣 远志 龙骨 附子",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            },
             {"value":"8 肉苁蓉 石斛 虎骨 当归 怀牛膝 远志 巴戟天 枸杞子 熟地",
             "children": [
                 {"value":"4 肉苁蓉 石斛 天冬 虎骨 柏子仁 当归 怀牛膝 枸杞子 黄柏 熟地",
                 "children": [
                     {"value":"2 肉苁蓉 石斛 虎骨 萆薢 柏子仁 砂仁 巴戟天 当归 怀牛膝 茯苓 何首乌 枸杞子 小茴香 熟地",
                     "children": [
                         {"value":"1 柏子仁 巴戟天 肉苁蓉 当归 怀牛膝 石斛 枸杞子 小茴香",
                         "children": []
                        },
                         {"value":"1 柏子仁 砂仁 肉苁蓉 怀牛膝 茯苓 石斛 何首乌 虎骨 萆薢 熟地",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 龟甲 肉苁蓉 怀牛膝 当归 石斛 天冬 枸杞子 黄柏 虎骨 白芍 熟地",
                     "children": [
                         {"value":"1 龟甲 肉苁蓉 怀牛膝 天冬 枸杞子 黄柏 虎骨 熟地",
                         "children": []
                        },
                         {"value":"1 肉苁蓉 当归 怀牛膝 石斛 天冬 黄柏 白芍 熟地",
                         "children": []
                        }
                        ]
                    }
                    ]
                },
                 {"value":"4 五味子 肉苁蓉 远志 巴戟天 当归 怀牛膝 枸杞子 石菖蒲 沙苑子 熟地",
                 "children": [
                     {"value":"2 巴戟天 肉苁蓉 当归 枸杞子 天麻 虎骨 远志 石菖蒲 桑寄生 沙苑子 熟地",
                     "children": [
                         {"value":"1 巴戟天 肉苁蓉 当归 枸杞子 天麻 虎骨 桑寄生 沙苑子",
                         "children": []
                        },
                         {"value":"1 巴戟天 肉苁蓉 当归 枸杞子 远志 石菖蒲 沙苑子 熟地",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 五味子 肉苁蓉 石斛 山萸肉 远志 羚羊角 怀牛膝 茯苓 麦冬 菊花 枸杞子 石菖蒲 熟地 茯神",
                     "children": [
                         {"value":"1 五味子 肉苁蓉 怀牛膝 石斛 菊花 枸杞子 山萸肉 远志 熟地 茯神",
                         "children": []
                        },
                         {"value":"1 五味子 肉苁蓉 怀牛膝 茯苓 麦冬 枸杞子 远志 羚羊角 石菖蒲 熟地",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        },
         {"value":"16 茯神 南沙参 天冬 梨 白扁豆 白芍 人参 麦冬 柿蒂 甘蔗 生地",
         "children": [
             {"value":"8 人参 百合 麦冬 五味子 北沙参 天冬 梨 白扁豆 柿蒂 甘蔗 生地",
             "children": [
                 {"value":"4 五味子 人参 天冬 麦冬 生地 甘草",
                 "children": [
                     {"value":"2 五味子 人参 麦冬 黄芪 天冬 梨 燕窝菜 生地 熟地 甘草 茯神",
                     "children": [
                         {"value":"1 五味子 人参 麦冬 天冬 生地",
                         "children": []
                        },
                         {"value":"1 五味子 人参 麦冬 黄芪 天冬 梨 燕窝菜 熟地 甘草 茯神",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 玄参 人参 甘蔗 阿胶 麦冬 石斛 大枣 火麻仁 远志 石菖蒲 甘草 生地",
                     "children": [
                         {"value":"1 人参 阿胶 麦冬 大枣 火麻仁 甘草 生地",
                         "children": []
                        },
                         {"value":"1 玄参 甘蔗 麦冬 石斛 远志 石菖蒲 生地",
                         "children": []
                        }
                        ]
                    }
                    ]
                },
                 {"value":"4 百合 北沙参 南沙参 天冬 梨 白扁豆 柿蒂 甘蔗 麦冬",
                 "children": [
                     {"value":"2 甘蔗 百合 北沙参 麦冬 白扁豆 杏仁 天花粉 柿蒂 茯神",
                     "children": [
                         {"value":"1 百合 北沙参 麦冬 白扁豆 杏仁 茯神",
                         "children": []
                        },
                         {"value":"1 甘蔗 百合 北沙参 麦冬 白扁豆 天花粉 柿蒂",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 甘蔗 蒺藜 竹沥 芦根 麦冬 南沙参 天冬 梨 天麻 薏苡仁 白扁豆 柿蒂",
                     "children": [
                         {"value":"1 甘蔗 麦冬 南沙参 天冬 梨 薏苡仁 白扁豆 柿蒂",
                         "children": []
                        },
                         {"value":"1 甘蔗 蒺藜 竹沥 芦根 麦冬 南沙参 天冬 梨 天麻 柿蒂",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            },
             {"value":"8 人参 黄连 桑叶 竹叶 酸枣仁 茯神 天冬 白芍 生地",
             "children": [
                 {"value":"4 龟甲 人参 干姜 肉苁蓉 黄连 虎骨 陈皮 黄柏 白芍 生地",
                 "children": [
                     {"value":"2 乌梅 人参 牡蛎 阿胶 天冬 鸡子黄 黄连 白芍 半夏 生地",
                     "children": [
                         {"value":"1 乌梅 人参 牡蛎 黄连 白芍 半夏",
                         "children": []
                        },
                         {"value":"1 阿胶 天冬 鸡子黄 黄连 白芍 生地",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 龟甲 丹参 干姜 人参 肉苁蓉 黄连 虎骨 玄参 竹叶 陈皮 黄柏 犀角 白芍 生地",
                     "children": [
                         {"value":"1 龟甲 干姜 肉苁蓉 陈皮 黄柏 虎骨 白芍 生地",
                         "children": []
                        },
                         {"value":"1 丹参 玄参 人参 竹叶 黄连 犀角 生地",
                         "children": []
                        }
                        ]
                    }
                    ]
                },
                 {"value":"4 人参 知母 石斛 橘红 秦皮 桑叶 钩藤 薏苡仁 竹叶 麦冬 酸枣仁 川芎 杏仁 玉竹 茯神 小胡麻 南沙参 天冬 浙贝 白扁豆 蒺藜 草决明 何首乌 白芍 甘草",
                 "children": [
                     {"value":"2 小胡麻 人参 知母 何首乌 酸枣仁 天冬 桑叶 薏苡仁 川芎 甘草 茯神",
                     "children": [
                         {"value":"1 小胡麻 人参 何首乌 酸枣仁 桑叶 薏苡仁 甘草 茯神",
                         "children": []
                        },
                         {"value":"1 人参 知母 天冬 酸枣仁 川芎 茯神",
                         "children": []
                        }
                        ]
                    },
                     {"value":"2 石斛 南沙参 橘红 秦皮 桑叶 钩藤 浙贝 白扁豆 蒺藜 竹叶 草决明 麦冬 白芍 杏仁 玉竹",
                     "children": [
                         {"value":"1 蒺藜 草决明 石斛 橘红 秦皮 桑叶 钩藤 白芍",
                         "children": []
                        },
                         {"value":"1 竹叶 麦冬 南沙参 桑叶 浙贝 白扁豆 杏仁 玉竹",
                         "children": []
                        }
                        ]
                    }
                    ]
                }
                ]
            }
            ]
        }
        ]
    }
    ]
}
