于（五五） 郁损心阳，阳坠入阴为淋浊，由情志内伤，即为阴虚致病，见症乱治，最为庸劣，心藏神，神耗如愦，诸窍失司，非偏寒偏热药治，必得开爽，冀有向安，服药以草木功能，恐不能令其欢悦。（郁损心阳）

妙香散。

陆（二六） （心脾气结神志不清）

各三分磨汁。

胡（四六） 悲泣，乃情怀内起之病，病生于郁，形象渐大，按之坚硬，正在心下，用苦辛泄降，先从气结治。（心下痞结）

川连 干姜 半夏 姜汁 茯苓 连皮瓜蒌

季（六九） 老年情志不适，郁则少火变壮火，知饥，脘中不爽，口舌糜腐，心脾营损，木火劫烁精华，肌肉日消，惟怡悦开爽，内起郁热可平，但执清火苦寒，非调情志内因郁热矣。（郁损心脾营内热）

金石斛 连翘心 炒丹皮 经霜桑叶 川贝 茯苓

接服养心脾之营，少佐苦降法。

人参 川连 炒丹皮 生白芍 小麦 茯神

某 脘痛已止，味酸，乃肝郁也。（肝郁）

某 初起左边麻木，舌强，筋吊脑后痛，痰阻咽喉，此系肝风上引，必由情怀郁勃所致。

羚羊角 连翘心 鲜生地 玄参 石菖蒲 郁金汁

某 气郁不舒，木不条达，嗳则少宽。

逍遥散去白术加香附。

某 肝郁成热。

加味逍遥去白术加郁金。

某 郁热吞酸。

温胆汤加山栀丹皮郁金姜汁炒黄连。

沈（四三） 脉虚涩，情怀失畅，肝脾气血多郁，半载不愈，难任峻剂，议以局方逍遥散，兼服补中益气，莫以中宫虚塞为泥。（肝脾气血郁）

吴（四十） 劳倦嗔怒致伤，病在肝脾，久有脑泄，髓脂暗损，暂以解郁，继当宣补。

钩藤 生香附 丹皮 桑叶 神曲 白芍 茯苓 广皮

叶（氏） 悒郁动肝致病，久则延及脾胃，中伤不纳，不知味，火风变动，气横为痛为胀，疏泄失职，便秘忽泻，情志之郁，药难霍然，数年久病，而兼形瘦液枯，若再香燥劫夺，必变格拒中满，与辛润少佐和阳。

柏子仁（二钱） 归须（二钱） 桃仁（三钱） 生白芍（一钱） 小川连（三分） 川楝子（一钱）

某 恼怒肝郁，思虑脾伤，面黄脉涩，寤不成寐，宗薛氏法治之。

人参 黄芪 熟于术 茯神 枣仁 桂圆肉 当归 炙草 黑山栀 丹皮 远志

戴（氏） 隐情曲意不伸，是为心疾，此草木攻病，难以见长，乃七情之郁损，以丹溪越鞠方法。

香附 川芎 小川连 茯苓 半夏 橘红 炒楂肉

神曲浆丸。

程（妪） 脉弦涩，外寒内热，齿痛舌干，无寐，乃肝脾郁结不舒。

吴（四一） 操持过动，肝胆阳升，胃气日减，脉应左搏，从郁热治。（肝胆郁热）

丹皮 黑山栀 薄荷梗 钩藤 广皮 白芍 茯苓 神曲

陆（二四） 郁伤，筋胀心痛。

王（六三） 劳怒伤阳，气逆血郁致痛，痞胀便溏，风木侮土，前方既效，与通补阳明厥阴。（肝犯胃气逆血郁）

大半夏汤加桃仁、柏仁、当归、姜枣汤法。

朱（三二） 因抑郁悲泣，致肝阳内动，阳气变化火风，有形有声，贯膈冲咽，自觉冷者，非真寒也，内经以五志过极皆火，但非六气外来，芩连之属，不能制伏，固当柔缓以濡之，合乎肝为刚脏，济之以柔，亦和法也。（肝郁风火升）

生地 天冬 阿胶 茯神 川斛 牡蛎 小麦 人中白

熬膏。

赵（四四） 郁勃日久，五志气火上升，胃气逆则脘闷不饥，肝阳上僭，风火凌窍，必旋晕咽痹，自觉冷者，非真寒也，皆气痹不通之象，病能篇以诸禁鼓栗属火，丹溪谓上升之气，从肝胆相火，非无据矣。

朱（氏） 脉弦右大，乳房刺痛，经阻半年，若遇劳怒，腹痛逆气上冲，此邪郁既久，少火化为壮火，气钝不循，胞脉遂痹，治以泄少阳补太阴，气血流利，郁热可解。（胆脾气血郁。）

吴（三八） 脉弦涩数，颈项结瘿，咽喉痛肿阻痹，水谷难下，此皆情志郁勃，肝胆相火内风，上循清窍，虽清热直降，难制情怀之阳，是以频药勿效也。（木火上升喉肿痹。）

鲜枇杷叶 射干 牛蒡子 苏子 大杏仁 紫降香

朱 情怀悒郁，五志热蒸，痰聚阻气，脘中窄隘不舒，胀及背部，上焦清阳欲结，治肺以展气化，务宜怡悦开怀，莫令郁痹绵延。（木火上升肺不肃降）

吴（氏） 气血郁痹，久乃化热，女科八脉失调，渐有经阻瘕带诸疾，但先治其上，勿滋腻气机。（郁热先清上焦。）

黑山栀皮 炒黄川贝 枇杷叶 瓜蒌皮 杏仁 郁金 橘红

徐（氏） 火升头痛，来去无定期，咽喉垂下心悸，二便不爽，带下不已，固奇经，通补阳明，及养肝熄风，展转未能却病，病从情志内伤，治法惟宜理偏，议先用滋肾丸三钱，早上淡盐汤送，四服。（阴火上炎）

虞（三四） 脉数，舌白神呆，得之郁怒。（郁热。）

犀角 羚羊角 野郁金 炒远志 鲜石菖蒲 炒丹皮 黑山栀 茯神

王（三十） 痰多咽痛，频遭家难，郁伤，心中空洞，呛逆不已，议与胃药。（郁伤胃）

金匮麦门冬汤。

陆（二五） 病起忧虑上损，两年调理，几经反复，今夏心胸右胁之间，常有不舒之象，此气内郁少展，支脉中必有痰饮气阻，是宣通流畅脉络，夏季宜进商矣。（郁损脉络痰饮阻气）

天竺黄 茯神 郁金 橘红 远志 石菖蒲 丹参 琥珀

竹沥法丸。

赵（六二） 脉左涩，右弦，始觉口鼻中气触腥秽，今则右胁板痛，呼吸不利，卧着不安，此属有年郁伤，治当宣通脉络。（血络郁痹右胁痛）

金铃子 延胡 桃仁 归须 郁金 降香

王（女） 阴虚，齿衄肠血，未出阁，郁热为多，与养肝阴方。（郁热伤肝阴）

生地 天冬 阿胶 女贞子 旱莲草 白芍 茯神 乌骨鸡

张（六六） 情志连遭郁勃，脏阴中热内蒸，舌绛赤糜干燥，心动悸，若饥，食不加餐，内伤情怀起病，务以宽怀解释，热在至阴，咸补苦泄，是为医药。（肝肾郁热）

许 厥阴少阴，脏液干涸，阳升结痹于喉舌，皆心境失畅所致，药无效者，病由情怀中来，草木凉药，仅能治六气外来之偏耳。（肝肾液涸阳升喉痹）

熟地 女贞 天冬 霍山石斛 柏子仁 茯神

龙（五六） 久郁气血不行，升降皆钝，外凉内热，骨节沉痛，肌肿腹膨，肤腠无汗，用药务在宣通五郁六郁大旨。（经络气血郁痹）

香附汁 白蒺藜 钩藤 丹皮 山栀 抚芎 泽兰 姜黄 神曲

金 气血久郁成热脘胁痹闷不通，常有风疹腹痛，瘀痹已深，发时宜用通圣一剂，半时以通调气热之郁。

土瓜蒌皮 枇杷叶 黑山栀 郁金 桃仁 杏仁

杨 惊惶忿怒都主肝阳上冒，血沸气滞，瘀浊宜宣通以就下，因误投止塞，旧瘀不清，新血又瘀络中，匝月屡屡反复，究竟肝胆气血皆，郁仍宜条达宣扬，漏疡在肛，得体中稍健设法。

旋覆花 新绛 青葱管 炒桃仁 柏子仁

赵（氏） 瘰疬，寒热盗汗，脘中瘕聚，经期不来，大便溏，呛咳减食，春深至冬未痊，此乃郁损成劳，难治之症。（郁劳）

胡（氏） 头项结核，暮夜寒热盗汗，此乃忧郁不解，气血皆虚，倘若经阻，便难调治。

张（氏） 据说丧子悲哀，是情志中起，因郁成劳，知饥不能食，内珠忽陷忽胀，两胁忽若刀刺，经先期，色变瘀紫，半年来医药无效者，情怀不得解释，草木无能为矣。

人参 当归 生白芍 炙草 肉桂 炒杞子 茯苓 南枣

<D>素问六元正纪大论言：五郁之发，乃因五运之气，有太过不及，遂有胜复之变，由此观之，天地且有郁，而况于人乎，故六气着人，皆能郁而致病，如伤寒之邪，郁于卫，郁于营，或在经在腑在脏，如暑湿之蕴结在三焦，瘟疫之邪，客于募原，风寒湿三气杂感而成痹症，总之邪不解散即谓之郁，此外感六气而成者也，前人论之详矣，今所辑者，七情之郁居多，如思伤脾，怒伤肝之类是也，其原总由于心，因情志不遂，则郁而成病矣，其症心脾肝胆为多，案中治法，有清泄上焦郁火，或宣畅少阳，或开降肺气，通补肝胃，泄胆补脾，宣通脉络，若热郁至阴，则用咸补苦泄，种种治法未能按症分析详论，今举其大纲，皆因郁则气滞，气滞久则必化热，热郁则津液耗而不流，升降之机失度，初伤气分，久延血分，延及郁劳沉疴，故先生用药大旨，每以苦辛凉润宣通，不投燥热敛涩呆补，此其治疗之大法也，此外更有当发明者，郁则气滞，其滞或在形躯，或在脏腑，必有不舒之现症，盖气本无形，郁则气聚，聚则似有形而实无质，如胸膈似阻，心下虚痞胁胀背胀，脘闷不食，气瘕攻冲，筋脉不舒，医家不察，误认有形之滞，放胆用破气攻削，迨至愈治愈剧，转方又属呆补，此不死于病，而死于药矣，不知情志之郁，由于隐情曲意不伸，故气之升降开阖枢机不利，虽内经有泄折达发夺，五郁之治，犹虑难获全功，故疏五过论，有始富后贫，故贵脱势，总属难治之例，盖郁症全在病者能移情易性，医者构思灵巧，不重在攻补，而在乎用苦泄热，而不损胃，用辛理气，而不破气用滑润濡燥涩，而不滋腻气机，用宣通而不揠苗助长，庶几或有幸成，若必欲求十全之治，则惟道家有一言可以蔽之，曰欲要长生，先学短死，此乃治郁之金丹也。（华岫云） </D>