周 因长夏湿热，食物失调，所谓湿多成五泄也，先用胃苓汤分利阴阳。（暑湿热）

胃苓汤去甘草。

温 长夏湿胜为泻，腹鸣溺少，腑阳不司分利，先宜导湿和中。

胃苓汤。

藿香梗 白蔻仁 橘红 桔梗 杏仁 郁金 降香 厚朴

夏至后，热胜湿蒸，气伤神倦，用东垣益气汤，若汗退场门渴，兼生脉散敛液。

某 秋暑秽浊，气从吸入，寒热如疟，上咳痰，下洞泄，三焦蔓延，小水短赤，议芳香辟秽，分利渗湿。

藿香 厚朴 广皮 茯苓块 甘草 猪苓 泽泻 木瓜 滑石 檀香汁

厚朴 杏仁 滑石 寒水石 石膏 猪苓 泽泻 丝瓜叶

某 阴疟久伤成损，俯不能卧，脊强，脉垂，足跗浮肿，乃督脉不用，渐至伛偻废疾，近日暑湿内侵泄泻，先宜分利和中。

厚朴 藿香 广皮 茯苓 泽泻 木瓜 炒扁豆 炒楂肉 炒砂仁

蔡（二一） 气短少续为虚，近日腹中不和，泄泻暑伤，先以清暑和脾，预防滞下。

厚朴 广皮 炙草 茯苓 泽泻 炒扁豆 麦芽 木瓜 炒楂肉 砂仁

叶（五七） 平素操持积劳，五志之火易燃，上则鼻窍堵塞，下有肛痔肠红，冬春温邪，是阳气发越，邪气乘虚内伏，夫所伏之邪，非比暴感发散可解，况兼劳倦内伤之体，病经九十日来，足跗日肿，大便日行五六次，其形粘腻，其色黄赤紫滞，小便不利，必随大便而稍通，此肾关枢机已废，二肠阳腑失司，所进水谷，脾胃不主营运，酿湿坠下，转为瘀腐之形，正当土旺入夏，脾胃主气，此湿热内淫，由乎脾肾日伤，不得明理之医，一误再误，必致变现腹满矣，夫左脉之缓涩，是久病阴阳之损，是合理也，而右脉弦大，岂是有余形质之滞，即仲景所云，弦为胃减，大则病进，亦由阳明脉络渐弛，肿自下日上之义，守中治中，有妨食滋满之弊，大旨中宜运通，下宜分利，必得小溲自利，腑气开阖，始有转机，若再延绵月余，夏至阴生，便难力挽矣。

四苓加椒目、厚朴、益智、广皮白。

（早服） 人参 广皮 防己 厚朴 茯苓 生术 泽泻 神曲 黄连 吴萸

朱 口腹不慎，湿热内起，泄泻复至，此湿多成五泄，气泻则腹胀矣。（湿热）

陈 脉缓大，腹痛泄泻，小溲不利，此水谷内因之湿，郁蒸肠胃，致清浊不分，若不清理分消，延为积聚粘腻滞下，议用芩芍汤。

张 脉缓涩，腹满，痛泻不爽，气郁滞久，湿凝在肠，用丹溪小温中丸。

针砂 小川连 苍术 白术 香附 半夏 广皮 青皮

神曲浆丸。

程 诊脉肝部独大，脾胃缓弱，平昔纳谷甚少，而精神颇好，其先天充旺不待言矣，目今水泻，少腹满胀，少腹为厥阴肝位，由阴阳不分，浊踞于下，致肝失疏泄，当以五苓散导水利湿，仿古急开支河之法。

黄（九岁） 久泻兼发疮痍，是湿胜热郁，苦寒必佐风药，合乎东垣脾宜升，胃宜降之旨。

人参 川连 黄柏 广皮 炙草 生于术 羌活 防风 升麻 柴胡 神曲 麦芽

朱（三四） 形瘦尖长，木火体质，自上年泄泻，累用脾胃药不效，此阴水素亏，酒食水谷之湿下坠，阴弱不能包涵所致，宜苦味坚阴，淡渗胜湿。

炒川连 炒黄柏 厚朴 广皮白 茯苓 猪苓 泽泻 炒楂肉

陈 寒湿已变热郁，六腑为窒为泻。

生台术 厚朴 广皮 白茯苓 益智仁 木瓜 茵陈 泽泻

某（三三） 酒湿内聚痰饮，余湿下注五泄，常用一味茅术丸。

王（氏） 头胀，喜冷冻饮料，咳呕心中胀，泄泻不爽，此为中暑，故止涩血药更甚，舌色白，议清上焦气分。（中暑）

王（二七） 自春徂冬，泻白积，至今腹痛，小水不利，想食物非宜，脾胃水寒偏注大肠，当分其势以导太阳，胃苓汤主之。（中阳湿滞）

胡（二三） 三疟劫截不效，必是阴脏受病，衄血热渴，食入不化痛泻，二者相反，思病延已久，食物无忌，病中勉强进食，不能充长精神，即为滞浊阻痹，先以胀泻调理，不必以疟相混。

草果 厚朴 陈皮 木香 茯苓皮 腹皮 猪苓 泽泻

郁（四八） 经营劳心，纳食违时，饥饱劳伤，脾胃受病，脾失运化，夜属阴晦，至天明洞泻粘腻，食物不喜，脾弱，恶食柔浊之味，五苓通膀胱分泄，湿气已走前阴之窍，用之小效，东垣谓中气不足，溲便乃变，阳不营运，湿多成五泄矣。

人参 生白术 茯苓 炙草 炮姜 肉桂

某（五八） 形寒便泻，舌白。

厚朴 广皮 半夏 茯苓皮 桂枝木 生姜

程（氏） 寒湿腹痛，恶心泄泻。（寒湿）

厚朴 藿香梗 益智仁 广皮 炒茅术 煨木香 茯苓 泽泻

吴（氏） 寒凝胃阳，腹痛泄泻。

草果 厚朴 茅术 广皮 吴萸 炒楂肉

程（氏） 泻后腹膨。

人参 生益智 炮姜 茯苓 厚朴 广皮 砂仁

陆（妪） 气滞为胀，湿郁为泻，主以分消。

炒厚朴 大腹皮 茯苓 泽泻 煨益智 广皮 炒楂肉

某（氏） 雨湿凉气，乘于脾胃，泄泻之后，腹膨减食，宜健中运湿。

焦白术炭 厚朴 广皮 生谷芽 炒扁豆 木瓜 茯苓 泽泻

程（女） 湿郁脾阳，腹满，肢冷泄泻，四苓散加厚朴广皮。

邹（妪） 湿伤泄泻，小便全少，腹满欲胀，舌白不饥，病在足太阴脾，宜温中佐以分利。

夜服针砂丸，开水送一钱五分。六钱。

某（氏） 脉沉缓，肌肉丰盛，是水土禀质，阳气少于营运，水谷聚湿，布及经络，下焦每有重着筋痛，食稍不运，便易泄泻，经水色淡，水湿交混，总以太阴脾脏调理，若不中窾，恐防胀病。

倪（六七） 阳伤湿聚，便溏足肿。

粗桂枝 生白术 木防己 茯苓 泽泻

生白术 桂枝木 淡附子 茯苓 泽泻

陆（五一） 当脐动气，子夜瘕泄，昼午自止，是阳衰寒湿冱凝，腑阳不运，每泻则胀减，宜通不宜涩。

朱 消渴干呕，口吐清涎，舌光赤，泄泻，热病四十日不愈，热邪入阴，厥阳犯胃，吞酸不思食，久延为病伤成劳。（肝犯胃）

陶（十八） 病由春木正旺，中焦受克，先泄泻，继以腹痛，小便不利，食不思纳，皆是六腑不和所致，夫胃为阳土，肝属阴木，腑宜通，肝宜柔宜凉，治胃必佐泄肝，制其胜也，阅方呆补，不知脏腑阴阳，故辨及之。

泡淡黄芩 炒小川连 炒广皮 厚朴 生白芍 炒乌梅肉 猪苓 泽泻

杨 因惊而泻，腹痛欲呕，是为蛔厥，当用酸苦，忌进甜物。

唐 胃中不和，不饥少寐，肝风震动，头迷，溏泄，高年经月未复，两和厥阴阳明。

炒半夏 人参 枳实 茯苓 炒乌梅肉

潘 入夜咽干欲呕，食纳腹痛即泻，此胃口大伤，阴火内风劫烁津液，当以肝胃同治，用酸甘化阴方。

人参（一钱半） 焦白芍（三钱） 诃子皮（七分） 炙草（五分） 陈仓米（三钱）

朱 经月减食泄泻，下焦无力，以扶土泄木法。

人参 焦术 炒益智 茯苓 木瓜 广皮

某 病后，阴伤作泻。

王 霍乱后痛泻已缓，心中空洞，肢节痿弱，此阳明脉虚，内风闪烁，盖虚象也，异功去参术。

加乌梅木瓜白芍。

异功散加木瓜、姜、枣。

某 腹鸣晨泄，巅眩脘痹，形质似属阳不足，诊脉小弦，非二神四神温固之症，盖阳明胃土已虚，厥阴肝风振动内起，久病而为飧泄，用甘以理胃，酸以制肝。

某 头痛损目，黎明肠鸣泄泻，烦心必目刺痛流泪，是木火生风，致脾胃土位日戕，姑议泄木安土法。

徐（六六） 自春季胸胁肌腠，以及腹中疼痛，从治肝小愈，腹鸣泄泻不止，久风飧泄，都因木乘土位，东垣云，治脾胃必先制肝，仿此。（肝犯脾胃）

程 劳损经年，食入腹胀痛泻，心中寒凛，肤腠热蒸，此阳不内潜，脾胃久困，万无治嗽清降之理，议用戊己汤，扶土制木法。

叶（三六） 左胁气胀，在皮膜之里，此络脉中病也，泄肝破气久服，脾胃受困，而为泄泻，得养中小愈，然以药治药，脉络之病仍在。

姜枣汤泛丸。

张（妪） 腹鸣A1J8胀，清晨瘕泄，先以熄肝风，安脾胃方。

人参 茯苓 木瓜 炒乌梅 炒菟丝子

吴萸 生白芍 炒乌梅 人参 茯苓

某 脉右弦，腹膨鸣响痛泻，半年不痊，此少阳木火郁伤脾土，久则浮肿胀满，法当疏通泄郁，非辛温燥热可治。（胆郁伤脾）

吴 阳虚恶寒，恶心吞酸，泄泻，乃年力已衰，更饮酒中虚，治法必以脾胃扶阳。（脾胃阳虚）

赵 晨泄难忍，临晚稍可宁耐，易饥善食，仍不易消磨，其故在乎脾胃阴阳不和也，读东垣脾胃论，谓脾宜升则健，胃宜降则和，援引升降为法。

人参 生于术 炮附子 炙草 炒归身 炒白芍 地榆炭 炮姜灰 煨葛根 煨升麻

生茅术（三钱） 炙草（五分） 生炮附子（一钱） 厚朴（一钱） 广皮（一钱） 制大黄（五分）

金（五八） 能食不化，腹痛泄泻，若风冷外乘，肌肉着冷，其病顷刻即至，上年用石刻安肾丸，初服相投，两旬不效，知是病在中焦，不必固下矣，自述行走数十里，未觉衰倦，痛处绕脐，议用治中法，足太阴阳明主治。

生于术 生茅术 生益智 淡干姜 胡芦巴 茯苓 木瓜 荜茇

王（三五） 三年久损，气怯神夺，此温养补益，皆护元以冀却病，原不藉乎桂附辛热，以劫阴液，今胃减咽干，大便溏泄经月，夏三月脾胃主候，宜从中治。

人参 炒白芍 炙草 煨益智 炒木瓜 茯苓 广皮

金 冲年遗恙，先天最薄，夏秋疟伤，食少不运，痞胀溏泻，都是脾胃因病致虚，当薄味调和，进治中法。

人参 益智 广皮 茯苓 木瓜 炒泽泻 谷芽 煨姜

李（氏） 脉沉，形寒，腰髀，牵强腹鸣，有形上下攻触，每晨必泻，经水百日一至，仿仲景意。

茯苓 炮淡干姜 生于术 肉桂

某（氏） 阳微浊滞，吐泻心痛，当辛温开气，胃阳苏醒乃安。

某（二十） 色白，脉软，体质阳薄，入春汗泄，神力疲倦，大便溏泄不爽，皆脾阳困顿，不克胜举，无以鼓动生生阳气耳，刻下姑与和中为先。（脾阳虚）

杨 小便不利，大便溏泄，补脾法中，佐以淡渗，分其阴阳。

人参 熟术 茯苓 象牙屑 泽泻 苡仁 广皮 白芍

薛（十三） 水谷湿邪内着，脾气不和，腹膨不饥，便溏，四肢酸痹。

厚朴 茯苓皮 大腹皮 防己 广皮 泽泻 苡仁 桂枝木

木防己 生白术 苡仁 木瓜 桂枝木 泽泻

马（四一） 饮酒少谷，中气久虚，晨泄，下部冷，肾阳脾阳两惫，知饥少纳，法当理阳，酒客性不喜甘腻滋柔之药。（脾肾阳虚）

茯苓 覆盆子 生益智 炒菟丝饼 补骨脂 芡实

朱（四十） 酒湿内困，脾肾阳虚，用黑地黄丸蒸饼水煮和丸。

徐（五九） 晨泄病在肾，少腹有瘕，亦是阴邪，若食荤腥厚味，病即顿发，乃阳气积衰，议用四神丸。

席（五四） 阴疟初愈，不慎食物，清阳既微，健运失司，肠胃气滞，遂为洞泄，且足跗微肿，虑其腹笥欲满，夏季脾胃主令，尤宜淡薄，药以通阳为先，平时脾肾两治。

胃苓汤去白术、甘草，接服黑地黄丸去五味。

朱（四一） 久泻无有不伤肾者，食减不化，阳不用事，八味肾气，乃从阴引阳，宜乎少效，议与升阳。

鹿茸 人参 阳起石 茯苓 炮附子 淡干姜

厚朴 广皮 茯苓 猪苓 泽泻 川连 煨木香 炒山楂 炒神曲

僧（五五） 瘕泄一年，食减腹鸣属脾肾阳衰，近腹中微痛，兼理气滞，用陈无择三神丸。

某 背部牵掣入胁，晨泻。

苓桂术甘去甘，加鹿角、姜、枣。

龚（五二） 诊脉两关缓弱，尺动下垂，早晨未食，心下懊憹，纳谷仍不易化，盖脾阳微，中焦聚湿则少运，肾阴衰，固摄失司为瘕泄，是中宜旋则运，下宜封乃藏，是医药至理，议早进治中法，夕用四神丸。

高（氏） 经来腹膨，脐脊酸垂，自秋季泄泻不已，脘痞妨食，用济生丸不应。

鹿角霜 炒菟丝饼 生杜仲 淡苁蓉 茯苓 沙苑 焦归身 炒黑小茴

陈（氏） 产育十五胎，下元气少固摄，晨泄，自古治肾阳自下涵蒸，脾阳始得运变，王氏以食下不化为无阳，凡腥腻沉着之物当忌，早用四神丸晚服理中去术草加益智木瓜砂仁。

张（妪） 泄泻，脾肾虚，得食胀。

人参 炒菟丝子 炒黄干姜 茯苓 煨益智 木瓜

某 泻五十日，腹鸣渴饮，溲溺不利，畏寒形倦，寐醒汗出，用温中平木法。

某 脾肾不摄，五更泻。

某 久泻，脉虚。

人参 五味 禹余粮石

张（氏） 产后不复，腹疼瘕泻。

炒菟丝饼 鹿角霜 生杜仲 淡补骨脂 炒黑小茴 炒杞子 茯苓

顾（氏） 阅病原是劳损，自三阴及于奇经，第腹中气升胃痛，暨有形动触，冲任脉乏，守补则滞，凉润则滑，漏疡久泻寒热，最为吃紧，先固摄下焦为治。

某 肾虚瘕泄。

炒香菟丝子 生杜仲 炒焦补骨脂 茴香 云茯苓

人参 炒菟丝子 炒补骨脂 湖莲肉 芡实 茯苓

顾 脾肾瘕泄，腹膨肢肿，久病大虚，议通补中下之阳。

人参 川熟附 茯苓 泽泻 炒黄干姜

某 肾虚瘕泄，乃下焦不摄，纯刚恐伤阴液，以肾恶燥也，早服震灵丹二十丸，晚间米饮汤调服参苓白术散二钱，二药服十二日。

高 脉细下垂，高年久咳，腹痛泄泻，形神憔悴，乃病伤难复，非攻病药石可愈，拟进甘缓法。（中虚腹痛）

炙甘草 炒白芍 炒饴糖 茯神 南枣

王 过食泄泻，胃伤气陷，津不上涵，卧则舌干微渴，且宜薄味调摄，和中之剂，量进二三可安。（食伤）

人参 葛根 生谷芽 炙甘草 广皮 荷叶蒂

<D>泄泻，注下症也，经云，湿多成五泄，曰飧，曰溏，曰鹜，曰濡，曰滑，飧泄之完谷不化，湿兼风也，溏泄之肠垢污积，湿兼热也，惊溏之澄清溺白，湿兼寒也，濡泄之身重软弱，湿自胜也，滑泄之久下不能禁固，湿胜气脱也，是以胃风汤治有血之飧泄，清六丸疗肠垢之热溏，溏便清溺白，中有硬物，选用理中治中，滑泄脉微气脱，洞下不禁，急投四柱六柱饮，惟濡泄有虚有实，或以胃苓，或以术附，至于脾泄胃泄肾泄大肠泄小肠泄大瘕泄，痰泄郁泄，伤酒伤食泄，古方古法，条载甚详，其急则治标，必使因时随症理固然也，及其缓则治本，惟知燥脾渗湿，义有未尽者乎，盖脾同坤土，本至静之体，而有干健之用，生万物而役于万物，从水从火，为寒为热，历观协热下利者，十不得一二，从水之寒泄者，十常八九焉，言当然者，主治在脾，推所以然者，必求之水火，因思人身水火，犹权衡也，一胜则一负，火胜则水负，水胜则火负，五泄多湿，湿水同气，水之盛，则火之衰也，于是推少阳为三阳之枢，相火寄焉，风火扇胃，而熟腐五谷，少阴为三阴之枢，龙火寓焉，熏蒸脏腑，而转输糟粕，胃之纳，脾之输，皆火之运也，然非雷藏龙驯，何能无燥无湿，势有冒明燎上之眚，如果土奠水安，从此不泛不滥，定无清气在下之患矣，吾故曰，五泄之治，平水火者清其源，崇堤土者塞其流耳，令观叶氏诊记，配合气味，妙在清新，纵横治术，不离规矩，依然下者升，滑者固，寒者温，热者清，脉弦治风，脉濡渗湿，总之长于辨症立方，因而投剂自能辄效，所谓读古而不泥于古，采方而不执于方，化裁之妙，人所难能者，余友吴子翼文，昔在叶氏门墙，曾言先生洞达人情，谙练时务，使之应世，一人杰也，以故小道居此盛名，又闻其应酬之暇，好读两汉，出辞自必高古，惜乎著作长案，不能一见，令人叹息不忘耳。（蒋式玉）

徐评 治泻之法，不过厘清降浊利水通气，案中方亦平妥，重复者七八，编书之人，意欲何为，凡泄泻无不有痰有湿有寒有风，故肠内不和而生此病，案中一味蛮补蛮涩，人参五味方居其半，无邪而纯虚者，或能有效，如正虽虚而尚有留邪者，则此症永无愈期矣，当时误人亦不少也，当时此老名重，凡延诊者，想必病重而久，故案中补涩之味甚多，而厘清降浊者少也。</D>