甘草 --- 胃苓汤去甘草。

白蔻仁 --- 藿香梗 白蔻仁 橘红 桔梗 杏仁 郁金 降香 厚朴

芳香 --- 某 秋暑秽浊，气从吸入，寒热如疟，上咳痰，下洞泄，三焦蔓延，小水短赤，议芳香辟秽，分利渗湿。

泽泻 --- 藿香 厚朴 广皮 茯苓块 甘草 猪苓 泽泻 木瓜 滑石 檀香汁

丝瓜叶 --- 厚朴 杏仁 滑石 寒水石 石膏 猪苓 泽泻 丝瓜叶

炒砂仁 --- 厚朴 藿香 广皮 茯苓 泽泻 木瓜 炒扁豆 炒楂肉 炒砂仁

炒扁豆 --- 厚朴 广皮 炙草 茯苓 泽泻 炒扁豆 麦芽 木瓜 炒楂肉 砂仁

广皮白 --- 四苓加椒目、厚朴、益智、广皮白。

防己 --- （早服） 人参 广皮 防己 厚朴 茯苓 生术 泽泻 神曲 黄连 吴萸

白术 --- 针砂 小川连 苍术 白术 香附 半夏 广皮 青皮

水泻 --- 程 诊脉肝部独大，脾胃缓弱，平昔纳谷甚少，而精神颇好，其先天充旺不待言矣，目今水泻，少腹满胀，少腹为厥阴肝位，由阴阳不分，浊踞于下，致肝失疏泄，当以五苓散导水利湿，仿古急开支河之法。

生于术 --- 人参 川连 黄柏 广皮 炙草 生于术 羌活 防风 升麻 柴胡 神曲 麦芽

广皮白 --- 炒川连 炒黄柏 厚朴 广皮白 茯苓 猪苓 泽泻 炒楂肉

白茯苓 --- 生台术 厚朴 广皮 白茯苓 益智仁 木瓜 茵陈 泽泻

茅术 --- 某（三三） 酒湿内聚痰饮，余湿下注五泄，常用一味茅术丸。

泽泻 --- 草果 厚朴 陈皮 木香 茯苓皮 腹皮 猪苓 泽泻

白术 --- 人参 生白术 茯苓 炙草 炮姜 肉桂

桂枝木 --- 厚朴 广皮 半夏 茯苓皮 桂枝木 生姜

煨木香 --- 厚朴 藿香梗 益智仁 广皮 炒茅术 煨木香 茯苓 泽泻

茅术 --- 草果 厚朴 茅术 广皮 吴萸 炒楂肉

人参 --- 人参 生益智 炮姜 茯苓 厚朴 广皮 砂仁

泽泻 --- 炒厚朴 大腹皮 茯苓 泽泻 煨益智 广皮 炒楂肉

焦白术 --- 焦白术炭 厚朴 广皮 生谷芽 炒扁豆 木瓜 茯苓 泽泻

广皮 --- 程（女） 湿郁脾阳，腹满，肢冷泄泻，四苓散加厚朴广皮。

木防己 --- 粗桂枝 生白术 木防己 茯苓 泽泻

淡附子 --- 生白术 桂枝木 淡附子 茯苓 泽泻

生白芍 --- 泡淡黄芩 炒小川连 炒广皮 厚朴 生白芍 炒乌梅肉 猪苓 泽泻

炒半夏 --- 炒半夏 人参 枳实 茯苓 炒乌梅肉

焦白芍 --- 人参（一钱半） 焦白芍（三钱） 诃子皮（七分） 炙草（五分） 陈仓米（三钱）

焦术 --- 人参 焦术 炒益智 茯苓 木瓜 广皮

白芍 --- 加乌梅木瓜白芍。

木瓜 --- 异功散加木瓜、姜、枣。

姜 --- 姜枣汤泛丸。

炒菟丝子 --- 人参 茯苓 木瓜 炒乌梅 炒菟丝子

生白芍 --- 吴萸 生白芍 炒乌梅 人参 茯苓

生于术 --- 人参 生于术 炮附子 炙草 炒归身 炒白芍 地榆炭 炮姜灰 煨葛根 煨升麻

生茅术 --- 生茅术（三钱） 炙草（五分） 生炮附子（一钱） 厚朴（一钱） 广皮（一钱） 制大黄（五分）

生于术 --- 生于术 生茅术 生益智 淡干姜 胡芦巴 茯苓 木瓜 荜茇

炒白芍 --- 人参 炒白芍 炙草 煨益智 炒木瓜 茯苓 广皮

人参 --- 人参 益智 广皮 茯苓 木瓜 炒泽泻 谷芽 煨姜

生于术 --- 茯苓 炮淡干姜 生于术 肉桂

熟术 --- 人参 熟术 茯苓 象牙屑 泽泻 苡仁 广皮 白芍

桂枝木 --- 厚朴 茯苓皮 大腹皮 防己 广皮 泽泻 苡仁 桂枝木

桂枝木 --- 木防己 生白术 苡仁 木瓜 桂枝木 泽泻

炒菟丝饼 --- 茯苓 覆盆子 生益智 炒菟丝饼 补骨脂 芡实

地黄 --- 朱（四十） 酒湿内困，脾肾阳虚，用黑地黄丸蒸饼水煮和丸。

白术 --- 胃苓汤去白术、甘草，接服黑地黄丸去五味。

淡干姜 --- 鹿茸 人参 阳起石 茯苓 炮附子 淡干姜

煨木香 --- 厚朴 广皮 茯苓 猪苓 泽泻 川连 煨木香 炒山楂 炒神曲

鹿角 --- 苓桂术甘去甘，加鹿角、姜、枣。

炒菟丝饼 --- 鹿角霜 炒菟丝饼 生杜仲 淡苁蓉 茯苓 沙苑 焦归身 炒黑小茴

砂仁 --- 陈（氏） 产育十五胎，下元气少固摄，晨泄，自古治肾阳自下涵蒸，脾阳始得运变，王氏以食下不化为无阳，凡腥腻沉着之物当忌，早用四神丸晚服理中去术草加益智木瓜砂仁。

炒菟丝子 --- 人参 炒菟丝子 炒黄干姜 茯苓 煨益智 木瓜

人参 --- 人参 五味 禹余粮石

炒菟丝饼 --- 炒菟丝饼 鹿角霜 生杜仲 淡补骨脂 炒黑小茴 炒杞子 茯苓

云茯苓 --- 炒香菟丝子 生杜仲 炒焦补骨脂 茴香 云茯苓

炒菟丝子 --- 人参 炒菟丝子 炒补骨脂 湖莲肉 芡实 茯苓

川熟附 --- 人参 川熟附 茯苓 泽泻 炒黄干姜

白术 --- 某 肾虚瘕泄，乃下焦不摄，纯刚恐伤阴液，以肾恶燥也，早服震灵丹二十丸，晚间米饮汤调服参苓白术散二钱，二药服十二日。

炒白芍 --- 炙甘草 炒白芍 炒饴糖 茯神 南枣

炙甘草 --- 人参 葛根 生谷芽 炙甘草 广皮 荷叶蒂

人参 --- 徐评 治泻之法，不过厘清降浊利水通气，案中方亦平妥，重复者七八，编书之人，意欲何为，凡泄泻无不有痰有湿有寒有风，故肠内不和而生此病，案中一味蛮补蛮涩，人参五味方居其半，无邪而纯虚者，或能有效，如正虽虚而尚有留邪者，则此症永无愈期矣，当时误人亦不少也，当时此老名重，凡延诊者，想必病重而久，故案中补涩之味甚多，而厘清降浊者少也。</D>