杏仁 --- 桂枝汤加杏仁。

杏仁 --- 桂枝汤去芍加杏仁。

杏仁 --- 桂枝汤去芍，加杏仁花粉。

麦门冬 --- 金匮麦门冬汤。

姜 --- 复脉汤去参姜桂。

麦冬 --- 张（十七） 冬季温邪咳嗽，是水亏热气内侵，交惊蛰节嗽减，用六味加阿胶麦冬秋石金水同治，是泻阳益阴方法，为调体治病兼方，近旬日前，咳嗽复作，纳食不甘，询知夜坐劳形，当暮春地气主升，夜坐达旦，身中阳气，亦有升无降，最有失血之虞，况体丰肌柔，气易泄越，当暂停诵读，数日可愈。

青蔗浆 --- 冲入青蔗浆一杯。

姜 --- 潘（氏） 久咳不已，则三焦受之，是病不独在肺矣，况乎咳甚呕吐涎沫，喉痒咽痛，致咳之由，必冲脉之伤，犯胃扰肺，气蒸熏灼，凄凄燥痒，咳不能忍，近日昼暖夜凉，秋暑风，潮热溏泄，客气加临，营卫不和，经阻有诸，但食姜气味过辛致病，辛则泄肺气助肝之用，医者知此理否耶，夫诊脉右弦数，微寒热，渴饮，拟从温治上焦气分，以表暑风之邪。

桂枝 --- 桂枝白虎汤。

地骨皮 --- 桑叶 川贝 知母 地骨皮 梨汁 蔗浆 熬膏

麦门冬 --- 金匮麦门冬汤。

白粳米 --- 白粳米汤煎。

麦门冬 --- 徐（二七） 形寒畏风冷，食减久嗽，是卫外二气已怯，内应乎胃，阳脉不用，用药莫偏治寒热，以甘药调，宗仲景麦门冬汤法。

麦门冬 --- 张（十七） 入夏嗽缓，神倦食减，渴饮，此温邪延久，津液受伤，夏令暴暖泄气，胃汁暗亏，筋骨不束，两足酸痛，法以甘缓，益胃中之阴，仿金匮麦门冬汤制膏。

麦门冬 --- 金匮麦门冬汤去半夏加北沙参。

麦门冬 --- 金匮麦门冬汤。

羊肉 --- 另熬生羊肉胶和丸，早服四钱，开水送。

鹿角 --- 章（二五） 自服八味鹿角胶以温补，反咳嗽吐痰，形瘦减食，皆一偏之害，宜清营热，勿事苦寒。（营热）

鲜生地 --- 鲜生地 麦冬 玄参心 甘草 苦百合 竹叶心

麦冬 --- 六味丸加阳秋石、阿胶、麦冬，蜜丸。

金樱 --- 金樱膏丸。

苏子 --- 乐（二九） 热病两三反复，真阴必伤，当戌亥时厥昏汗出者，乃虚阳上冒，肝肾根蒂不牢，冲脉震动，则诸脉俱逆，阳泄为汗耳，此咳嗽乃下焦阴不上承，非肺病也，急当收摄固纳，阅医苏子钩藤，皆泄气锋芒之药，施于阴阳两损之体，最宜斟酌。

青铅 --- 都气加青铅。

人参 --- 朱（五三） 吸气息音，行动气喘，此咳嗽是肾虚气不收摄，形寒怯冷，护卫阳微，肾气丸颇通，形气不足，加人参河车。

盐 --- 薛氏加减八味丸三钱，淡盐汤送下。

山药 --- 山药浆丸。

牛膝 --- 肾气丸去牛膝、肉桂，加沉香蜜丸。

补骨脂 --- 六味加附子、车前、补骨脂、胡桃、沉香。

糯稻根须 --- 用糯稻根须煎汤，煎药。

紫衣胡桃肉霜 --- 早服水制熟地（八两） 白云苓（乳蒸四两） 五味子（去核蒸烘三两） 建莲（去心衣三两） 淮山药（乳蒸四两） 车前子（三两） 怀牛膝（盐水拌蒸烘三两） 紫衣胡桃肉霜（连紫皮研三两）

猪脊髓 --- 上为末，用蒸熟猪脊髓去膜捣丸，服二三钱，开水送。

柿霜 --- 淡水煎汁，滤清收膏，临成加真柿霜二两收，晚上开水化服五钱。

半夏 --- 徐（四八） 色萎脉濡，心悸，呛痰咳逆，劳心经营，气馁阳虚，中年向衰病加，治法中宫理胃，下固肾真，务以加谷为安，缕治非宜，煎药用大半夏汤，早服附都气丸。（中气虚）

麦门冬 --- 金匮麦门冬汤。

炒白芍 --- 异功去白术，加炒白芍、炒山药。

姜 --- 异功加归、芪、姜、枣。

黄芪 --- 黄芪建中汤去姜。

黄芪 --- 陈（二七） 脉细促，久嗽寒热，身痛汗出，由精伤及胃，黄芪建中汤去姜。

黄芪 --- 黄芪建中汤。

附子 --- 李（三四） 久嗽经年，背寒足跗常冷，汗多，色白，嗽甚不得卧，此阳微卫薄，外邪易触，而浊阴挟饮上犯，议和营卫，兼护其阳，黄芪建中汤去饴糖加附子茯苓。

嗽药 --- 任（五六） 劳力伤阳，自春至夏病加，烦倦神羸不食，岂是嗽药可医，内经有劳者温之之训，东垣有甘温益气之方，堪为定法。

黄芪 --- 黄芪建中汤去姜。

黄芪 --- 黄芪建中去姜。

姜 --- 小建中去姜。

黄芪 --- 黄芪建中汤去姜，加人参、五味。

茯神 --- 小建中去姜，加茯神。

黄芪 --- 黄芪建中汤。

屏风 --- 当归桂枝汤合玉屏风散。

黄芪 --- 黄芪建中去姜。

茯神 --- 建中去饴，加茯神，接服四君子汤。

煨姜 --- 异功加煨姜、南枣。

南枣 --- 四君子加南枣。

姜汁 --- 小半夏汤加姜汁。

石膏 --- 小青龙去麻、辛、甘，加石膏。

鸡子黄 --- 某 昨议上焦肺病，百日未痊，形肌消烁，悉由热化，久热无有不伤阴液，拟咸补如阿胶鸡子黄，复入芩连苦寒，自上清气热以补下，虽为暂服之方，原非峻克之剂，细思手经之病，原无遽入足经之理，但人身气机，合乎天地自然，肺气从右而降，肝气由左而升，肺病主降日迟，肝横司升日速，咳呛未已，乃肝胆木反刑金之兆，试言及久寐寤醒，左常似闪烁，嘈杂如饥，及至进食，未觉胃中安适，此肝阳化风，旋扰不息，致呛无平期，即倏热之来，升至左颊，其左升太过，足为明验，倘升之不已，入春肝木司权，防有失血之累，故左右为阴阳之道路，阴阳既造其偏以致病，所以清寒滋阴，不能骤其速功。

柏子仁 --- 旋覆花汤加桃仁柏子仁。