朱 形寒暮热，咳嗽震动，头中脘中胁骨皆痛，先经嗽红，体气先虚，此时序冷热不匀，夹带寒邪致病，脉得寸口独大，当清解上焦，大忌温散之剂。（寒邪）

桑叶 苏梗 杏仁 象贝 玉竹 大沙参

某 风温上受，吐血。（风温）

桑叶 薄荷 杏仁 连翘 石膏 生甘草

徐 阴虚风温气逆嗽血。

顾（四十） 寸口脉，搏指而劲，痰血能食，初因风温咳嗽，震动络血，以清心营肺卫之热。

小生地 黑山栀 地骨皮 天花粉 丹参 连翘 竹叶心

汪 右脉大，咽喉痒呛，头中微胀，此冬温内侵，阳气不伏，络热血得外溢，当调其复邪。（冬温）

桑叶 山栀皮 连翘 白沙参 象贝 牛蒡子

某 脉小而劲，少年体丰，真气易泄，经月咳呛，自非外感，因冬温失藏，咳频震络，痰带血出，当薄味以和上焦，气热得清，病患可却。

糯米汤代水。

王（三五） 脉右大，温邪震络，咳痰带血。（温热）

桑皮 杏仁 山栀皮 花粉 大沙参 石膏

高 温邪上郁清空，目赤头胀，咳呛见血，此属客病，不必为内损法。

连翘 黑山栀 草决明 桑叶 薄荷梗 荷叶边 苦丁茶 花粉

药用急火煎。

唐（二七） 血后，喉燥痒欲呛，脉左搏坚。

玉竹 南花粉 大沙参 川斛 桑叶

糯米饮煎。

高（二一） 脉小涩，欲凉饮，热阻，气升血冒，仍议治上。

嫩竹叶 飞滑石 山栀皮 郁金汁 杏仁汁 新荷叶汁

某 春温嗽痰，固属时邪，然气质有厚薄，不可概以辛散，且正在知识发动之年，阴分自不足，以至咳呛失血，当以甘寒润降，以肃肺金。

鲜枇杷叶 甜杏仁 南沙参 川贝 甜水梨 甘蔗浆

郭 热伤元气，血后咳逆，舌赤，脉寸大。（热）

鲜生地 玄参 丹参 郁金汁 银花 竹叶心 绿豆皮

某 脉涩，咳嗽痰血，不时寒热，此邪阻肺卫所致。（寒热郁伤肺）

苇茎汤加杏仁通草。

孙（二六） 用力，气逆血乱，咳出腥痰浊血，用千金苇茎汤。

某 邪郁热壅，咳吐脓血，音哑。

麻杏甘膏汤加桔梗、苡仁、桃仁、紫菀。

倪（二七） 肛疡溃脓虽愈，阴气已经走泄，当阳气弛张发泄，今加嗽血痰多，胃纳减于平昔，脉数促，喘逆脘闷，姑清肃上焦气分。（上焦气分蓄热）

苏子 杏仁 香豉 黑栀皮 郁金 蒌皮 降香 桔梗

汪（七十） 天明至午，嗽甚痰血，春暖阳浮，是肾虚不藏，闻咳音重浊不爽，先议轻清，治气分之热。

桑叶 南花粉 黑栀皮 桔梗 甘草 橘红

某 脉搏数，舌心灰，咳痰有血，频呕络伤，致血随热气上出，仍理气分。

方 夏热泄气，胃弱冲逆，失血。（暑热）

施 脉小数，舌绛，喉中痒，咳呛血，因暑热旬日，热入营络，震动而溢，凡肺病为手太阴经，逆传必及膻中，仍以手厥阴治。

竹叶心 生地 银花 连翘心 玄参 赤豆皮

高 脉数，汗出身热，吐血五日，胸脘不舒，舌色白，此阴虚本质，暑热内侵营络，渐有时疟之状，小溲茎中微痛，宣通腑经为宜。

鲜生地 连翘 郁金汁 滑石 竹叶 甘草梢

黑栀皮 香豉 蒌皮 郁金 杏仁 橘红

王（氏） 入夏呛血，乃气泄阳升，幸喜经水仍来，大体犹可无妨，近日头胀，脘中闷，上午烦倦，是秋暑上受，防发寒热。

竹叶 飞滑石 杏仁 连翘 黄芩 荷叶汁

江 积瘀在络，动络血逆，今年六月初，时令暴热，热气吸入，首先犯肺，气热血涌，强降其血，血药皆属呆滞，而清空热气，仍蒙闭于头髓空灵之所，诸窍痹塞，鼻窒瘜肉，出纳之气，都从口出，显然肺气郁蒸，致脑髓热蒸，脂液自下，古称烁物消物莫如火，但清寒直泄中下，清空之病仍然，议以气分轻扬，无取外散，专事内通，医工遇此法则，每每忽而失察。（暑热郁肺阻窍）

连翘 牛蒡子 通草 桑叶 鲜荷叶汁 青菊花叶

临服，入生石膏末，煎一沸。

某（二三） 以毒药熏疮，火气逼射肺金，遂令咳呛痰血，咽干胸闷，诊脉尺浮下焦阴气不藏，最虑病延及下，即有虚损之患，姑以轻药，暂清上焦，以解火气。（火气逼肺）

杏仁（三钱） 绿豆皮（三钱） 冬瓜子（三钱） 苡仁（三钱） 川贝（一钱半） 兜铃（七分）

赵（三三） 咳逆自左而上，血亦随之，先以少阳胆络治。（木火升逆扰动阳络）

生地 丹皮 泽兰 茯苓 降香末 荷叶汁

张（三六） 耳目昏蒙，甚于午前，此属少阳郁勃之升，呕恶痰血，多是络热，治以开泄，莫投滋腻。

桑叶 丹皮 黑栀 连翘 菊叶 蒌皮 川贝 橘红

董（十七） 色苍能食，脘有积气，两年秋冬，曾有呛血，此非虚损，由乎体禀木火，嗔怒拂逆，肝胆相火扰动阳络故也。

生地 麦冬 玄参 知母 花粉 百部 桔梗 川贝 蜜丸

严（四二） 脉数涩小结，痰血经年屡发，仍能纳食应酬，此非精血损怯，由乎五志过动，相火内寄肝胆，操持郁勃，皆令动灼，致络血上渗混痰火，必静养数月方安，否则木火劫烁，胃伤减食，病由是日加矣。

丹皮 薄荷梗 菊花叶 黑栀 淡黄芩 生白芍 郁金 川贝

颜 入夏阳升，疾走惊惶，更令诸气益升，饮酒多食樱桃，皆辛热甘辣，络中血沸上出，议消酒毒和阳。

生地 阿胶 麦冬 嘉定花粉 川斛 小黑稆豆皮

沈 脉左坚上透，是肝肾病，血色紫，乃既离络中之色，非久瘀也，劳役暑蒸，内阴不生有诸仿琼玉意，仍是阴柔之通剂。（阴虚）

鲜生地 人参 茯苓 琥珀末

张 血止，脉左大。

天冬 生地 人参 茯神 炙草 生白芍 女贞 旱莲

顾（二八） 脉左坚，阴伤失血致咳。

复脉去参、桂、姜，加白芍。

凡咳血之脉，右坚者，治在气分，系震动胃络所致，宜薄味调养胃阴，如生扁豆茯神北沙参苡仁等类，左坚者乃肝肾阴伤所致，宜地黄阿胶枸杞五味等类，脉弦胁痛者，宜苏子桃仁降香郁金等类，成盆盈碗者，葛可久花蕊石散，仲景大黄黄连泻心汤一症而条分缕晰，从此再加分别，则临症有据矣。

赵（四一） 虚不肯复谓之损，纳食不充肌肤，卧眠不能着左，遇节令痰必带血，脉左细，右劲数，是从肝肾精血之伤，延及气分，倘能节劳安逸，仅堪带病永年，损症五六年，无攻病之理，脏属阴，议平补足三阴法。

张（四十） 失血五六年，脉虚气喘，不运不饥，治在中下二焦，望其安谷精生，勿许攻病为上。

人参 炙草 白芍 茯神 炒熟地 五味

某（二七） 劳力血复来，冲气咳逆，当用摄纳为要。

熟地（四钱） 参三七（一钱） 大淡菜（一两） 牛膝炭（一钱半） 川斛（三钱） 茯神（三钱）

某（四一） 脉弦，胁痛已缓，血仍来。

大淡菜（一两） 参三七（一钱） 牛膝炭（一钱半） 茯苓（二钱） 川斛（三钱） 小黑稆豆皮（三钱）

某（四七） 失血后，咳嗽，咽痛音哑。少阴已亏耗，药不易治。

早服都气丸淡盐汤下。

某（三四） 脉虚数，失血，心悸头眩。

大淡菜（五钱） 牛膝炭（一钱半） 白扁豆（一两） 白茯苓（三钱） 藕节（三枚洗） 糯稻根须（五钱）

某（四九） 血来稍缓，犹能撑持步履，乃禀赋强健者，且能纳谷，阳明未败可验，而脉象细涩，阴伤奚疑。

施（二二） 呛血数发，是阳气过动，诊脉已非实热，夏至一阴来复，预宜静养迎其生气，秋分后再议。

生脉六味去丹、泽，加阿胶秋石蜜丸。

张 脉右弦数，左细涩，阴损，失血后久咳，食减便溏。

某（四三） 失音咽痛，继而嗽血，脉来涩数，已成劳怯，幸赖能食胃强，勿见咳治咳，庶几带病延年。

细生地（三钱） 玄参心（一钱） 麦冬（一钱半） 细川斛（三钱） 鲜莲子肉（一两） 糯稻根须（五钱）

沙（三六） 阴虚，血后痰嗽，必胃强加谷者，阴药可以效灵，形羸食少，滋腻久用，必更反胃，静养望其渐复。

马（五六） 脉左坚右弱，木火易燃，营液久耗，中年春季失血嗽痰，由情志郁勃致伤，抑且少食尪羸，古语谓瘦人之病，虑虚其阴。

某（女） 脉左数，侧眠嗽血。

金（氏） 脉细，左小促，干咳有血，寒热身痛，经水先期，渐渐色淡且少，此脏阴伤及腑阳，奇脉无气，内损成劳，药难骤效。

卢（氏） 沉着厚厚，肝肾之血。

熟地炭 炒杞子 炒归身 牛膝炭 茯神 青铅 砂仁末

缪（二八） 劳伤，血后咳，夜热食少。

清骨散加生地。

耿（三七） 久损，交节血溢。

青铅六味去萸，加炒牛膝川斛，冲热童便服。

某 脉细弦数，阴分不足，痰中带红，肠风，春温之后，再劫津液，以致上下失血，风淫于内，宜咸寒。

生地炭 阿胶 龟胶 玄参 白芍 女贞 茯苓 豆皮

陶（二二） 下虚，阳动失血。（阴虚阳升）

六味去丹、泽，加阿胶、淡菜。

陈 日来寒暄不匀，烦劳阳升，咳呛，震动络血上沸，诊脉左数，五心热，知饥纳谷，议育阴和阳方法。

生地 清阿胶 天冬 麦冬 茯神 川斛 炒牛膝 青铅 童便

陈（五一） 形瘦，脉促数，吸气如喘，痰气自下上升，此属肾虚气不收摄，失血后有此，乃劳怯难愈大症，用贞元饮。

邹（二一） 内伤惊恐，肝肾脏阴日损，阳浮，引阴血以冒上窍，二气不交，日加寒热，骨热咽干不寐，阴分虚，其热甚于夜。

阿胶鸡子黄汤。

沈 劳动阳升，血自左溢。

阿胶 参三七 甜北沙参 茯神 生白扁豆 炒麦冬

江（二二） 少壮情志未坚，阴火易动，遗精淋沥有诸，肾水既失其固，春木地气上升，遂痰中带血，入夏暨秋，胃纳不减，后天生旺颇好，不致劳怯之忧，但酒色无病宜节，有病宜绝，经年之内屏绝，必得却病。

金樱膏丸。

陆（十六） 知识太早，真阴未充，龙火易动，阴精自泄，痰吐带血，津液被烁，幸胃纳安谷，保养少动宜静，固阴和阳可痊。

熟地（水制） 萸肉 山药 茯苓 芡实 远志 五味 牡蛎 白莲须

蜜丸。

徐（四二） 心肾精血不安，火风阳气炽，失血眩晕，心悸溺精，若过用心作劳，不能复元矣。

熟地 萸肉 山药 茯神 芡实 远志 建莲 五味 海参胶

彭（十七） 阴虚有遗，痰嗽有血，诵读久坐阳升。

桑叶 生扁豆 北沙参 麦冬 霍山石斛 生甘草 苡仁 茯苓

吴（二八） 失血在五年前，咳频呕哕，气自上冲逆，乃下元精血之虚，非外邪寒热之咳，痰出腥气，亦从下出，节欲勿劳力，胃壮可免劳怯。

都气丸。

周（二七） 左脉弦数，失血后，咳嗽音嘶少寐，阴亏，阳升不潜之候，当滋养为主。

周（三四） 屡屡失血，饮食如故，形瘦面赤，禀质木火，阴不配阳，据说服桂枝治外感，即得此恙，凡辛温气味宜戒可以无妨。

六味加阿胶、龟甲、天冬、麦冬。

孙（二三） 形瘦脉数，寸口搏指，浮阳易动上冒，都属阴精不旺，幸胃纳尚佳，数发不致困顿，然须戒酒淡欲，怡情静养，水足火不妄动，络血自必宁静矣。

六味加龟甲、秋石。

赵（二八） 屡遭客热伤阴，逢夏气泄吐血，下午火升咳嗽，液亏，阴火自灼，胃口尚健，安闲绝欲可安。

熟地 萸肉 龟甲 淡菜胶 五味 山药 茯苓 建莲 蜜丸

某 内经分上下失血，为阴络阳络，是腑络取胃，脏络论脾，今饮食甚少，柔腻姑缓，上下交病，治在中焦，其午火升烦嗽，亦因血去阴伤，以胃药从中镇补，使生气自充也。

人参 熟地炭 炒杞子 茯神 淡菜 炒牛膝。（四服）

人参 河车胶 大熟地 五味 炒杞子 茯苓 炒牛膝

倘呛逆有声加青铅，喉痒痛，加阿胶秋石，火升用秋石汤煎药，加女贞子，便秘加咸苁蓉柏子仁，血止几日，或涉思虑恼怒，复有胁痛减食不甘，乃少阳木火犯脾，当泄胆益土，用四君加丹皮桑叶。

徐（二六） 脉左垂右弦，阴精不足，胃纳亦少，初冬痰中见红，冬春寐有盗汗，难藏易泄，入夏当防病发，诸凡节劳安逸，经年可望安康。

旱莲草膏丸。

青铅六味加牛膝、白芍。

叶 讲诵烦心五志之阳皆燃，恰值芒种节阴未来复阳气升腾络中血不宁静随阳泄以外溢，午后上窍烦热阴不恋阳之征致头中微痛，主以和阳镇逆。

杜（二七） 脉小数，入尺泽，夏季时令发泄，失血形倦，治宜摄固下焦。

熟地 萸肉 山药 茯神 建莲 五味 芡实 线鱼胶

金樱膏丸。

苏（三九） 脉左坚，冬令失血，能食而咳，脊痛腰酸，乃肾脏不固少纳，肾脉虚馁，五液不承，寐则口干喉燥，宜固阴益气，固本丸加阿胶芡实莲肉丸。

潘（二二） 形色充伟，脉长关搏。述冬季衄血痰血，交夏不病，盖夏月藏阴，冬月藏阳，阳不潜伏，升则血溢降则遗精，乃禀阳体，而性情喜动之累耳。

梅（二九） 性情过动失血，失血贵宁静，不宜疏动，疏动则有泛溢之虞，瘦人阳有余，阴不足，补阴潜阳法。（补阴丸）

某（五十） 脉数咳血，曾咯腥痰若作肺痈，体质木火，因烦劳阳升逼肺，肺热不能生水，阴愈亏而阳愈炽，故血由阳而出也，当金水同治为主。

熟地（四两） 生地（二两） 天冬（二两） 麦冬（二两） 茯神（二两） 龟版（三两） 海参胶（二两） 淡菜胶（二两） 川斛膏（四两） 女贞（一两半） 北沙参（二两） 旱莲草（一两半）

胶膏丸。

邹（二四） 向有失血，是真阴不旺，夏至阴生，伏天阳越于表，阴伏于里，理宜然矣，无如心神易动，暗吸肾阴，络脉聚血，阳触乃溢，阴伏不固，随阳奔腾，自述下有冲突逆气，血涌如泉，盖任脉为担任之职，失其担任，冲阳上冲莫制，皆肾精肝血不主内守，阳翔为血溢，阳坠为阴遗，腰痛足胫畏冷，何一非精夺下损现症，经言精不足者补之以味，药味宜取质静填补，重者归下，莫见血以投凉，勿因嗽以理肺，若此治法，元海得以立基，冲阳不来犯上，然损非旬日可复，须寒暑更迁，凝然不动，自日逐安适，调摄未暇缕悉也。

人参（三钱） 熟地（炒松成炭四钱冷水洗一次） 鲜河车膏（一钱和服） 茯苓（一钱半） 炒黑枸杞子（一钱半） 北五味（一钱研） 沙苑（一钱半） 紫石英（五钱生研）

血脱益气，用人参熟地两仪煎方，谓人参同阴药则补阴，茯苓入阳明，能引阴药入于至阴之乡，河车血肉温养，同石英收镇冲脉，兼以包固大气之散越，五味酸收，领其气液，枸杞温润，同沙苑之松灵入肝络，参方中之药，应乎取味，况肝肾之病，同一治也。

刘（二十） 脉左数入尺，是真阴下亏，先有血症，毕姻后，血复来下午火升呛咳，阴中阳浮保扶胃口以填阴。

娄（二八） 思虑太过，心阳扰动，吸伤肾阴，时时茎举，此失血皆矫阳独升，夜不得寐，归家谈笑怡情可安。

人中白 龟腹甲 知母 黄柏

钱 交夏阳气大升，阴根失涵，火升血溢，必在晡刻，冲年大忌，身心少持，必使阳和阴守为要。

某 口气腥臊，血色混浊，下元无根，恐难接续还元，事已至急，与王先生同议摄阴阳法。

某 脉动极无序，血涌如泉，汗出畏冷，少焉热躁，此无根之阳上冒，血凝成块，非凉药可止。

熟地炭 生龙骨 茯神 五味 浔桂 生白芍 盐水炒牛膝

华（二五） 阳动失血，皆系阴亏，如心悸咽干咳嗽，都是阳浮上亢，必久进填实脏阴，斯浮越自和，面亮油光，皆下虚少纳。

都气加龟版、人乳粉，蜜丸。

徐 阴根愈薄，阳越失交，初夏发泄，血涌吸短，心腹皆热，岂止涩之药可疗，益气摄阴，乃据理治法。

罗 上年胁痹，已属络伤，今夏四月，阳气升发，络中血沸上溢，阴分热蒸，下午乃甚，喉痒而呛，心中嘈杂，肝风内震显然。（阴虚肝风动）

鲜生地 阿胶 丹参 盐水炒牛膝 女贞子 川斛 童便

龚 咳嗽继以失血，经言三焦皆伤，喉痛失音，乃阴液无以上承，厥阳燔燎不已，病深难于奏功，凭理而论，镇胃制肝，乃和阳熄风之义。

淮小麦 南枣 阿胶 茯苓 北沙参 天冬

陆 脉数，血后咳甚，痰腥，肢肿，阳升内风鼓动，最属难治。

沈 味进辛辣，助热之用，致肺伤嗽甚，其血震动不息，阳少潜伏，而夜分为甚，清气热而不妨胃口，甘寒是投，与内经辛苦急，急食甘以缓之恰符。

生甘草 玉竹 麦冬 川贝 沙参 桑叶

罗（十九） 血去络伤，阳气上蒸，胸胁微痛，非有形滞浊，脉得左关前动跃如浮，头中微晕，阳气化风何疑。

鲜生地 麦冬 火麻仁 桑叶 郁金 生香附汁

某 血后气冲，形寒，法当温纳。（血后冲气上逆）

茯苓（三钱） 粗桂枝（八分） 炙草（五分） 五味（七分）

何 早晨未进饮食，咳逆自下焦上冲，有欲呕之象，虚里左胁，呼吸牵引震动，背部四肢寒冷，入暮心腹热灼，而舌上干辣，夫阳虚生外寒，阴虚生内热，阳属腑气，主乎外卫，阴属脏真，主乎内营，由络血大去，新血未充，谷味精华，不得四布，知味容纳，而健运未能自然，胁右少舒，全系胃络，下焦阴精损伤，中焦胃阳不振，夏至初，阴不主来复，交节络血再动，总是既损难以骤复之征，大意下焦阴阳，宜潜宜固，中焦营卫，宜守宜行，用药大旨如此，至于潜心涤虑，勿扰情志，再于子午参以静功，俾水火交，阴阳偶，是药饵已外工夫，皆培植生气之助。（阴阳血虚）

养营汤去黄芪、远志。

（午服） 生脉散。

（早服） 人参 熟地 杞子 当归 苁蓉 肉桂 茯神 五味

某（妪） 操持怫郁，五志中阳动极，失血呛咳有年，皆缘性情内起之病，草木难以奏安，今形色与脉，日现衰惫，系乎生气克削，虑春半以后，地气升，阳气泄，久病伤损，里真少聚，冬春天冷主藏，总以摄补足三阴脏，扶持带病延年，就是人工克尽矣。

马（四五） 阅病原是肾虚嗽血，年分已久，肾病延传脾胃，遂食减腹膨，病是老劳，难以速功，行走喘促，元海无纳气之权，莫以清寒理嗽，急急收纳根蒂，久进可得其益。（阴阳并虚肾气上逆）

人参 人乳粉 坎气 枸杞 沙苑 五味 茯苓 胡桃

宋 脏脉附背，督脉行身之背，足少阴真气不摄，唾中有血，吸气少入，而腰脊酸楚，寐泄魄汗，皆真气内损，若加嗔怒，再动肝阳，木火劫烁脂液，春木日旺，调之非易。

水制熟地 蜜炙五味 女贞 茯神 川斛 炒山药 芡实 湖莲

袁（三六）下虚，当春升之令，形软无力，嗽血复来，以甘温厚味，养其阴中之阳。（阴中阳虚）

枸杞 沙苑 归身炭 牛膝 巴戟 精羊肉

钱 一阳初萌，血症即发，下焦真气久已失固，亡血后，饮食渐减，咳嗽则脘中引痛，冲气上逆，乃下损及中，最难痊愈，拟进摄纳方法。（下损及中）

人参 熟地 五味 茯神 川斛 紫衣胡桃

调入鲜河车胶。

王（十七） 少年阴火直升直降，上则失血咳逆，下坠肛疡延漏，皆虚劳见端，食减至半，胃关最要，非可见热投凉，以血嗽泥治。

熟地炭 建莲 霍石斛 茯神 炒山药 芡实

某（三二） 诊脉数涩，咳血气逆，晨起必嗽，得食渐缓，的是阴损及阳，而非六气客邪，可通可泄，法当养胃之阴，必得多纳谷食，乃治此损之要着。

生扁豆（五钱） 北沙参（一钱半） 麦冬（一钱半） 川斛（三钱） 生甘草（三分） 茯神（三钱） 南枣肉（一钱半） 糯稻根须（五钱）

郑（二八） 虚损四五年，肛漏未愈，其咳嗽失血，正如经旨阴精不主上奉，阳气独自升降，奈何见血投凉，治嗽理肺，病加反复，胃困减食，夫精生于谷，中土运纳，则二气常存，久病以寝食为要，不必汲汲论病。

淡水熬膏，不用蜜收，略饥用五钱参汤送。

某（五五） 向衰之年，夏四月时令，阳气发泄，遇烦劳身中气泄，络血外溢，脏液少涵，遂痰嗽不已，俗医见嗽，愈投清肺滋阴，必不效验，此非少年情欲阴火之比，必当屏烦戒劳，早进都气，晚进归脾，平补脏真，再用嗽药，必然胃减。（脾肾兼虚）

姜（十九） 自上年冬失血，渐形减气弱，精血内损，不肯再复，延成劳怯，填养精血，务在有情，庶几不夺胃气。（肾胃兼虚）

人参 鲜河车胶 水制熟地 五味 茯神 山药 芡实 黑壳建莲

顾（二六） 失血，血形厚厚，必自下先伤，胃减无力，气分亦损，此阴药中，必兼扶胃，非沉滞清寒所宜。

邵（六八） 脉坚，形瘦久咳，失血有年，食物厌恶，夜寝不适，固以培本为要，所服七味八味汤丸，乃肝肾从阴引阳法，服之不效，此液亏不受桂附之刚，当温养摄纳其下，兼与益胃津以供肺。

（晨服） 熟地 苁蓉 杞子 五味 胡桃肉 牛膝 柏子仁 茯苓

蜜丸。

（晚服） 人参 麦冬 五味 炙草 茯苓 鲜莲子 山药

胡（四三） 冬季失藏，吐血，四月纯阳升泄，病不致发，已属万幸，其痰嗽未宜穷治，用药大旨，迎夏至一阴来复，兼以扶培胃气为要。

王（十八） 冲年形瘦，腹胀食减便溏，自上秋失血以来，日加孱弱，脉左坚右涩，虽阴虚起见，而中焦为急，此非小恙。（劳伤中气虚）

席 半月前恰春分，阳气正升，因情志之动，厥阳上燔致咳，震动络中，遂令失血，虽得血止，诊右脉长大透寸部，食物不欲纳，寐中呻吟呓语，由至阴损及阳明，精气神不相交合矣，议敛摄神气法。

参芪建中汤去姜。

徐（四八） 因积劳，久嗽见血，是在内损伤，先圣曰劳者温之，损者益之，温非热药，乃温养之称，甘补药者，气温煦，味甘甜也，今医见血投凉，见嗽治肺最多，予见此治法，胃口立即败坏者不少。

归脾去木香、黄芪，加杞子。

杜（二八） 积劳思虑，内损失血，久病秋季再发，乃夏暑气泄，劳则气愈泄不收，络空动沸，此与阴虚有别，色脉胃减，凉降非法，人参建中汤。

庞 血大去，则络脉皆空，其伤损已非一腑一脏之间矣，秋分寒露，天气令降，身中气反升越，明明里不肯收摄，虚象何疑，今诊脉弱濡涩，肢节微冷，气伤上逆，若烟雾迷离，熏灼喉底，故作呛逆，大旨以上焦宜降宜通，下焦宜封宜固，得安谷崇土，再商后法。

人参 炒黑杞子 炒黑牛膝 茯神 生苡仁 炒山药

人参 茯神 熟术 广皮 南枣

人参 茯神 熟术 广皮 南枣 炒白芍 炙草

陈 脉如数，痰嗽失血，百日来反复不已，每咳呕而汗出，此属气伤失统，络血上泛，凡寒凉止血理嗽，不但败胃妨食，决无一效，从仲景元气受损，当进甘药，冀胃土日旺，柔金自宁。

某 劳伤嗽血。

钱（四一） 形神积劳，气泄失血，食减喘促，由气分阳分之伤，非酒色成劳之比。

黄芪建中汤去姜桂。

陆 脉细形瘦，血后久咳不已，复加喘促，缘内损不肯充复，所投药饵，肺药理嗽居多，当此天令收肃，根蒂力怯，无以摄纳，阴乏恋阳，多升少降，静坐勉可支撑，身动勃勃气泛，所纳食物，仅得其悍气，未能充养精神矣，是本身精气暗损为病，非草木攻涤可却，山林寂静，兼用元功，经年按法，使阴阳渐交，而生生自振，徒求诸医药，恐未必有当，建中汤去姜加茯苓。

董（三六） 此内损症，久嗽不已，大便不实，夏三月，大气主泄，血吐后，肌肉麻木，骨痿酸疼，阳明脉络不用，治当益气，大忌肺药清润寒凉。

黄芪 炙草 苡仁 白及 南枣 米糖

李（三一） 饮酒少谷，中气先虚，酒力温散助热，络血随热气以上沸，血止之后，顿然食减脘痞，显是中气已困败，静坐稍舒，烦言咳急，当以调中为急，若见血见咳，即投寒凉，清阳愈伤，日就败坏矣，虽酒客忌甘，然救其苦寒药伤，勿拘此例。

戊己去术加南枣。

王（二八） 脉软，形劳失血。

小建中加玉竹。

顾（二八） 劳心，神耗营损，上下见血，经年日衰，今勉纳谷不饥，中焦因不至运，滋阴清肺，更令伤中，无却病好药，欲冀其安，须山居静养，寒暑无害，方得坚固。

异功散。

钱（二七） 形瘦脉左数，是阴分精夺，自述谈笑或多，或胃中饥虚，必冲气咳逆，前年已失血盈碗，此下损精血，有形难复，以略精饮食，气返不趋，急以甘药益胃，中流砥柱，病至中不可缓矣。

许（四八） 劳倦伤阳，形寒，失血咳逆，中年不比少壮火亢之嗽血。

黄芪建中汤。

徐（二九） 奔走五日，即是劳力动伤阳气，血从右起，夜有冷汗，乃阳络空隙而泄越矣，凡治吐血之初，多投凉血降气，以冀其止，孰知阳愈渗泄，益增病剧屡矣。

汪 肝风鸱张，胃气必虚，酒客不喜柔腻，肌柔色嫩，质体气弱，清明春木大旺，理必犯土，急宜培养中宫，中有砥柱，风阳不得上越，而血可止矣。

人参 炒黄 炒山药 茯苓 炒白芍 炙草

朱（二二） 秋暑失血，初春再发，诊脉右大，颇能纳食，金匮云，男子脉大为劳，极虚者亦为劳，要之大者之劳，是烦劳伤气，脉虚之劳，为情欲致损，大旨要病根驱尽，安静一年可愈。

某 劳力烦心失血，早食则运，暮食饱胀，疏补调中方。

冯（四五） 脉弦劲，按之空豁，久嗽先有泻血，大便不实，近又嗽血，是积劳久损，阴阳两亏，今食不欲餐，先宜甘温益气，但贫窘患此，参苓未能常继，斯为难调。

许（四四） 频频伤风，卫阳已疏，而劳怒亦令阳伤，此失血症，当独理阳明，胃壮则肝犯自少，脉右空大可证，若三阴之热蒸，脉必参于左部。（胃阳虚卫疏）

汤（二三） 脉细促，右空大，爪甲灰枯，久嗽入春夏见红，食减身痛，形容日瘁，是内损难复，与养营法。（营虚）

丁（二七） 夏季痰嗽，入冬失血，自述昼卧安逸，微寒热不来，则知二气已损伤，身动操持，皆与病相背，脉大无神，面无膏泽，劳怯不复元大着，温养甘补，使寝食两安，若以痰嗽为热，日饵滋阴润肺，胃伤变症，调之无益。

归芪异功散。

陈（二八） 失血，前后心痛。

归建中去姜。

某 形瘦色枯，脉濡寒热，失血心悸，是营伤。

归芪建中去姜。

某 脉芤，汗出，失血背痛，此为络虚。

人参 炒归身 炒白芍 炙草 枣仁 茯神

某（氏） 失血半年，心悸忡胁下动，络脉空隙，营液损伤，议甘缓辛补。

枸杞 柏子仁 枣仁 茯神 炙草 桂圆

夜服三钱。

徐（四九） 馆课之劳，心脾营伤，食酸助木，中土更亏，春阳主升，血乃大吐，况茹素既久，当培土，营阴损极，热自内炽，非实火也。

归脾汤去参。

陈（二三） 先患失血，复遭惊骇，平素有遗泄，独处呓语，是有形精血，无形神气交伤，漫言治痰治血，真粗工卑陋矣，补精宜填，安神宜静，然无形真气为要，与心脾二经主治。

人参（一钱半） 当归（一钱半） 茯神（三钱） 枣仁（三钱） 远志（七分） 炙草（三分） 桂圆（二钱） 龙齿（二钱） 金箔（五张冲入）

宓 遇节血症反复，脉弱废食，胁痛胃软，无治咳止血之理，扶得胃口受纳，可商调理。

人参 炙黄 当归炭 枣仁 茯神 炙草 桂圆肉

关（三二） 思郁伤于心脾，二脏主乎营血，营出中焦，脏阴受损，阴虚生热，熏蒸络脉，致血不宁静，食少痰多，色泽少华，皆虚象也，不宜久进凉润嗽药，当以钱氏异功散，间进归脾汤减木香。

马（六七） 上秋下血，今年涌血，饮橘饼汤甘辛，心中如针刺，营枯液耗，不受辛药，但以甘药柔剂，与心脾有益。

某 老弱虚咳，失血。

生黄芪皮 归身 煨姜 大枣

冯 诊脉左手平和，尺中微动，右手三部，关前动数，尺脉带数，夜卧不寐，咳呛有血，昼日咳呛无血，但行走微微喘促，夫阴阳互为枢纽，隆冬天气藏纳，缘烦心劳神，五志皆动，阳不潜伏，当欲寐之时，气机下潜，触其阳气之升，冲脉升动，络中之血，未得宁静，随咳呛溢于上窍，至于步趋言谈，亦助其动搏气火，此咳呛喘息失血，同是一原之恙，当静以制动，投药益水生金，以制君相之火，然食味宜远辛辣热燥，凡上实者必下虚，薄味清肃上焦，正谓安下，令其藏纳也，愚见约方，参末俟裁。（劳心过度阳升）

生扁豆（一两勿碎） 麦冬（二钱） 川斛（一钱半） 上阿胶（二钱） 小根生地（二钱） 真北沙参（一钱半）

炒枣仁（五钱勿研） 鲜生地（三钱） 天冬（一钱） 炒麦冬（一钱） 茯神（一钱半） 黑牛膝（一钱半） 茜草（一钱） 参三七（一钱磨冲）

卧时服天王补心丹。

查（二十） 舌辣，失血易饥。（心营热）

生地 玄参 连翘心 竹叶心 丹参 郁金汁

陈 血止，脉两寸未和，仍议心营肺卫方。

陈 夜热，邪迫血妄行，议清营热。

邵 营热失血。

王（二十） 脉右大，失血知饥，胃阳上逆，咽干喉痒。（胃阴虚）

生地 扁豆 玄参 麦冬 川斛 新荷叶汁

某（四九） 脉右涩，初气冲失血，咳逆，能食，无味，血来潮涌，乃阳明胃络空虚，血随阳升而然，法当填中为要着，莫见血治咳，而用肺药，斯症可图，正在此欤。

大淡菜（一两） 生扁豆（五钱） 麦冬（三钱） 川斛（三钱） 茯神（三钱） 牛膝炭（一钱半）

陶（十六） 色黄，脉小数，右空大，咳呕血溢，饮食渐减，用建中旬日颇安，沐浴气动，血咳复至，当以静药养胃阴方。

金匮麦门冬汤去半夏。

郭 脉右部不鼓击应指，惟左寸数疾，昨晚失血之因，因于伛偻拾物，致阳明脉络血升，今视面色微黄，为血去之象，不宜凉解妨胃，仿古血脱必先益气，理胃又宜远肝。

王（三六） 肠红愈后，吐血一两月必发，此阳明胃络气血皆多，故吐后寝食如昔，久发阴亏，仍有内损之忧，宜养肺胃之阴以和阳。

生黄芪 北沙参 麦冬 生甘草 茯神

元米汤煎。

程（二七） 吐血数发，肢震，面热汗出，寐中惊惕，盖阳明脉络已虚，厥阴风阳上炽，饮食不为肌肤，皆消烁之征也。

程（二一） 脉左小数，右弦，食减不肌，易于伤风，大便结燥，冬春已见血症，夫胃阳外应卫气，九窍不和，都属胃病，由冬失藏聚，发生气少，遇长夏热蒸，真气渐困故也，急宜绝欲静养，至秋分再议。

参须 黄芪皮 鲜莲子 茯神 炒麦冬 生甘草

某 着右卧眠，喘咳更甚，遇劳动阳，痰必带血，经年久嗽，三焦皆病。

麦门冬汤。

华（三八） 劳怒用力，伤气动肝，当春夏天地气机皆动，病最易发，食减过半，热升冲咽，血去后，风阳皆炽，镇养胃阴，勿用清寒理嗽。

甜北沙参 生白扁豆 生黄芪皮 茯神 炙草

白糯米半升，泡清汤煎药。

徐 阴脏失守，阳乃腾越，咳甚血来，皆属动象，静药颇合，屡施不应，乃上下交征，阳明络空，随阳气升降自由，先以柔剂填其胃阴，所谓执中近之。

金匮麦门冬汤去半夏加黄芪。

某（五九） 失血后，咳嗽不饥，此属胃虚，宜治阳明。

甜北参 生扁豆 麦冬 茯神 川斛

陆 食酸助木，胃土受侮，脘中阳逆，络血上溢，内经辛酸太过，都从甘缓立法，谷少气衰，沉苦勿进。

鲜生地 竹叶心 炒麦冬 建莲肉 川斛 茯神

陶（四一） 两年前吐血咳嗽，夏四月起，大凡春尽入夏，气机升泄，而阳气弛张极矣，阳既多动，阴乏内守之职司，络血由是外溢，今正交土旺发泄，欲病气候，急养阳明胃阴，夏至后，兼进生脉之属，勿步趋于炎熇烈日之中，可望其渐次日安。

金匮麦门冬汤去半夏。

王（二八） 见红两年，冬月加嗽，入春声音渐嘶，喉舌干燥，诊脉小坚，厚味不纳，胃口有日减之虞，此甘缓益胃阴主治。

麦冬 鸡子黄 生扁豆 北沙参 地骨皮 生甘草

卢（四四） 脉大色苍，冬月嗽血，纳谷减半，迄今干咳无痰，春夏间有吐血，夫冬少藏聚，阳升少制，安闲静养，五志气火自平，可望病愈，形瘦谷减，当养胃土之津以生金。

甜北参 麦冬 玉竹 木瓜 生扁豆 生甘草

某（二二） 脉右大左虚，夏四月，阳气正升，烦劳过动其阳，络中血溢上窍，血去必阴伤生热，宜养胃阴，大忌苦寒清火。

北沙参 生扁豆 麦冬 生甘草 茯神 川斛

某（二九） 脉搏，血涌，饥易纳食，风阳过动而为消烁，若不自保摄，饵药无益。

倪（三一） 阳明脉弦空，失血后，咽痹即呛，是纳食虽强，未得水谷精华之游溢，当益胃阴。

北沙参 生扁豆 麦冬 杏仁 生甘草

糯米汤煎。

徐（三一） 失血能食，痰嗽，色苍脉数，可与甘凉养胃中之阴，胃和金生，痔血便躁，柔药最宜。

生扁豆 生地 天冬 麦冬 银花 柿饼灰 侧柏叶

某 失血咽干。

豆皮（三钱） 丹参（一钱） 麦冬（一钱半） 川斛（一钱半） 藕汁（一小杯）

陈 胃虚，客气上逆为呃噫，痰带血星，咽中微痛，姑拟镇摄法。（胃虚气逆）

孙（三五） 脉小弦，血去食减，服地黄柔腻，反觉呆滞，且不喜肥甘，议两和肝胃。（肝胃不和）

苏子 茯苓 金石斛 降香 钩藤 黑山栀

蔡（三九） 新沐热蒸气泄，络血上溢退场门，平昔痰多，又不渴饮，而大便颇艰，此胃气不得下行为顺之旨，兼以劳烦嗔怒，治在肝胃。

金石斛 紫降香 炒桃仁 橘红 苡仁 茯苓

万 脉数左坚，当夏四月，阳气方张，陡然嗔怒，肝阳勃升，络血上涌，虽得血止，而咳逆欲呕，眠卧不得欹左，此肝阳左升太过，木失水涵，阴亏则生热，是皆本体阴阳迭偏，非客邪实火可清可降之比，最宜恬澹无为，安静幽闲，经年不反，可望转偏就和，但图药治，胃减损怯矣，经云胃咳之状，咳逆而呕，木犯胃土贯膈，即至冲咽入肺，肺衰木反刑金，从内经甘缓以制其急。

米炒麦冬 糯稻根须 女贞子 茯神 生甘草 南枣肉

以人参末收实。

某 血去胃伤，当从中治，况五年前劳怒而得病，肝木无不克土，医者温补竞进，气壅为胀，至夜咽干无寐，食物不思，杳不知味，为呕为咳，全是胃阳升逆，经云，胃不和，则卧不安，而阳不潜降，似属浊气胶痰有形之物，阻挠升降而然，古人有二虚一实，当先治实，以开一面之文，余从胃病为主，制肝救中，理气清膈，乃不足中有余圆通之治，此机勿得乱治。

人参 枳实 半夏 杏仁 甘草 竹茹 生姜 大枣

李 暴怒，肝阳大升，胃络血涌甚多，已失气下行为顺之旨，仲淳吐血三要云，降气不必降火，目今不饥不纳，寒腻之药所致。

炒苏子 降香汁 山栀 炒山楂 郁金 茯苓 川斛 丹参

某 左脉细坚搏指，肝阳逆，失血，汗。

熟地 五味 炙草 牛膝 白芍 桂心 童便（冲）

李（氏） 脉细小如无，素多郁怒，经来即病，冬月胃痛，随有咯血不止，寒战面赤，惊惕头摇，显是肝阳变风，络血沸起，四肢逆冷，真气衰微，内经有肝病暴变之文，势岂轻渺，议用景岳镇阴煎法，制其阳逆，仍是就下之义。

熟地炭 牛膝炭 肉桂 茯神 生白芍 童便

炒楂肉 当归 炒延胡 泽兰 桃仁 茯苓

沈（氏） 血后久咳，脘痛食减，经闭便溏，拟进疏泄肝气。（肝气）

苏子 炒丹皮 桃仁 郁金 钩藤 白芍

蔡（三七） 水寒外加，惊恐内迫，阴疟三年，继患嗽血，迄今七年，未有愈期，询及血来紫块，仍能知味安谷，参其疟伤惊伤，必是肝络凝瘀，得怒劳必发，勿与酒色伤损，乱投滋阴腻浊之药，恐胃气日减，致病渐剧。（血络痹阻）

桃仁（三钱） 鳖甲（三钱） 川桂枝（七分） 归须（一钱） 大黄（五分） 茺蔚子（二钱）

柴（二五） 劳伤，寒暖不匀，胁痛嗽血，食物不减，宜降气和络。

苏子 茯苓 降香 橘红 桔梗 苡仁 韭白汁

陆 交春分前五日，肝木升旺之候，涎血大吐，胸脘不爽，此久郁气火灼热，神志失守，遂多惊恐，络中之血，随火升气逆而上，当先降其气，不宜寒苦碍阻。

苏子 降香 丹参 楂肉 桃仁 郁金 茯苓 黑栀皮

吴 脉涩，能食咳血。

降香 桃仁 郁金 苏子 炒山楂 苡仁 韭白汁（冲入）

姚（四五） 此劳伤身动失血，胁有瘕聚，因咳甚而血来，先宜降气。

苏子 苡仁 茯苓 黑山栀 丹皮 降香 荆芥炭 牛膝炭 藕汁

吴（三四） 形畏冷，寒热，左胁有宿痞，失血咳嗽，曾骤劳力，经年尪羸，药不易效。

旋覆花 新绛 归须 炒桃仁 柏子仁 茯神

何（三七） 左乳傍胁中，常似针刺，汗出，心嘈能食，此少阳络脉，阳气燔灼，都因谋虑致伤，将有络血上涌之事，议清络宣通，勿令瘀着。

生地 丹皮 泽兰叶 桃仁 郁金 琥珀末

阿胶 鸡子黄 生地 麦冬 生甘草 生白芍

王（二十） 吐血后，不饥，胸背痛。

苏子 桔梗 郁金 蒌皮 山栀皮 降香

罗（十八） 因左脉坚搏，两投柔剂和阳益阴，血未得止，而右胸似痞，左胁中刺痛，此少阳络脉经由之所，夫胆为清净之腑，阴柔滋养，未能宣通络中，是痛咳未罢，议以辛润宣畅通剂。

桃仁 丹皮 归须 柏子仁 泽兰 降香末

程（四一） 脉左弦，右小濡，据病原起于忧郁，郁勃久而化热，蒸迫络脉，血为上溢，凝结成块者，离络留而为瘀也，血后纳食如昔，是腑络所贮颇富，况腑以通为用，血逆气亦上并，漉漉有声，皆气火旋动，非有形质之物，凡血病五脏六腑皆有，是症当清阳明之络为要，至于病发，当治其因，又不必拘执其常也。

枇杷叶 苡仁 茯苓 苏子 桑叶 丹皮 炒桃仁 降香末

某（二八） 努力咳血，胸背悉痛，当用仲淳法。

苏子 降香汁 炒丹皮 苡仁 冬瓜仁 炒桃仁 牛膝 川贝母

某 冬令过温，人身之气不得潜藏，阴弱之质，血随气逆，诊得阳明脉动，吐出瘀黑，络中离位之血尚有，未可以止涩为事。

生地 丹参 丹皮 降香 桃仁 牛膝 韭汁 童便（冲）

某 肝逆失血。

苏子 郁金 降香汁 炒丹皮 钩藤 赤芍 丹参 茯苓

白糯米汤煎。

侯（十九） 胃脘当心，肝经交络所过，上布于肺，咳嗽胃旁作酸，腹A1J8逆也，当虑失血，脉数能食，宜和络气。

陈（二七） 吐血八日，脘闷胁痛，肢冷，络伤气窒，先与降气和血。（血络痹胸胁痛）

苏子 郁金 杏仁 茯苓 桃仁 降香

翁（二二） 问诵读静坐，痰血夏发，入冬不已，胸胁痛引背部，脉小微涩，非欲伤阴火，夫痛为络脉失和，络中气逆血上，宗仲淳气为血帅。

苏子 苡仁 茯苓 山楂 桑叶 丹皮 降香末 老韭白

江 诊脉数，涕有血，嗽痰，冷热外因动肺，缘素患肝痹，左胁不耐卧着，恐阳升血溢，微用苦辛泄降，不宜通剂。

黑山栀 桑叶 花粉 知母 瓜蒌皮 降香

沈 左胁岑胀，攻触作楚，咳痰带血，无非络中不得宁静，姑进降气通络方。

降香汁 苏子 苡仁 茯苓 橘红 钩藤 白蒺 韭白汁

金（二九） 饥饱劳力，气逆血瘀，胸痛频吐，此液耗阳升，上逆不已，血无止期，先宜降气通调，莫与腻塞。

苏子 降香 桃仁 丹参 韭白汁 山栀 茯苓

某（四一） 脉弦，失血，胁痛气逆。

枇杷叶（三钱） 冬瓜子（三钱） 苏子（一钱） 苡仁（三钱） 炒丹皮（一钱） 桃仁（三钱） 降香汁（八分） 牛膝炭（一钱半）

方（四二） 忧思怫郁，五志气火内燔，加以烟辛泄肺，酒热戕胃，精华营液，为热蒸化败浊，经云，阳络伤则血外溢，盖胃络受伤，阳明气血颇富，犹勉强延磨岁月，至于阳明脉络日衰，斯背先发冷，右胁酸疼，而咳吐不已，胃土愈惫，肝木益横，厥阳愈逆，秽浊气味，无有非自下泛上，大凡左升属肝，右降属肺，由中焦胃土既困，致有升无降，壅阻交迫，何以着左卧眠，遏其升逆之威，且烦蒸热灼，并无口渴饮水之状，病情全在血络，清热滋阴之治，力量不能入络，兹定清养胃阴为主，另进通络之义，肝胆厥阳少和，冀其涎少胁通，积久沉疴，调之非易。

桑叶 丹皮 苡仁 苏子 钩藤 郁金 降香 桃仁

胡（六七） 有年冬藏失司，似乎外感热炽，辛散苦寒，是有余实症治法，自春入夏，大气开泄，日见恹恹衰倦，呼吸喉息有声，胁肋窒板欲痛，咯呛紫血，络脉不和，议以辛补通调，不致寒凝燥结，冀免关格上下交阻之累。

柏子仁 细生地 当归须 桃仁 降香 茯神

石（三四） 先有骨痛鼓栗，每至旬日，必吐血碗许，自冬入夏皆然，近仅可仰卧，着右则咳逆不已，据说因怒劳致病，都是阳气过动，而消渴舌翳，仍纳谷如昔，姑以两和厥阴阳明之阳，非徒泛泛见血见嗽为治。（怒劳血痹）

蒋（六二） 宿伤，怒劳动肝，血溢紫块，先以降气导血。

苏子 降香末 桃仁 黑山栀 金斛 制大黄

某 形盛脉弦，目眦黄，咳痰粘浊，呕血，此胃有湿热胶痰，因怒劳动肝，故左胁中痛，血逆而上，非虚损也，当薄味静调，戒嗔怒，百日可却。

苏子 降香 广皮白 生姜 桃仁 郁金 金斛

六服后，接服海粉丸半斤。

某 向有背痛，尚在劳力，气逆咳血，乃劳伤病也，（劳力伤）归建中去姜加茯苓。

某（二八） 努力伤络，失血面黄，口中味甜，脘中烦闷冲气，病在肝胃，勿以失血，治以滋腻。

旋覆花 代赭石 半夏 淡干姜 块茯苓 南枣肉

吕（二九） 脉数上出，右胁上疼，则痰血上溢，必因嗔怒努力劳烦，致络中气阻所致，宜安闲静摄，戒怒慎劳，一岁之中，不致举发，可云病去。

降香末（八分冲） 炒焦桃仁（三钱） 丹皮（一钱） 野郁金（一钱） 茯苓（三钱） 黑山栀（一钱） 丹参（一钱） 橘红（一钱）

吴（氏） 气塞失血，咳嗽心热，至暮寒热，不思纳谷，此悒郁内损，二阳病发心脾，若不情怀开爽，服药无益。（郁）

李（氏） 情志久郁，气逆痰喘，入夏咳血，都因五志阳升，况脘有聚气，二年寡居，隐曲不伸，论理治在肝脾，然非药饵奏功。

降香末 枇杷叶 苏子 郁金 瓜蒌皮 黑栀皮 茯苓 苡仁

吴（氏） 郁损，咳血频发，当交节气逆，呕吐肢冷厥逆，所现俱是虚劳末路，岂是佳景，勉拟方。

张（氏） 失血，口碎舌泡，乃情怀郁勃内因，营卫不和，寒热再炽，病郁延久为劳，所喜经水尚至，议手厥阴血分主治。

犀角 金银花 鲜生地 玄参 连翘心 郁金

<D>失血一症，名目不一，兹就上行而吐者言之，三因之来路宜详也，若夫外因起见，阳邪为多，盖犯是症者，阴分先虚，易受天之风热燥火也，至阴邪为患，不过其中之一二耳，其治法总以手三阴为要领，究其病在心营肺卫如何，若夫内因起见，不出乎嗔怒郁勃之激伤肝脏，劳形苦志而耗损心脾，及恣情纵欲以贼肾脏之真阴真阳也，又当以足三阴为要领，再审其乘侮制化如何，若夫不内不外因者，为饮食之偏好，努力及坠堕之伤，治分脏腑经络之异，要知外因而起者，必有感候为先，里因而起者，必有内症可据，此三因根蒂用药，切勿混乱，大凡理肺卫者，用甘凉肃降，如沙参麦冬桑叶花粉玉竹川斛等类，治心营者，以轻清滋养，如生地玄参丹参连翘竹叶骨皮等类，以此两法为宗，随其时令而加减，若风淫津涸，加以甘寒，如芦根蔗汁薄荷羚羊之品，若温淫火壮，参入苦寒，如山栀黄芩杏仁石膏之品，若暑逼气分，佐滑石鲜荷之开解，在营与银花犀角之清芳，秋令选纯甘以清燥，冬时益清补以助藏，凡此为外因之大略，所云阴邪为患者，难以并言也，旧有麻黄人参芍药汤，先生有桂枝加减法，至于内因伤损，其法更繁，若嗔怒而动及肝阳，血随气逆者，用缪氏气为血帅法，如苏子郁金桑叶丹皮降香川贝之类也，若郁勃日久而伤及肝阴，木火内燃阳络者，用柔肝育阴法，如阿胶鸡黄生地麦冬白芍甘草之类也，若劳烦不息，而偏损心脾，气不摄血者，用甘温培固法，如保元汤归脾汤之类也，若纵欲而竭其肾真，或阳亢阴胜，或阴伤阳越者，有从阴从阳法，如青铅六味，肉桂七味，并加童便之类也，若精竭海空，气泛血涌者，先生用急固真元，大补精血法，如人参枸杞五味熟地河车紫石英之类也，凡此为内因之大略，至于不内不外因，亦非一种，如案中所谓烟辛泄肺，酒热戕胃之类，皆能助火动血，有治上治中之法，如苇茎汤，甘露饮，茅根藕汁等剂，在人认定而用之可也，坠堕之伤，由血瘀而泛，大抵先宜导下，后宜通补，若努力为患，属劳伤之根，阳动则络松血溢，法与虚损有间，滋阴补气，最忌凝涩，如当归建中汤，旋覆花汤，虎潜丸，金刚四斤丸，取其有循经入络之能也，凡此为不内外因之大略，但血之主司者，如心肝脾三脏，血之所生化者，莫如阳明胃腑，可见胃为血症之要道，若胃有不和，当先治胃也，仁斋直指云，一切血症，经久不愈，每每以胃药收功，想大黄黄连泻心汤，犀角地黄汤，理中汤，异功散，虽补泻寒温不同，确不离此旨，所以先生发明治胃方法独多，有薄味调养胃阴者，如金匮麦冬汤，及沙参扁豆茯神石斛之类，有甘温创建中阳者，如人参建中汤，及四君子加减之类，有滋阴而不碍胃，甘守津还者，如复脉汤加减之类，其余如补土生金法，镇肝益胃法，补脾疏胃法，宁神理胃法，肾胃相关法，无分症之前后，一遇胃不加餐，不饥难运诸候，每从此义见长，源源生化不息，何患乎病之不易医也。（邵新甫）

徐评 此老治血症，其议论大端不信于古，而用药全然不知，此等医案，贻误后人，不可纪极，无容不辩，其大犯在用麦冬五味玉竹沙参，夫麦冬乃补肺之重剂，肺气虚极，气不能续，则用之以补肺气，然仲景往往与半夏同用，如麦门冬汤竹叶石膏是也，盖防其窒腻耳，若吐血咳嗽，乃肺家痰火盘踞之病，岂宜峻补，从此无愈日矣，至五味之酸，一味收敛，仲景用之以治上气咳逆肺脉不合之症，然必与干姜同用，以辛散寒邪，从无独用者，今吐血之嗽，火邪入肺，痰凝血涌，惟恐其不散不降，乃反欲其痰火收住肺中，不放一毫出路，是何法也，其沙参玉竹之补肺，大略相近，呜呼，此又不明后世永无吐血不死之人矣，举世尽然，今为尤甚，伤哉，古时虚劳与吐血，确是二病，虚劳是虚寒症，以温补为主，吐血之症不一，大概属阴虚火旺者为多，此老颇得言之凿凿，但有时仍以建中汤为治，则又误以仲景虚劳治法，混入吐血门中，终是胸无定见也，五十年吐血者极少，诸前辈无不以服补肺药为戒，所以死者绝少，目今吐血者十人而五，不服药者无不生，服麦冬五味者无不死，此虽时令使然，而药误亦不少也，可不畏哉，医案亦多重复可删，大半十同八九，令阅者厌烦，编书无识可笑。</D>