姜 --- 复脉汤去姜、桂。

内虚 --- 汪（五三） 左肢麻木，膝盖中牵纵，忽如针刺。中年后，精血内虚，虚风自动，乃阴中之阳损伤。（阴中阳虚。）

人参 --- 精羊肉胶、阿胶丸，早服四钱，交冬加减，用人参丸服。

屏风 --- 玉屏风散加当归、天麻、童桑。

附子 --- 凡中风症，有肢体缓纵不收者，皆属阳明气虚，当用人参为首药，而附子、黄芪、炙草之类佐之。若短缩牵挛，则以逐邪为急。

芳香 --- 沈 风中廉泉，舌肿喉痹，麻木厥昏，内风亦令阻窍，上则语言难出，下则二便皆不通调。考古人吕元膺，每用芳香宣窍解毒，勿令壅塞致危也。（胞络热邪阻窍。）

葛 --- 葛（三八） 年未四旬，肌肉充盈，中病二年，犹然舌强言謇，舌厚边紫，而纳食便溺仍好。乃心胞络间久积之热弥漫，以致机窍不灵，平昔酒肉助热动风为病，病成反聚于清空之络，医药之治痰治火，直走肠胃，是以久进多投无效。

肉苁蓉 --- 虎潜去锁阳、知母，加大肉苁蓉，炼蜜丸。

地黄 --- 张 脉细小带弦，冬季藏纳少固，遂至痱中，百余日来，诸患稍和，惟语言欲出忽謇，多言似少相续。此皆肾脉不营舌络，以致机窍少宣，乃虚象也。早用地黄饮子煎法以治下，晚用星附六君子以益虚宣窍。

九制熟地 --- 九制熟地（先用水煮半日，徐加醇酒、砂仁，再煮一日，晒干再蒸，如法九次，干者炒存性，八两） 肉苁蓉（用大而黑色者，去甲切片，盛竹篮内，放长流水中浸七日，晒干，以极淡为度，四两） 生虎膝骨（另捣碎，研，二两） 怀牛膝（盐水蒸，三两） 制首乌（四两，烘） 川萆薢（盐水炒，二两） 川石斛（八两，熬膏） 赤白茯苓（四两） 柏子霜（二两）

小黑稆豆皮 --- 上药照方制末，另用小黑稆豆皮八两煎浓汁，法丸，每早百滚水服三钱。

茯苓 --- 议晚上用健中运痰，兼制亢阳。火动风生，从《外台》茯苓饮意。

姜汁 --- 上末，用竹沥一杯，姜汁十匙，法丸，食远开水服三钱。

柿霜 --- 水熬膏，真柿霜收，每服五钱，开水送下。

虎骨胶 --- 上为末，另用虎骨胶三两溶入，蜜捣丸，服五钱，滚水送。

白蒺藜 --- 先将二冬、沙参、天麻、白蒺藜加泉水煎汁滤过，配入四汁同熬成膏，后加柿霜收，每日下午食远服五钱，百滚水调服。

鲜生地 --- 鲜生地，水洗净，捣自然汁二斤，绵纸滤清，随和入生白沙蜜一斤，另置一铅罐或圆铅球，盛前药封坚固，用铁锅满盛清水，中做井字木架，放罐在上，桑柴火煮三昼夜，频添水，不可住火，至三日后，连器浸冷水中，一日顷取出，入后项药。

虎骨胶 --- 上末，以川斛膏同溶化，虎骨胶捣丸，早上滚水服三四钱。

饴糖 --- 熬膏，加饴糖两许，每服时滚水调服三四钱，晚上服。

羊肉 --- 用精羯羊肉胶为丸，早上滚水服四五钱。

桂圆肉 --- 上为末，桂圆肉三两煎汤，法丸，每服三钱，百滚水下。

竹沥 --- 为末，竹沥法丸，早上服三钱，百滚汤下。

酸枣仁 --- <D>风为百病之长，故医书咸以中风列于首门。其论症，则有真中、类中，中经络、血脉、脏腑、之分。其论治，则有攻风劫痰、养血润燥、补气培元之治。盖真中虽风从外来，亦由内虚，而邪得以乘虚而入。北方风气刚劲，南方风气柔和，故真中之病，南少北多。其真中之方，前人已大备，不必赘论。其类中之症，则河间立论云，因烦劳则五志过极，动火而卒中，皆因热甚生火，东垣立论，因元气不足，则邪凑之，令人僵仆卒倒如风状，是因乎气虚，而丹溪则又云，东南气温多湿，由湿生痰，痰生热，热生风，故主乎湿，三者皆辨明类中之由也。类者伪也，近代以来，医者不分真伪，每用羌、防、星、半、乌、附、细辛，以祛风豁痰，虚证实治，不啻如枘凿之殊矣。今叶氏发明内风，乃身中阳气之变动，肝为风脏，因精血衰耗，水不涵木，木少滋荣，故肝阳偏亢，内风时起。治以滋液熄风，濡养营络，补阴潜阳，如虎潜、固本、复脉之类是也。若阴阳并损，无阴则阳无以化，故以温柔濡润之通补，如地黄饮子、还少丹之类是也。更有风木过动，中土受戕，不能御其所胜，如不寐不食，卫疏汗泄，饮食变痰，治以六君、玉屏风、茯苓饮、酸枣仁汤之属。或风阳上僭，痰火阻窍，神识不清，则有至宝丹芳香宣窍，或辛凉清上痰火。法虽未备，实足以补前人之未及。至于审症之法，有身体缓纵不收，耳聋目瞀，口开眼合，撒手遗尿，失音鼾睡，此本实先拨，阴阳枢纽不交，与暴脱无异，并非外中之风，乃纯虚症也，故先生急用大剂参、附以回阳，恐纯刚难受，必佐阴药，以挽回万一。若肢体拘挛，半身不遂，口眼邪，舌强言謇，二便不爽，此本体先虚，风阳夹痰火壅塞，以致营卫脉络失和，治法急则先用开关，继则益气养血，佐以消痰清火，宣通经隧之药，气充血盈，脉络通利，则病可痊愈。至于风痱、风懿、风痹、瘫痪，乃风门之兼症，理亦相同。案中种种治法，余未能尽宣其理，不过略举大纲，分类叙述，以便后人观览。余门仿此。（华岫云）

地黄 --- 徐评 凡风淫所胜之病，自内经以及唐宋名家，皆以辛凉甘寒为本，而佐以驱风益血之药。至河间有地黄饮子之法，此乃治肾虚痱症，有类中风，并非以此方治中风之急症，乃近日诸医遇中风之症，总以人参附桂为开手第一方，轻者不起，重者立毙，问所从来，曰本之叶先生。余始亦信其说果从叶氏出，及阅此书，乃知此翁学有渊源，心思灵变，与前人所论，分毫不背，其人参亦于病势已退后，用以培元养气，当病甚时，必于驱风之药同用，其分两亦不过几分。至钱，无不中度，乃今之窃附其门墙，盗取其余论者，事事相反，此翁有知，能无痛恨，而以此等邪说诬此翁以害人者，对此书能无愧死。</D>