川石斛 --- 六味加麋角胶、秋石、川石斛膏。

炒山药 --- 熟地 炒山药 建莲 茯苓 猪脊筋

姜汁 --- 周（七十） 脉神形色，是老年衰惫，无攻病成法，大意血气有情之属，栽培生气而已，每日不拘用人乳，或牛乳，约茶盏许，炖暖入姜汁三分。

当归 --- 此一通一补之法，白术补太阴，厚朴通阳明，当归补厥阴，丹皮泄少阳，黄芩清气分之热，鳖甲滋血分之热也。

甘蔗 --- 本方去姜、桂，加甘蔗汁。

知母 --- 王（十二） 稚年纯阳，诸阳皆聚于骨，阴未充长，阳未和谐，凡过动烦怒等因，阳骤升巅为痛，熟寐痛止，阳潜入阴也。此非外邪，常用钱氏六味丸，加龟甲知母咸秋石，以滋养壮阴。

生白芍 --- 生六味去萸肉，加生白芍、黄柏、知母、人中白，蜜丸。

猪脊髓 --- 猪脊髓丸。

莲肉 --- 吴（二八） 遗浊已久，上冬喉中哽噎，医投寒解，入夏不痊，缘肾阴为遗消烁，龙雷不肯潜伏，于冬令收藏之候，反升清空之所，内经以少阴之脉循喉咙，挟舌本，阴质既亏，五液无以上承，徒有浮阳蒸灼，柔嫩肺日伤，为痹为宣，不外阴虚阳亢，但养育阴气，贵乎宁静，夫思烦嗔怒，诵读吟咏，皆是动阳助热，不求诸己工夫，日啖草木药汁生气暗伤，岂曰善策，然未尝无药也，益水源之弱，制火炎之炽，早用六味减丹泽，加阿胶秋石龟胶牡蛎湖莲肉之属以入下，介以潜阳，滋填涩固，却是至静阴药，卧时量进补心丹，宁神解热，俾上下得交，经年可冀有成。（阴虚阳浮）

羊肉胶丸 --- 虎潜去广归锁阳，加山药苁蓉青盐，羊肉胶丸。

阿胶 --- 固本丸加淡菜、秋石、阿胶。

龟甲 --- 磁石、六味加龟甲。

羊肉胶丸 --- 生精羊肉胶丸，早服四钱。

龟胶 --- 程 今年厥阴司天，春分地气上升，人身阳气上举，风乃阳之化气，阴衰于下，无以制伏，上愈热，斯下愈寒，总属虚象，故龟胶人乳，皆血气有情，服之小效者，非沉苦寒威也，兹定咸味入阴，介类潜阳法。

猪脊髓 --- 知柏六味去丹、泽，加龟甲、天冬，猪脊髓丸。

猪脊髓 --- 猪脊髓丸。

金樱膏 --- 金樱膏为丸。

白茯苓 --- 鹿茸 鹿角霜 鹿角胶 赤白茯苓 熟地 苁蓉 补骨脂 五味子

枸杞子 --- 晚服归脾，去木香，加枸杞子。

枣 --- 枣艾汤泛丸。

盐 --- 薛氏加减八味丸，淡盐汤送三钱。

羊肉胶丸 --- 羊肉胶丸。

木香 --- 王（三十） 阳虚背寒肢冷，阴虚火升烦惊，宿病偏伤不复，总在虚损一门，镇摄之补宜商，早用薛氏八味丸，晚归脾，去芪、木香。

炒丹皮 --- 四君子加桑叶、炒丹皮。

河车胶 --- 河车胶丸。

五味子 --- 异功加五味子。

炒白芍 --- 异功散去术，加炒白芍、煨益智仁。

黄芪 --- 黄芪建中汤去姜。

姜 --- 某 由阴损及乎阳，寒热互起，当调营卫，参芪建中汤去姜糖。

羊肉 --- 某 入夏发泄主令，由下损以及中焦，减谷形衰，阴伤及阳，畏冷至下，春季进河车羊肉温养，固髓方法，积损难充，不禁时令之泄越耳，古人减食久虚，必须胃药，晚进参术膏，早用封固佐升阳法，长夏不复奈何。

于术 --- 参术膏方 人参四两，另用泉水熬，九蒸于术四两，另用泉水熬，各熬膏成以炭火厚掩干灰，将药罐炖收至极老为度，每用膏二钱五分，开水化服。

人参 --- （晨服） 人参 坎气 茯苓 黑壳建莲 五味 芡实

山药 --- 山药浆丸。

五味子 --- 异功加五味子。

熟地炭 --- 异功散，兼服：熟地炭、茯神、炒黑枸杞、五味、建莲肉、炒黑远志。

山药 --- 山药粉丸，早上服。

麦门冬 --- 金匮麦门冬汤去半夏。

葛 --- 陆 劳伤阳气，不肯复元，秋冬之交，余宗东垣甘温为法，原得小效，众楚交咻柴葛枳朴是饵，二气散越，交纽失固，闪气疼痛，脘中痞结，皆清阳凋丧，无攻痛成法，唯以和补，使营卫之行，冀其少缓神苏而已。

炒麦冬 --- 颜（三四） 操持思虑，心营受病，加以劳力泄气，痰带血出，脉形虚小，右部带弦，议用归脾汤，减桂圆，木香，白术，加炒白芍，炒麦冬。

三七 --- 华（三七） 春深地气升，阳气动，有奔驰饥饱，即是劳伤，内经劳者温之，夫劳则形体震动，阳气先伤，此温字，乃温养之义，非温热竞进之谓，劳伤久不复元为损，内经有损者益之之文，益者补益也，凡补药气皆温，味皆甘，培生生初阳，是劳损主治法则，春病入秋不愈，议从中治，据述晨起未纳水谷，其咳必甚，胃药坐镇中宫为宜。

麦门冬 --- 金匮麦门冬汤去半夏。

人参 --- 杨（二八） 内损，阴及阳分，即为劳怯，胃弱少纳，当以建中汤加人参。

人参 --- 人参小建中汤。

嗽药 --- 汪（三九） 此劳力伤阳之劳，非酒色伤阳之劳也，胃口消惫，生气日夺，岂治嗽药可以奏功。

姜 --- 黄建中汤去姜。

黄芪 --- 当与甘缓，黄芪建中去姜。

白术 --- 戊己汤去白术。

茯神 --- 参芪建中去姜加茯神。

人参 --- 建中汤去糖加人参。

山药 --- 山药浆丸。

红枣 --- 红枣肉丸。

旋覆花 --- 旋覆花汤加桃仁、归须、蒌皮。

桂枝 --- 归桂枝汤去姜，加五加皮。

牡蛎 --- 引伸三才，固本，天真，大造，桂枝龙骨牡蛎，复脉等汤，以及固摄诸方，平补足三阴法，为兼治五脏一切之虚，而大开后人聋聩，可为损症之一助也，夫金匮又云，男子脉大为劳，极虚亦为劳，夫脉大为气分泄越，思虑郁结，心脾营损于上中，而营分萎顿，是归脾，建中，养营，四君，五味，异功等汤之所宜也，脉极虚亦为劳，为精血内夺，肝肾阴不自立，是六味，八味，天真，大造，三才，固本，复脉等汤，以及平补足三阴，固摄诸法所宜也，然仲景以后，英贤辈出，岂无阐扬幽隐之人，而先生以上，又岂无高明好学之辈，然欲舍仲景先生之法，而能治虚劳者，不少概见，即如东垣丹溪辈，素称前代名医，其于损不肯复者每以参术为主，有用及数斤者，其意谓有形精血难复，急培无形之气为要旨，亦即仲景建中诸汤，而扩充者也，又厥后张景岳以命门阴分不足，是为阴中之阴虚，以左归饮，左归丸为主，命门阳分不足者，为阴中之阳虚，以右归饮，右归丸为主，亦不外先生所用三才，固本，天真，大造等汤，以及平补足三阴，固摄诸法，而又别无所见也，故后人称仲景先生善治虚劳者，得其旨矣。（邹滋九）

饴糖 --- 徐评 此老治虚劳之法，不外清肺养胃滋肾，虽无大害，而毫无意义，轻者可愈，重者病日增而已，至其所遵仲景之法，又大失先贤本旨，当时仲景之所谓虚劳者，乃虚寒之症，故其脉浮大芤迟，又方中用饴糖，乃因腹中痛而设，今日之所谓虚劳，乃阴竭而浮火上炎，脉皆细数，与建中汤正相反，乃亦以此为治，此所谓耳食之学也，余曾目睹此老治阴虚火升之人，与建中而变喉痹血冒者，不下数人，当时此老竟不悟也，故附记于此。</D>